Repository: pypi-data/pypi-mirror-99
Catalog: packages/django-protector/django-protector-0.6.10.tar.gz/django-protector-0.6.10/protector/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Restriction options
ru: Настройки ограничений

source: User
ru: Пользователь

source: Users
ru: Пользователи

source: Permission on this object
ru: Право на этот объект

source: Permissions on this object
ru: Права на этот объект

source: Permission
ru: Право

source: Permissions
ru: Права

source: Permission owner
ru: Владелец права

source: Permission owners
ru: Владельцы прав

source: Permission moderator
ru: Модератор права

source: Permission moderators
ru: Модераторы права

source: content type
ru: тип объекта

source: roles
ru: роли

source: permission
ru: право

source: global group permission
ru: Глобальное право групп

source: global group permissions
ru: Глобальные права групп

source: group id
ru: идентификатор группы

source: group content type
ru: тип группы

source: date joined
ru: дата вступления

source: responsible
ru: ответсвенный

source: user to group link
ru: связь пользователя и группы

source: user to group links
ru: связи пользователей и групп

source: object id
ru: идентификатор объекта

source: object type
ru: тип объекта

source: owner id
ru: идентификатор владельца

source: owner type
ru: тип владельца

source: date issued
ru: дата выдачи

source: owner to permission link
ru: связь владельца и права

source: owner to permission links
ru: связи владельцев и прав

source: add permission
ru: добавлять право

source: view restricted objects
ru: видеть ограниченные объекты

source: superuser status
ru: статус суперпользователя

source: Designates that user has all perms
ru: Определяет наличие всех прав у пользователя

source: Participant
ru: Участник

source: parent object
ru: родительский объект

source: Object restriction
ru: Ограничение на объект

source: Objects restrictions
ru: Ограничения на объекты

source: restriction id
ru: идентификатор ограниченного объекта

source: restriction content type id
ru: тип ограниченного объекта
