Repository: pypi-data/pypi-mirror-99
Catalog: packages/django-check-seo/django-check-seo-0.4.0.tar.gz/django-check-seo-0.4.0/django_check_seo/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Meta description is too short
fr: La balise <em>meta description</em> est trop courte

source: between {rule_low} and {rule_high} chars
fr: entre {rule_low} et {rule_high} caractères

source: The meta description tag can be displayed in search results if it has the right length, and can influence users. Knowing that Google classifies sites according to user behaviour, it is important to have a relevant description.
fr: La balise <em>meta description</em> peut être affichée dans les résultats de recherche si elle a la bonne longueur, et peut influencer les utilisateurs. Sachant que Google classe les sites en fonction du comportement des utilisateurs, il est important d'avoir une description pertinente.

source: Meta description is too long
fr: La balise <em>meta description</em> est trop longue

source: Meta description length is correct
fr: La longueur de la balise <em>meta description</em> est bonne

source: No keyword in meta description
fr: Pas de mot-clé dans la balise <em>meta description</em>

# masculin
source: at least one
fr: au moins un

source: Keywords were found in meta description
fr: Des mots-clés ont été trouvés dans la balise <em>meta description</em>

source: Too much meta description tags
fr: Trop de balises <em>meta description</em>

# feminin
source: only one
fr: une seule

source: Although some people write one meta description by targeted keyword, this is still an uncommon practice that is not yet recognized by all search engines.
fr: Bien que certaines personnes remplissent une balise <em>meta description</em> par mot-clé ciblé, il s'agit d'une pratique encore peu courante qui n'est pas encore reconnue par tous les moteurs de recherche.

source: Only one meta description tag
fr: Une seule balise <em>meta description</em>

# feminin
source: one
fr: une

source: No meta description
fr: Pas de balise <em>meta description</em>

# feminin
source: needed
fr: requise

# description
source: none
fr: aucune

source: Meta description is present
fr: La balise <em>meta description</em> est présente

source: %(words)d char
fr: %(words)d caractère

source: Too much h1 tags
fr: Trop de balises <em>h1</em>

source: exactly 1
fr: exactement 1

source: Google is not really concerned about the number of h1 tags on your page, but Bing clearly indicates in its guidelines for webmasters to use only one h1 tag per page.
fr: Google n'est pas vraiment préoccupé par le nombre de balises <em>h1</em> sur votre page, mais Bing indique clairement dans ses directives pour les webmasters d'utiliser une seule balise <em>h1</em> par page.

source: H1 tag found
fr: Balise <em>h1</em> trouvée

source: No h1 tag
fr: Pas de balise <em>h1</em>

source: No keyword in h1
fr: Pas de mot-clé dans la balise <em>h1</em>

source: at least one
fr: au moins un

source: The h1 tag represent the main title of your page, and you may populate it with appropriate content in order to ensure that users (and search engines!) will understand correctly your page.
fr: La balise <em>h1</em> représente le titre principal de votre page, et vous pouvez la remplir avec le contenu approprié afin de vous assurer que les utilisateurs (et les moteurs de recherche !) comprendront correctement votre page.

source: Keyword found in h1
fr: Des mots-clés on été trouvés dans la balise <em>h1</em>

# masculin
source: none
fr: aucun

source: No h2 tag
fr: Pas de balise <em>h2</em>

source: H2 tags are useful because they are explored by search engines and can help them understand the subject of your page.
fr: Les balises <em>h2</em> sont utiles car elles sont lues par les moteurs de recherche et peuvent les aider à comprendre le sujet de votre page.

source: H2 tags were found
fr: Des balises <em>h2</em> ont été trouvées

# feminin
source: at least one
fr: au moins une

source: No keyword in h2 tags
fr: Pas de mot-clé dans la balise <em>h2</em>

source: Google uses h2 tags to better understand the subjects of your page.
fr: Google utilise les balises <em>h2</em> pour mieux comprendre les sujets abordés sur votre page.

source: Keyword found in h2 tags
fr: Des mots-clés on été trouvés dans la balise <em>h2</em>

source: Img lack alt tag
fr: Il manque la balise <em>alt</em> sur une image

source: all images
fr: toutes les images

source: Your images should always have an alt tag, because it improves accessibility for visually impaired people. The name of the file is important too, because it helps Google understand what your image is about. For example, you could rename a file named "IMG0001.jpg" to "tree_with_a_bird.jpg".
fr: Vos images devraient toujours avoir une balise <em>alt</em>, car elle améliore l'accessibilité de votre site pour les personnes malvoyantes. Le nom du fichier est également important, car il aide Google à comprendre de quoi parle votre image. Par exemple, vous pouvez renommer un fichier nommé "IMG0001.jpg" en "arbre_avec_un_oiseau.jpg".

source: Img have alt tag
fr: Chaque image a un tag <em>alt</em>

source: No keyword in URL
fr: Pas de mot-clé dans l'<em>URL</em>

source: Keywords in URL will help your users understand the organisation of your website, and are a small ranking factor for Google. On the other hand, Bing guidelines advises to "<i>keep [your URL] clean and keyword rich when possible</i>".
fr: Les mots-clés dans l'<em>URL</em> aideront vos utilisateurs à comprendre l'organisation de votre site Web, et sont un petit facteur de classement pour Google. D'autre part, les directives de Bing conseillent de "<i>garder [votre <em>URL</em>] propre et riche en mots-clés si possible</i>".

source: Keywords found in URL
fr: Des mots-clés ont été trouvés dans l'<em>URL</em>

source: No keywords in meta keywords field
fr: Pas de mot-clés dans la balise <em>meta keywords</em>

source: Django-check-seo uses the keywords in the meta keywords field to check all other tests related to the keywords. A series of problems and warnings are related to keywords, and will therefore systematically be activated if the keywords are not filled in.
fr: Django-check-seo utilise les mots-clés présents dans le champ <em>meta keywords</em> pour vérifier tous les autres tests liés aux mots-clés. Un certain nombre de problèmes et d'avertissements sont liés aux mots-clés, et vont donc systématiquement être activés si les mots clés ne sont pas renseignés.

source: Keywords found in meta keywords field
fr: Des mots-clés ont été trouvés dans la balise <em>meta keywords</em>

source: Not enough internal links
fr: Pas assez de liens internes

source: at least {}
fr: au moins {}

source: Internal links are useful because they can give the structure of your website to search engines, so they can create a hierarchy of your pages.
fr: Les liens internes sont utiles car ils peuvent renseigner la structure de votre site Web aux moteurs de recherche, ils peuvent ainsi créer une hiérarchie de vos pages.

source: Internal links were found
fr: Des liens internes ont été trouvés

source: Not enough external links
fr: Pas assez de liens externes

source: External links help your users to check your topic and can save them from having to do additional research.
fr: Les liens externes aident vos utilisateurs à vérifier votre sujet et peuvent leur éviter de devoir faire des recherches supplémentaires.

source: External links were found
fr: Des liens externes ont été trouvés

source: [no content]
fr: [pas de contenu]

source: No meta title tag
fr: Pas de balise <em>meta title</em>

source: none
fr: aucun

source: Titles tags are ones of the most important things to add to your pages, sinces they are the main text displayed on result search pages.
fr: La balise <em>meta title</em> est une des balises les plus importantes à ajouter dans vos pages, puisque ce sera son contenu qui sera affiché dans les résultats des moteurs de recherches.

source: Too much meta title tags
fr: Trop de balises <em>meta title</em>

source: Only the first meta title tag will be displayed on the tab space on your browser, and only one meta title tag will be displayed on the search results pages.
fr: Seule la première balise <em>meta title</em> sera affichée dans l'onglet de votre navigateur, et une seule balise <em>meta title</em> sera affichée dans les pages de résultats de recherche.

source: Meta title tag is too short
fr: Le contenu de la balise <em>meta title</em> est trop court

source: more than {}
fr: plus de {}

source: Meta titles tags need to describe the content of the page, and need to contain at least a few words.
fr: Les balises <em>meta title</em> doivent décrire le contenu de la page, et doivent contenir au moins quelques mots.

source: Meta title tag have a good length
fr: Le contenu de la balise <em>meta title</em> est assez long

source: Meta titles tags need to describe the content of the page.
fr: Le contenu de la balise <em>meta title</em> doit décrire le contenu de la page.

source: Meta title tag is too long
fr: Le contenu de la balise <em>meta title</em> est trop long

source: less than {}
fr: moins de {}

source: Only the first ~55-60 chars are displayed on modern search engines results. Writing a longer meta title is not really required and can lead to make the user miss informations.
fr: Seuls les 55 à 60 premiers caractères sont affichés sur les résultats des moteurs de recherche modernes. Écrire un titre plus long n'est pas vraiment requis, et peut mener l'utilisateur à ne pas avoir accès à des informations qui seraient tronquées.

source: Meta title tag do not contain any keyword
fr: Le contenu de la balise <em>meta title</em> ne contient aucun mot-clé

source: Meta titles tags need to contain at least one keyword, since they are one of the most important content of the page for search engines.
fr: Le contenu des balises <em>meta title</em> doivent contenir au moins un mot-clé, puisqu'elles constituent l'un des contenus les plus importants de la page pour les moteurs de recherche.

source: Keywords found in meta title tag
fr: Des mots-clés ont été trouvés dans le contenu de la balise <em>meta title</em>

source: Too many levels in path
fr: Trop de niveaux dans le chemin de l'<em>URL</em> la page

source: Google recommand to organize your content by adding depth in your url, but advises against putting too much depth.
fr: Google recommande d'organiser votre contenu en ajoutant de la profondeur dans votre <em>URL</em>, mais déconseille de trop en mettre.

source: URL is too long
fr: L'<em>URL</em> est trop longue

source: Shorter URLs tend to rank better than long URLs.
fr: Les <em>URL</em> plus courtes ont tendance à être mieux classées que les <em>URL</em> longues.

source: Right amount of level in path
fr: Profondeur de l'<em>URL</em> correcte

source: URL length is great
fr: Longueur de l'<em>URL</em> correcte

source: Content is too short
fr: Le contenu est trop court

source: at least {min} words, more than {min2} if possible
fr: au moins {min} mots, plus de {min2} si possible

source: Longer articles tend to be better ranked, but will require better writing skills than shorter articles.
fr: Les articles plus longs ont tendance à être mieux classés, mais exigeront de meilleures compétences en rédaction que les articles plus courts.

source: Content length is right
fr: La longueur du contenu est correcte

source: No keyword in first paragraph
fr: Aucun mot-clé dans le premier paragraphe

source: before {settings} words
fr: avant {settings} mots

source: The reader will be relieved to find one of his keywords in the first paragraph of your page, and the same logic applies to Google, which will consider the content more relevant.
fr: Le lecteur sera soulagé de trouver un de ses mots-clés dans le premier paragraphe de votre page, et la même logique s'applique à Google, qui jugera le contenu plus pertinent.

source: Keywords found in first paragraph
fr: Des mots-clés on été trouvés dans le premier paragraphe

source: Keywords:
fr: Mots-clés :

source: no keywords!
fr: aucun mot-clé !

source: on the public page
fr: sur la page publique

source: Successful checks
fr: Vérifications réussies

source: About
fr: À propos

source: The main objective of this application is to check the aspects of the web pages involved in SEO, to ensure that the page content will be correctly crawled by search engines.
fr: L'objectif principal de cette application est de vérifier les aspects des pages web impliqués dans le référencement, pour s'assurer que le contenu de la page sera correctement parcouru par les moteurs de recherche.

source: The documentation is available via the <a href="https://github.com/kapt-labs/django-check-seo/wiki" target="_blank">project wiki</a>.
fr: La documentation est disponible via le <a href="https://github.com/kapt-labs/django-check-seo/wiki" target="_blank"><em>wiki</em> du projet</a>.

source: Raw data are here for debug purposes. Join at least your settings if you're submitting <a href="https://github.com/kapt-labs/django-check-seo/issues">a new issue</a>.
fr: Les données brutes sont affichées à des fins de débogage. Joignez au moins les paramètres si vous soumettez <a href="https://github.com/kapt-labs/django-check-seo/issues">un nouveau <em>ticket</em></a>.

source: See extracted html
fr: Voir <em>html</em> extrait

source: See extracted content
fr: Voir le contenu extrait

source: See settings
fr: Voir les paramètres

source: settings
fr: paramètres

# checkseo
source: found
fr: trouvé

source: Searched in:
fr: Recherché dans :

source: No data
fr: Aucune donnée

source: <strong class="green-bg">No problem</strong> was found on the page!
fr: <strong class="green-bg">Aucun problème</strong> n'a été trouvé sur la page !

source: <strong class="green-bg">No problem</strong> found, and
fr: <strong class="green-bg">Aucun problème</strong> trouvé, et

source: {nb_problems} problem</strong> found, and
fr: {nb_problems} problème</strong> trouvé, et

source: <strong class="green-bg">no warning</strong> raised
fr: <strong class="green-bg">pas d'avertissement</strong> levé

source: {nb_warnings} warning</strong> raised
fr: {nb_warnings} avertissement</strong> levé
