Repository: pypi-data/pypi-mirror-99
Catalog: packages/sahara-plugin-mapr/sahara-plugin-mapr-5.0.0.0rc1.tar.gz/sahara-plugin-mapr-5.0.0.0rc1/sahara_plugin_mapr/locale/*/LC_MESSAGES/sahara_plugin_mapr.po
Languages: de

source: %(message)s, required by %(required_by)s
de: %(message)s, benötigt von %(required_by)s

source: %(service)s service cannot be installed alongside %(package)s package
de: Der Dienst %(service)s kann nicht zusammen mit dem Paket %(package)s installiert werden

source: %s is in running state
de: %s befindet sich im aktiven Zustand

source: %s is not in running state
de: %s befindet sich nicht im aktiven Zustand

source: %s must have at least 1 volume or ephemeral drive
de: %s muss mindestens 1 Datenträger oder ephemeres Laufwerk haben

source: CLDB failed to start
de: CLDB konnte nicht gestartet werden

source: Can not map service
de: Der Dienst kann nicht zugeordnet werden

source: Config '%s' missing 'value'
de: Config '%s' fehlender 'value'

source: Config missing 'name'
de: Config fehlender 'name'

source: Configure SSH connection
de: Konfiguriere SSH-Verbindung

source: Configure cluster topology
de: Konfiguriere Cluster-Topologie

source: Configure database
de: Datenbank konfigurieren

source: Create Sentry role for Hive
de: Erstelle Sentry-Rolle für Hive

source: Execute configure.sh
de: Führe configure.sh aus

source: Hadoop cluster should contain at least %(expected_count)d %(component)s component(s). Actual %(component)s count is %(actual_count)d
de: Hadoop-Cluster sollte mindestens %(expected_count)d %(component)s-Komponente(n) enthalten. Tatsächliche %(component)s Anzahl ist %(actual_count)d

source: Hadoop cluster should contain at most %(expected_count)d %(component)s component(s). Actual %(component)s count is %(actual_count)d
de: Hadoop-Cluster sollte höchstens %(expected_count)d %(component)s Komponente(n) enthalten. Tatsächliche %(component)s Anzahl ist %(actual_count)d

source: Hadoop cluster should contain odd number of %(component)s but %(actual_count)s found.
de: Der Hadoop-Cluster sollte eine ungerade Anzahl von %(component)s, aber %(actual_count)s sind enthalten.

source: Initializing MapR-FS
de: Initialisieren von MapR-FS

source: Install %s service
de: Installiere den %s Dienst

source: Install Java
de: Installiere Java

source: Install MapR repositories
de: Installiere MapR-Repositories

source: Install MySQL client
de: Installiere MySQL-Client

source: Install Scala
de: Installiere Scala

source: Install security repos
de: Installiere Sicherheitsrepositionen

source: Invalid argument type %s
de: Ungültiger Argumenttyp %s

source: Migrating Hue database
de: Migrieren der Hue-Datenbank

source: Node "%(ng_name)s" is missing component %(component)s
de: Knoten '%(ng_name)s' fehlt Komponente %(component)s

source: Node failed to connect to CLDB: %s
de: Knoten konnte keine Verbindung zu CLDB herstellen: %s

source: Rebuilt Oozie war
de: Wiederaufbau von Oozie war

source: Service %(service)s requires %(os)s OS. Use %(os)s image and add "%(os)s" tag to it.
de: Service %(service)s benötigt %(os)s OS. Verwenden Sie das %(os)s Abbild und fügen Sie das '%(os)s'-Tag hinzu.

source: Service not found in services list
de: Dienst nicht in der Serviceliste gefunden

source: Set cluster mode
de: Stelle Cluster-Modus

source: Some %s processes are not in running state
de: Einige %s-Prozesse sind nicht im aktiven Zustand

source: Some ZooKeeper processes are not in running state
de: Einige ZooKeeper-Prozesse sind nicht im aktiven Zustand

source: Specifies CentOS MapR core repository.
de: Gibt das CentOS MapR-Kernrepository an.

source: Specifies CentOS MapR ecosystem repository.
de: Gibt das CentOS MapR-Ökosystem-Repository an.

source: Specifies Sentry storage mode.
de: Gibt den Sentry-Speichermodus an.

source: Specifies Ubuntu MapR core repository.
de: Gibt das Ubuntu MapR-Core-Repository an.

source: Specifies Ubuntu MapR ecosystem repository.
de: Gibt das Ubuntu MapR-Ökosystem-Repository an.

source: Specifies heap size for MapR-FS in percents of maximum value.
de: Legt die Größe des Heapspeichers für MapR-FS in Prozent des Maximalwerts fest.

source: Specifies that MapR-DB is in use.
de: Gibt an, dass MapR-DB verwendet wird.

source: Specifies thrift version.
de: Gibt die thrift Version an.

source: Specify the version of the service
de: Geben Sie die Version des Service an

source: Start CLDB nodes
de: Starte CLDB-Knoten

source: Start ZooKeepers nodes
de: Starten Sie ZooKeepers-Knoten

source: Start non-CLDB nodes
de: Starte Sie Nicht-CLDB Knoten

source: Stop Warden nodes
de: Stoppe Warden-Knoten

source: Stop ZooKeepers nodes
de: Stoppe ZooKeepers-Knoten

source: Template object must be defined
de: Vorlagenobjekt muss definiert sein

source: The MapR Distribution provides a full Hadoop stack that includes the MapR File System (MapR-FS), MapReduce, a complete Hadoop ecosystem, and the MapR Control System user interface
de: MapR Distribution bietet einen vollständigen Hadoop-Stapel, der das MapR-Dateisystem (MapR-FS), MapReduce, ein vollständiges Hadoop-Ökosystem und die Benutzeroberfläche des MapR-Steuerungssystems enthält

source: Wait for {node_process} on {instance} to change status to "{status}"
de: Warten Sie auf {node_process} auf {instance}, um den Status in "{status}" zu ändern

source: Write config files to instances
de: Schreibe Konfigurationsdateien in Instanzen

source: ZooKeeper is in running state
de: ZooKeeper ist in Bearbeitung

source: ZooKeeper is not in running state
de: ZooKeeper befindet sich nicht im aktiven Status
