Repository: pypi-data/pypi-mirror-99
Catalog: packages/invenio-app-rdm/invenio-app-rdm-2.0.0.dev4.tar.gz/invenio-app-rdm-2.0.0.dev4/invenio_app_rdm/translations/*/LC_MESSAGES/messages.po
Languages: tr

source: The turn-key research data management repository
tr: Anahtar teslim araştırma verileri yönetimi sistemi

source: Welcome to Invenio App RDM!
tr: Invenio App RDM'e Hoşgeldiniz!

source: Powered by <a href="%(invenio_rdm)s">InvenioRDM</a>
tr: <a href="%(invenio_rdm)s">InvenioRDM</a> üzerine inşa edilmiştir.

source: You've successfully installed InvenioRDM! What is ahead?
tr: InvenioRDM'i başarı ile yüklediniz! Sırada ne var?

source: Configure
tr: Yapılandır

source: Configure the datamodel, resource types, permissions and much more to make it suit your needs! For more information on how to do it visit the <a href="%(configuration_link)s">configuration section in the docs</a>.
tr: Veri modelini, kaynak tiplerini, izinleri ve daha fazlasını ihtiyaçlarınıza uyacak şekilde yapılandırabilirsiniz! Nasıl yapılacağı ile ilgili daha fazla bilgi almak için dokümantasyondaki <a href="%(configuration_link)s"> yapılandırma bölümünü</a> ziyaret edin.

source: Customize
tr: Özelleştir

source: Customize the layout and adapt the styling to match your institution's. See how to do so <a href="%(configuration_link)s">here</a>. You can also add new functionality using <a href="%(extensions_link)s">supported plugins</a>, or <a href="%(custom_extension_link)s">writing your own</a>.
tr: Kurumunuzun tarzına uyacak şekilde görünümü özelleştirin. Nasıl yapılacağını <a href="%(configuration_link)s">buradaki</a> linkten görebilirsiniz. Aynı zamanda <a href="%(extensions_link)s">desteklenen eklentiler</a> ile ya da <a href="%(custom_extension_link)s">kendi eklentinizi yazarak</a> yeni işlevler ekleyebilirsiniz.

source: Deploy it!
tr: Kurulumu yapın!

source: Use the Helm charts to deploy your InvenioRDM instance. You can use the Helm chart to <a href="%(deployment_link)s">deploy in OpenShift</a>.
tr: Kendi InvenioRDM kopyanızı kurmak için Helm Charts kullanın. Helm chart'ı <a href="%(deployment_link)s">OpenShift'te kurmak</a> için kullanabilirsiniz.

source: Docs
tr: Dokümanlar

source: Code
tr: Kaynak Kodu

source: Brought to you by
tr: Katkı sağlayanlar

source: Search
tr: Ara

source: Type and press enter to search
tr: Yazın ve aramak için enter'a basın
