Repository: pypi-data/pypi-mirror-99
Catalog: packages/Products.MeetingCommunes/Products.MeetingCommunes-4.1.23.tar.gz/Products.MeetingCommunes-4.1.23/src/Products/MeetingCommunes/locales/*/LC_MESSAGES/imio.history.po
Languages: fr

source: create_to_codir_from_meeting-config-bp_comments
fr: Point CoDir créé depuis un point Bureau Permanent.

source: create_to_codir_from_meeting-config-college_comments
fr: Point CoDir créé depuis un point Collège Communal.

source: create_to_cogest_from_meeting-config-college_comments
fr: Point CoGest créé depuis un point Collège Communal.

source: create_to_meeting-config-ag_from_meeting-config-ca_comments
fr: Point AG créé depuis un point CA.

source: create_to_meeting-config-bp_from_codir_comments
fr: Point BP créé depuis un point CoDir.

source: create_to_meeting-config-cas_from_meeting-config-bp_comments
fr: Point CAS créé depuis un point BP.

source: create_to_meeting-config-college_from_codir_comments
fr: Point Collège Communal créé depuis un point CoDir.

source: create_to_meeting-config-college_from_cogest_comments
fr: Point Collège Communal créé depuis un point CoGest.

source: create_to_meeting-config-college_from_meeting-config-council_comments
fr: Point Collège Communal créé depuis un point Conseil Communal.

# create_to_meeting-config-council_from_meeting-config-college_comments
source: Item created from a college item.
fr: Point Conseil Communal créé depuis un point Collège Communal.

source: create_to_meeting-config-zcollege_from_codir_comments
fr: Point Collège créé depuis un point CoDir.

source: create_to_meeting-config-zcollege_from_meeting-config-em_comments
fr: Point Collège créé depuis un point Etat-Major.

source: create_to_meeting-config-zcouncil_from_meeting-config-zcollege_comments
fr: Point Conseil créé depuis un point Collège.
