Repository: pypi-data/pypi-mirror-99
Catalog: packages/Products.MeetingCommunes/Products.MeetingCommunes-4.1.23.tar.gz/Products.MeetingCommunes-4.1.23/src/Products/MeetingCommunes/locales/*/LC_MESSAGES/PloneMeeting.po
Languages: fr

source: Meeting config College
fr: Collège Communal

source: Meeting config Council
fr: Conseil Communal

source: MeetingAdviceFinances
fr: Avis finances

# MeetingCommunes_descr_echevinServices
source: If the group is responsible of other groups, select them here above, either do not select any elements of the list.
fr: Si ce groupe est responsable d'autres groupes, selectionnez les ci-dessous.

# MeetingCommunes_label_echevinServices
source: Alderman of the following services (departments)
fr: Echevin des services suivants

# MeetingCommunes_label_initItemDecisionIfEmptyOnDecide
source: Initialize the item decision when deciding meeting
fr: Initialiser le champ décision des points lorsque la séance passe 'En rédaction du PV'?

source: add_new_meetingadvicefinances
fr: Ajouter un avis finances

source: cautious_finance
fr: Avis finances réservé

source: completeness_not_complete
fr: Vérifiez le champ "Complétude" sur le point.

source: financialcontrollers
fr: Contrôleurs financiers

source: financialeditors
fr: Rédacteurs financiers

source: financialmanagers
fr: Directeurs financiers

source: financialreviewers
fr: Validateurs financiers

source: front_page_body
fr: <p>Avant de tester, nous vous recommandons de lire la <span class="link-external"><a target='_blank' href='https://docs.imio.be/imio-doc/ia.delib/'>documentation</a></span> qui explique en détails le fonctionnement du logiciel. Ce manuel évolue constamment.<br> <br>La gestion de cette application repose sur différents profils auxquels sont liés des droits (un même utilisateur peut avoir plusieurs profils), <i>le mot de passe pour vous connecter avec les différents profils vous a été envoyé par e-mail</i>:</p><p><strong>1) Le profil "agent communal"</strong> qui permet de créer des points à proposer à la séance</p> <p>Pour vous connecter en tant qu'agent du service du "Personnel", utilisez le login de test créé à cet effet (login=<strong>agentPers</strong>).&nbsp;</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et gérer vos points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>2) Le profil "chef de service"</strong> qui permet de valider un point proposé par un agent de son service</p> <p>Pour vous vous connecter en tant que chef du service "Personnel", utilisez le login de test créé à cet effet (login=<strong>chefPers</strong>).&nbsp;</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et gérer vos points et ceux du service.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>3) Le profil "émetteur d'avis"</strong> qui permet de donner un avis sur un point (si cet avis a été demandé)</p> <p>Pour vous connecter en tant qu'émetteur d'avis pour le service "Comptabilité", utilisez le login de test créé à cet effet (login=<strong>chefCompta</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et visualiser les points pour lesquels un avis est nécessaire.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>4) Le profil "Directeur Général"</strong> qui permet de créer un ordre du jour, d'y ajouter des points proposés et de compléter le PV des séances<br> Pour vous connecter en tant que "Directeur Général", utilisez le login de test créé à cet effet (login=<strong>dgen</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et visualiser les points, les séances, les PV, ...<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>5) Le profil "échevin" ou lecteur</strong> qui permet de consulter les points sans pouvoir les modifier</p> <p>Pour vous connecter en tant que personne pouvant consulter des points pour le service "Personnel", utilisez le login de test créé à cet effet (login=<strong>echevinPers</strong>).</p> <p class='discreet'>Une fois connecté, vous pouvez visualiser les points du service et les points inclus à l'odre du jour.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>6) Un profil "observateur de toutes les séances"</strong> qui permet d'avoir un accès en lecture à tous à partir du moment où l'élément est passé par l'étape "gelé"</p> <p>Pour vous connecter en tant que personne pouvant consulter tout, utilisez le login de test créé à cet effet (login=<strong>bourgmestre</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez cliquer sur n'importe quel onglet et accéder à l'ensemble des points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>7) Un profil "observateur pour le conseil"</strong> qui permet d'avoir un accès en lecture à tout le conseil à partir du moment où l'élément est passé par l'étape "gelé"</p> <p>Pour vous connecter en tant que personne pouvant consulter tout le conseil, utilisez le login de test créé à cet effet (login=<strong>conseiller</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez accéder à un type de séance et visualiser l'ensemble des points.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p><p><strong>6) Un profil "Directeur Financier"</strong> qui est un profil cumulant plusieurs rôles : accès à tous les points en lecture, possibilité de modifier les informations budgétaires des points dans certains états, possibilité de rendre un avis sur un point même si l'avis n'a pas été demandé, ...</p> <p>Pour vous connecter en tant que "Directeur Financier", utilisez le login de test créé à cet effet (login=<strong>dfin</strong>).</p><p class='discreet'>Une fois connecté, vous pouvez cliquer sur l'onglet désiré et tester sur les différents points existants dans différents états.<br>N'oubliez pas de vous déconnecter avant de tester un autre profil.</p>

# init_item_decision_if_empty_on_decide
source: If you check this box, when a meeting will be decided, if an item does not have a decision defined, this decision will be automatically filled with title and description of the item
fr: Si cette case est cochée, lorsqu'une séance passera 'En rédaction du PV', pour tous les points dont le champ 'Décision' est vide, ce champ sera automatiquement rempli avec une concaténation de ce qui est défini dans le titre et la description du point

source: negative_finance
fr: Avis finances défavorable

source: not_given_finance
fr: Avis finances non remis

source: not_required_finance
fr: Avis finances non requis

source: positive_finance
fr: Avis finances favorable

source: positive_with_remarks_finance
fr: Avis finances favorable avec remarques

source: searchadviceadvicecreated
fr: Avis finances en création

source: searchadviceproposedtocontroller
fr: Avis proposés au contrôleur financier

source: searchadviceproposedtoeditor
fr: Avis proposés au rédacteur financier

source: searchadviceproposedtomanager
fr: Avis proposés au Directeur financier

source: searchadviceproposedtoreviewer
fr: Avis proposés au validateur financier

source: searchitemstocontrolcompletenessof
fr: Complétude à contrôler

source: searchitemswithfinanceadvice
fr: Synthèse Avis DF

# searchproposeditems
source: Proposed items
fr: Points proposés

# searchvalidateditems
source: Validated items
fr: Points validés

source: wa_meetingadvicefinances_add_advicecreated_state
fr: Ajoute l'état "En création" pour les avis lors de l'utilisation du workflow "meetingadvicefinances_workflow"

source: wa_meetingadvicefinances_controller_propose_to_manager
fr: Ajoute la transition "Proposer au Directeur financier" depuis l'état "Proposé au contrôleur financier" pour les avis lors de l'utilisation du workflow "meetingadvicefinances_workflow"
