Repository: pypi-data/pypi-mirror-99
Catalog: packages/*-react/*-react-3.0.0b0.tar.gz/*-react-3.0.0b0/*_react/locale/*/LC_MESSAGES/django.po
Languages: ru

source: User with this e-mail address already exists.
ru: Уже существует пользователь с этим адресом э-почты

source: Your account has been disabled.
ru: Ваш аккаунт отключен.

source: Unable to login with provided credentials.
ru: Не удается войти в систему с полученными данными.

source: Please enter both email and password.
ru: Введите электронный адрес и пароль.

source: Phone number needs to include valid country code (E.g +37255555555).
ru: Телефонный номер должен содержать действующий код государства (например: +372 55 555 555)

source: The phone number entered is not valid.
ru: Введенный телефонный номер недействителен.

source: We do not have user with given e-mail address in our system.
ru: В нашей системе нет пользователя с этим адресом э-почты.

source: Password mismatch.
ru: Пароли не совпадают.

source: Broken data.
ru: Поврежденные данные.

source: User not found.
ru: Пользователь не найден.

source: This password recovery link has expired or associated user does not exist.
ru: Ссылка для восстановления пароля истекла или данный пользователь не существует.

source: Use password recovery form to get new e-mail with new link.
ru: Воспользуйтесь формой восстановления пароля, чтобы получить электронное письмо с новой ссылкой.

source: Password restore
ru: Восстановление пароля
