Repository: pypi-data/pypi-mirror-99
Catalog: packages/valer.health/valer.health-1.2.4rc18.zip/valer.health-1.2.4rc18/bika/health/locales/*/LC_MESSAGES/senaite.health.po
Languages: cs

source: (estimated)
cs: (odhad)

source: A list of aetiologic agent subtypes.
cs: Seznam podtypů etiologických příčin.

source: A list of immunizations administered to the patient.
cs: Seznam imunizací podaných pacientovi.

source: A list of patient treatments and drugs administered.
cs: Seznam léčby a léků podávaných pacientovi.

source: A list of places visited by the patient.
cs: Seznam míst navštívených pacientem.

source: Activate
cs: aktivovat

source: Active
cs: Aktivní

source: Active immunization
cs: Aktivní imunizace

source: Active treatment
cs: Aktivní léčba

source: Add
cs: Přidat

source: Additional IDs
cs: Další ID

source: Additional Symptoms not covered by ICD codes, can be entered here.
cs: Zde lze zadat další příznaky, na které se kódy ICD nevztahují.

source: Additional identifiers
cs: Další identifikátory

source: Additional notes
cs: Další poznámky

source: Address
cs: Adresa

source: Aetiologic Agents
cs: Etiologické příčiny

source: Aetiologic agent
cs: Etiologická příčina

source: Age
cs: Věk

source: All
cs: Vše

source: Allow results distribution to Patients
cs: Povolit distribuci výsledků pacientům

source: Allow results distribution to this patient
cs: Povolit distribuci výsledků tomuto pacientovi

source: Analysis Profiles
cs: Profily analýzy

source: Analysis Report
cs: Zpráva o analýze

source: Analysis results relate only to the samples tested.
cs: Výsledky analýzy se týkají pouze testovaných vzorků.

source: Anonymous
cs: Anonymní

source: Applies to
cs: Platí pro

source: Appropriate doses and dosage
cs: Vhodné dávky a dávkování

source: Asian
cs: Asiat

source: Attachment for
cs: Příloha pro

source: Attachments for ${DYNAMIC_CONTENT}
cs: Přílohy pro ${DYNAMIC_CONTENT}

source: Attachments per Row
cs: Přílohy na řádek

source: Batch
cs: Dávka

source: Batch ID
cs: ID dávky

source: Batch Labels
cs: Dávkové štítky

source: Batches
cs: Dávky

source: Birth date
cs: Datum narození

source: Birth date is estimated
cs: Datum narození se odhaduje

source: Birth place
cs: Místo narození

source: BirthDate
cs: Datum narození

source: Black
cs: Černá

source: Both
cs: Obojí

source: Business Phone
cs: pracovní telefon

source: Case
cs: Případ

source: Case ID
cs: ID případu

source: Case Outcomes
cs: Výsledky případu

source: Case Statuses
cs: Stavy případů

source: Case Syndromic Classifications
cs: Klasifikace Syndromových případů

source: Case outcome
cs: Výsledek případu

source: Case status
cs: Stav případu

source: Cases
cs: Případy

source: Category
cs: Kategorie

source: Causal treatment
cs: Kauzální léčba

source: Changes saved.
cs: Změny uloženy.

source: Check if patient can experience different stress levels (none, mild, moderate, severe) of the symptom
cs: Zjistěte, zda se u pacienta mohou projevit různé úrovně stresu (žádný, mírný, střední, závažný) symptomu

source: Citizenship
cs: Státní občanství

source: Civil status
cs: Rodinný stav

source: Client
cs: Klient

source: Client Case ID
cs: ID případu klienta

source: Client ID
cs: ID klienta

source: Client Order Number
cs: Číslo objednávky klienta

source: Client PID
cs: PID klienta

source: Client Patient ID
cs: ID klienta pacienta

source: Client Patient ID must be unique
cs: ID pacienta klienta musí být jedinečné

source: Client Reference
cs: Reference klienta

source: Client Sample ID
cs: ID vzorku klienta

source: Clients
cs: Klienti

source: Code
cs: Kód

source: Collectives at risk
cs: Rizikové kolektivy

source: Company Name
cs: Název společnosti

source: Consent to SMS
cs: Souhlas na SMS

source: Conservative treatment
cs: Konzervativní léčba

source: Country
cs: Země

source: Country and state
cs: Země a stát

source: Custom Report Options
cs: Možnosti vlastních sestav Zpráv

source: Date
cs: Datum

source: Date Collected
cs: Datum shromáždění

source: Date Published
cs: Datum Publikování

source: Date Received
cs: Datum přijetí

source: Date Verified
cs: Datum ověřeno

source: Date of Birth
cs: Datum narození

source: Day 1
cs: Den 1

source: Day 2
cs: Den 2

source: Day 3
cs: Den 3

source: Days
cs: Dnů

source: Deactivate
cs: Deaktivovat

source: Default
cs: Výchozí

source: Default publication preference for Patients
cs: Výchozí předvolby publikace pro pacienty

source: Description
cs: Popis

source: Discount
cs: Sleva

source: Disease
cs: Nemoc

source: Diseases
cs: Nemoci

source: District
cs: Okres

source: Doctor
cs: Lékař

source: Doctor ID
cs: ID Lékař

source: Doctor field is mandatory in cases
cs: Pole Lékař je povinné v případech

source: Doctors
cs: Lékaři

source: Document ID
cs: ID dokumentu

source: Document Location
cs: Umístění dokumentu

source: Document Type
cs: Typ dokumentu

source: Document Version
cs: Verze dokumentu

source: Don't Know
cs: Nevíme

source: Dormant
cs: Latentní

source: Drug
cs: Léčivo

source: Drug Prohibition
cs: Zákaz léků

source: Drug Prohibition Explanation
cs: Vysvětlení zákazu léčiv

source: Drug Prohibition Explanations
cs: Vysvětlení zákazu léčiv

source: Drug Prohibitions
cs: Zakázané léky

source: Drug indications
cs: Indikace léků

source: Drug posology
cs: Dávkování léků

source: Drug preservation
cs: Uchování léčiv

source: Drug side effects
cs: Vedlejší účinky léku

source: Drugs
cs: Léky

source: EPI Number
cs: EPI číslo

source: Email Address
cs: E-mailová adresa

source: Empirical treatment
cs: Empirická léčba

source: End
cs: Konec

source: Ethnicities
cs: Etnicita

source: Ethnicity
cs: Etnicita

source: Ethnicity Name
cs: Název etnicity

source: Ethnicity eg. Asian, African, etc.
cs: Ethnicita např. Asiat, Afričan atd.

source: Expectant/Symptomatic treatment
cs: Nastávající / symptomatická léčba

source: Failed ajax call: %s
cs: Neúspěšné volání Ajaxu: %s

source: Fathers name
cs: Jméno otce

source: Feature
cs: Vlastnost

source: Feet/inches
cs: Stop / palců

source: Female
cs: Žena

source: File
cs: Soubor

source: File attachments to results, e.g. microscope photos, will be included in emails to patient if this option is enabled
cs: Přiložte přílohy k výsledkům, např. fotografie z mikroskopu budou zahrnuty do e-mailů pro pacienta, pokud je tato možnost povolena

source: File attachments to results, e.g. microscope photos, will be included in emails to patients if this option is enabled. This setting can be overriden either on 'Patient publication preferences' tab from Client view or on Patient's 'Publication preferences' tab.
cs: Přiložte soubory k výsledkům, např. fotografie z mikroskopu budou zahrnuty do e-mailů pro pacienty, pokud je tato možnost povolena. Toto nastavení lze přepsat buď na kartě „Předvolby publikace pacienta“ z pohledu klienta, nebo na kartě „Předvolby publikace“ pacienta.

source: File attachments to results, e.g. microscope photos, will be included in emails to patients if this option is enabled. This setting can be overriden on Patient's 'Publication preferences' tab.
cs: Přiložte přílohy k výsledkům, např. fotografie z mikroskopu budou zahrnuty do e-mailů pro pacienty, pokud je tato možnost povolena. Toto nastavení lze přepsat na kartě Pacientovy předvolby publikování.

source: Filename:
cs: Název souboru:

source: First day of last menses
cs: První den poslední menstruace

source: Full Name
cs: Celé jméno

source: Fullname
cs: Celé jméno

source: Gender
cs: Pohlaví

source: Geographical areas can be characterized as having high, intermediate or low levels of infection.
cs: Geografické oblasti lze charakterizovat jako oblasti s vysokou, střední nebo nízkou úrovní infekce.

source: Geographical distribution
cs: Zeměpisné rozdělení

source: Guarantor ID
cs: ID ručitele

source: Guarantor's First Name
cs: Jméno ručitele

source: Guarantor's Phone (business)
cs: Telefon ručitele (pracovní)

source: Guarantor's Phone (home)
cs: Telefon ručitele (domů)

source: Guarantor's Phone (mobile)
cs: Telefon ručitele (mobilní)

source: Guarantor's Surname
cs: Příjmení ručitele

source: Guarantor's postal address
cs: Poštovní adresa ručitele

source: Health Care extension for SENAITE
cs: Rozšíření o zdravotní péči pro SENAITE

source: Height
cs: Výška

source: Hispanic or Latino
cs: Hispánský nebo latino

source: Historic Results
cs: Historické výsledky

source: Hours fasting
cs: Hodiny půstu

source: Hysterectomy
cs: Hysterektomie

source: ICD Code
cs: ICD kód

source: Identifier
cs: Identifikátor

source: Identifier Type
cs: Typ identifikátoru

source: Identifier Types
cs: Typy identifikátorů

source: If checked, results reports will also be sent to the Patient automatically.
cs: Pokud je zaškrtnuto, pacientovi budou automaticky zaslány také zprávy o výsledcích.

source: If checked, results reports will also be sent to the Patient automatically. This setting can be overriden either on 'Patient publication preferences' tab from Client view or on Patient's 'Publication preferences' tab.
cs: Pokud je zaškrtnuto, pacientovi budou automaticky zaslány také zprávy o výsledcích. Toto nastavení lze přepsat buď na kartě „Předvolby publikace pacienta“ z pohledu klienta, nebo na kartě „Předvolby publikace“ pacienta.

source: If checked, results reports will also be sent to the Patient automatically. This setting can be overriden either on Patient's 'Publication preferences' tab.
cs: Pokud je zaškrtnuto, pacientovi budou automaticky zaslány také zprávy o výsledcích. Toto nastavení lze přepsat na kartě „Publikační preference“ pacienta.

source: If checked, settings will be inherited from the Client, so further changes in Client for this setting will be populated too.
cs: Pokud je zaškrtnuto, nastavení budou zděděna od klienta, takže budou vyplněny i další změny v tomto nastavení pro klienta.

source: If checked, the settings for results reports distribution to patients will be inherited from Bika Setup, so further changes in Bika Setup for this setting will be populated too.
cs: Pokud je zaškrtnuto, nastavení pro distribuci hlášení o výsledcích pacientům bude zděděno z Bika Setup, takže budou vyplněny i další změny v Bika Setup pro toto nastavení.

source: If it is checked the invoices will be send to the insurance company. In this case the insurance number will be mandatory.
cs: Pokud je zaškrtnuto, faktury budou zaslány pojišťovně. V tomto případě bude číslo pojištění povinné.

source: If selected, Client Patient IDs will be forced to be unique
cs: Pokud je tato možnost vybrána, budou klientská ID pacienta nucena být jedinečná

source: Immunization
cs: Imunizace

source: Immunization form
cs: Imunizační formulář

source: Immunizations
cs: Imunizace

source: Inactive
cs: Neaktivní

source: Inches
cs: Palce

source: Incorrect data format in '${title}', should be YYYY-MM-DD
cs: Nesprávný formát datumu v '${title}' by měl být RRRR-MM-DD

source: Inherit default settings
cs: Zdědit výchozí nastavení

source: Inherit default settings for Patient results distribution
cs: Zdědit výchozí nastavení pro distribuci výsledků pacienta

source: Insurance Companies
cs: Pojišťovny

source: Insurance Company
cs: Pojišťovna

source: Insurance Number
cs: Číslo pojištěnce

source: Invoice
cs: faktura

source: Invoice Date
cs: Datum faktury

source: Invoice ID
cs: ID faktury

source: Invoice Number
cs: Číslo faktury

source: Invoice To
cs: Faktura komu

source: Invoices
cs: Faktury

source: Irregular
cs: Nepravidelný

source: Known Patient allergies to keep information that can aid drug reaction interpretation
cs: Známé informace k uchování o alergiích pacienta, které mohou pomoci interpretaci reakce na léčivo

source: Known undesirable effects of the drug
cs: Známé nežádoucí účinky léku

source: Location
cs: Místo

source: Male
cs: Muž

source: Menstrual cycle type
cs: Typ menstruačního cyklu

source: Methods included in the ${accreditation_body} schedule of Accreditation for this Laboratory. Analysis remarks are not accredited
cs: Metody zahrnuté v harmonogramu akreditace pro tuto laboratoř ${accreditation_body}. Poznámky k analýze nejsou akreditovány

source: Mild
cs: Mírný

source: Mobile Phone
cs: Mobilní telefon

source: MobilePhone
cs: Mobilní telefon

source: Moderate
cs: Mírný

source: Month
cs: Měsíc

source: Months
cs: Měsíce

source: Mothers name
cs: Jméno matky

source: Name
cs: Jméno

source: Native American
cs: Původní američan

source: Native Hawaiian or Other Pacific Islander
cs: Rodilý havajský nebo jiný pacifický ostrovan

source: No historic results found
cs: Nebyly nalezeny žádné historické výsledky

source: No menstrual cycle
cs: Žádný menstruační cyklus

source: No request id defined
cs: Není definováno žádné ID požadavku

source: Not invoiced
cs: Nevyfakturováno

source: Num
cs: Počet

source: Number of attachments rendered within one row per Sample
cs: Počet příloh vykreslených v jednom řádku na vzorek

source: Objective clinical findings
cs: Objektivní klinické nálezy

source: One
cs: Jeden

source: Onset
cs: Počátek

source: Onset Date
cs: Datum nástupu

source: Onset Date Estimated
cs: Odhadované datum nástupu

source: Ovaries removed
cs: Ovarie odstraněny

source: Palliative treatment
cs: Paliativní léčba

source: Parameter '%s' is missing
cs: Parametr '%s' chybí

source: Passive immunization
cs: Pasivní imunizace

source: Patient
cs: Pacient

source: Patient Age at Case Onset Date
cs: Věk pacienta v den začátku případu

source: Patient Files
cs: Soubory pacienta

source: Patient ID
cs: ID pacienta

source: Patient Identifiers
cs: Identifikátory pacientů

source: Patient Information
cs: Informace pacienta

source: Patient additional identifiers
cs: Další identifikátory pacienta

source: Patient condition height units
cs: Jednotky výšky stavu pacienta

source: Patient condition waist units
cs: Jednotky obvodu pasu stavu pacienta

source: Patient condition weight units
cs: Hmotnostní jednotky stavu pacienta

source: Patient's past medical history.
cs: Historie pacienta v minulosti.

source: Patients
cs: Pacienti

source: Phone
cs: Telefon

source: Phone (home)
cs: Telefon (domů)

source: Phone (mobile)
cs: Telefon (mobilní)

source: Photo
cs: Fotografie

source: Please correct the indicated errors.
cs: Opravte uvedené chyby.

source: Position
cs: Pozice

source: Pregnant
cs: Těhotná

source: Prevention
cs: Prevence

source: Preventive/Prophylactic treatment
cs: Preventivní / Profylaktická léčba

source: Price
cs: Cena

source: Primary Referrer
cs: Primární referrer

source: Print date:
cs: Datum tisku:

source: Province
cs: Kraj

source: Provisional diagnosis
cs: Prozatímní diagnostika

source: Provisional report
cs: Prozatímní zpráva

source: Published by
cs: Publikováno od

source: QC Results
cs: QC výsledky

source: Range
cs: Rozsah

source: Rational treatment
cs: Racionální léčba

source: Regular
cs: Pravidelný

source: Relevant Facts
cs: Relevantní fakta

source: Remarks
cs: Poznámky

source: Responsibles
cs: Odpovědnosti

source: Result
cs: Výsledek

source: Result out of client specified range.
cs: Výsledek mimo rozsah zadaný klientem.

source: Results
cs: Výsledky

source: Results attachments permitted
cs: Přílohy výsledků jsou povoleny

source: Results interpretation
cs: Interpretace výsledků

source: Sample ID
cs: ID vzorku

source: Sample Information
cs: Informace vzorku

source: Sample Point
cs: Bod vzorku

source: Sample Type
cs: Typ vzorku

source: Save and create Clinical Case
cs: Uložit a vytvořit klinický případ

source: Save and create Sample
cs: Uložit a vytvořit vzorek

source: Select a type of immunization. <br/>Active immunization entails the introduction of a foreign molecule into the body, which causes the body itself to generate immunity against the target. Vaccination is an active form of immunization<br/>Passive immunization is where pre-synthesized elements of the immune system are transferred to a person so that the body does not need to produce these elements itself. Currently, antibodies can be used for passive immunization
cs: Vyberte typ imunizace. <br/>Aktivní imunizace znamená zavedení cizí molekuly do těla, což způsobí, že samotné tělo vytvoří imunitu proti cíli. Očkování je aktivní forma imunizace<br/>Pasivní imunizace je místo, kde jsou předem syntetizované prvky imunitního systému přeneseny na osobu, takže tělo tyto prvky nemusí produkovat samo. V současné době mohou být protilátky použity k pasivní imunizaci

source: Select a type of treatment.
cs: Vyberte typ léčby.

source: Select the preferred channels to be used for sending the results reports to Patients. This setting can be overriden either on 'Patient publication preferences' tab from Client view or on Patient's 'Publication preferences' tab.
cs: Vyberte preferované kanály, které se mají použít pro zasílání zpráv o výsledcích pacientům. Toto nastavení lze přepsat buď na kartě „Předvolby publikace pacienta“ z pohledu klienta, nebo na kartě „Předvolby publikace“ pacienta.

source: Select the preferred channels to be used for sending the results reports to Patients. This setting can be overriden on Patient's 'Publication preferences' tab.
cs: Vyberte preferované kanály, které se mají použít pro zasílání zpráv o výsledcích pacientům. Toto nastavení lze přepsat na kartě Pacientovy předvolby publikování.

source: Send invoices to the insurance company.
cs: Zaslat faktury pojišťovně.

source: Service '%s' not found for %s
cs: Služba '%s' pro %s nebyla nalezena

source: Service not defined
cs: Služba není definována

source: Severe
cs: Těžký

source: Severity levels permitted
cs: Přípustné úrovně závažnosti

source: Shock treatment
cs: Léčba šokem

source: Should the Doctor field be mandatory while creating a case?
cs: Mělo by být pole Lékař při vytváření případu povinné?

source: Specific treatment
cs: Specifická léčba

source: Start
cs: Počátek

source: Subjective clinical findings
cs: Subjektivní klinické nálezy

source: Subtotal
cs: Mezisoučet

source: Subtype
cs: Podtyp

source: Supervisor
cs: Kontrolor

source: Supporting treatment
cs: Podpůrná léčba

source: Symptoms
cs: Symptomy

source: Symptoms and Conditions
cs: Symptomy a podmínky

source: Symptoms or the like for which the drug is suitable
cs: Příznaky nebo podobně, pro které je léčivo vhodné

source: Syndromes
cs: Syndromy

source: Taxes
cs: Daně

source: Test results are at a ${lab_confidence}% confidence level
cs: Výsledky testů jsou na úrovni spolehlivosti ${lab_confidence}%

source: The ID number (Insurance Number) from the person whose contract cover the current patient.
cs: Identifikační číslo (Pojistné číslo) od osoby, jejíž smlouva se týká současného pacienta.

source: The patient and the guarantor are the same.
cs: Pacient a ručitel jsou stejní.

source: The patient is the guarantor.
cs: Ručitelem je pacient

source: This Sample has been invalidated due to erroneously published results
cs: Tento vzorek byl zneplatněn kvůli chybně zveřejněným výsledkům

source: This Sample has been replaced by
cs: Tento vzorek byl nahrazen

source: This document shall not be reproduced except in full, without the written approval of ${name_lab}
cs: Tento dokument nesmí být reprodukován pouze v plném rozsahu bez písemného souhlasu ${name_lab}

source: Title
cs: Název

source: Total
cs: Celkem

source: Transmission
cs: Přenos

source: Treatment
cs: Léčba

source: Treatment Document
cs: Dokument léčby

source: Treatment care
cs: Léčebná péče

source: Treatment procedure
cs: Léčebná procedura

source: Treatment type
cs: Typ léčby

source: Treatments
cs: Léčby

source: Trip End Date
cs: Datum ukončení cesty

source: Trip Start Date
cs: Datum zahájení cesty

source: Unit
cs: Jednotka

source: Use '/' symbol to allow multiple-units submission
cs: Použijte symbol '/' pro povolení odesílání více jednotek

source: User Name
cs: Uživatelské jméno

source: VAT
cs: DPH

source: Vaccination Center
cs: Vakcinační centrum

source: Vaccination Centers
cs: Vakcinační centra

source: Validation failed: '${value}' is not unique
cs: Ověření se nezdařilo: '${value}' není unikátní

source: Verified By
cs: Ověřeno

source: Waist
cs: Pas

source: Weight
cs: Váha

source: White
cs: Bílá

source: Year
cs: Rok

source: Years
cs: Roků

source: days
cs: dnů

source: months
cs: měsíce

source: preservation
cs: uchování

source: save
cs: uložit

source: years
cs: roků
