class Zsxm:
    """
    征收项目类常量声明
    命名方式：统一以大写字母+下划线组成。征收项目缩写在前+其他字段
    调用方式：类名.字段名。Zsxm.ZZS
    """
    
    # 增值税
    ZZS = '10101'
    # 企业所得税
    QYSDS = '10104'
    # 个人所得税
    GRSDS = '10106'
    # 印花税
    YHS = '10111'
    # 附加税
    FJS = '10109,30216,30203'
    # 城市建设维护税
    CSJSWHS = '10109'
    # 教育附加
    JYFJ = '30203'
    # 地方教育附加
    DFJYFJ = '30216'
    # 文化事业建设费
    WHSYJSF = '30217'
    # 财务报表
    CWBB = '50100'
    # 房产税
    FCS = '10110'
    # 城镇土地使用税
    CZTDSYS = '10112'
    # 残保金
    CJRJYBZJ = '30218'
