Repository: pypi-data/pypi-mirror-99
Catalog: packages/django-datawatch/django-datawatch-2.3.2.tar.gz/django-datawatch-2.3.2/django_datawatch/locale/*/LC_MESSAGES/django.po
Languages: de

source: All
de: Alle

source: Failed
de: Fehler

source: User
de: Benutzer

source: Check
de: Prüfung

source: Days to acknowledge
de: Ausblenden für Anzahl Tage

source: Unknown
de: Unbekannt

source: Warning
de: Warnung

source: Critical
de: Kritisch

source: Module slug
de: Modul-Bezeichner

source: Identifier
de: Identifizierer

source: Configuration
de: Konfiguration

source: Payload description
de: Beschreibung des Gegenstandes

source: Acknowledged by
de: Ausgeblendet von

source: Acknowledged at
de: Ausgeblendet am

source: Acknowledged until
de: Ausgeblendet bis

source: Acknowledge reason
de: Ausblendungsgrund

source: Check module slug
de: Modul-Bezeichner

source: Last run
de: Letzte Ausführung

source: Home
de: Start

source: Success
de: Erfolg

source: Error
de: Fehler

source: There is nothing to see here. Everything is fine!
de: Hier gibt es nichts zu sehen. Alles ist gut!

source: Acknowledged until %(date)s
de: Ausgeblendet bis %(date)s

source: Acknowledge
de: Ausblenden

source: Change config
de: Konfiguration ändern

source: Refresh
de: Aktualisieren

source: Related model
de: Zugehöriges Model

source: Not assigned
de: Nicht zugewiesen

source: Config form class
de: Formular-Klasse für Konfiguration

source: Run every
de: Periodisches Ausführen

source: Not set
de: Nicht gesetzt

source: Update trigger models
de: Aktualisieren mit Änderungen an

source: Acknowledge maximum
de: Maximale Ausblendezeit

source: %(days)s day(s)
de: %(days)s Tag(e)

source: Assigned group
de: Zugewiesene Gruppe

source: Assigned user
de: Zugewiesener Benutzer

source: Acknowledged until %(date)s by %(user)s
de: Ausgeblendet bis %(date)s durch %(user)s

source: Reason:
de: Grund:

source: Cancel
de: Abbrechen

source: Check result does not exist (anymore)
de: Prüfungsergebnis existiert nicht (mehr)

source: Successfully acknowledged
de: Erfolgreich bestätigt

source: This check is already acknowledged for a longer period
de: Dieses Prüfungsergebnis wurde bereits für einen längeren Zeitraum ausgeblendet

source: Save
de: Speichern

source: Result has been refreshed
de: Ergebnis wurde aktualisiert
