Repository: pypi-data/pypi-mirror-99
Catalog: packages/m9s-elastic-search/m9s_elastic_search-5.2.3.tar.gz/m9s_elastic_search-5.2.3/locale/*.po
Languages: de

# field:elasticsearch.configuration,create_date:
source: Create Date
de: Erstellungsdatum

# field:elasticsearch.configuration,create_uid:
source: Create User
de: Erstellt durch

# field:elasticsearch.configuration,rec_name:
source: Record Name
de: Name

# field:elasticsearch.configuration,servers:
source: Server(s)
de: Server

# field:elasticsearch.configuration,settings:
source: Settings
de: Einstellungen

# field:elasticsearch.configuration,settings_updated:
source: Setting updated
de: Einstellung aktualisiert

# field:elasticsearch.configuration,write_date:
source: Write Date
de: Zuletzt geändert

# field:elasticsearch.configuration,write_uid:
source: Write User
de: Letzte Änderung durch

# field:elasticsearch.document.type,create_date:
source: Create Date
de: Erstellungsdatum

# field:elasticsearch.document.type,create_uid:
source: Create User
de: Erstellt durch

# field:elasticsearch.document.type,model:
source: Model
de: Modell

# field:elasticsearch.document.type,rec_name:
source: Record Name
de: Name

# field:elasticsearch.document.type,write_date:
source: Write Date
de: Zuletzt geändert

# field:elasticsearch.document.type,write_uid:
source: Write User
de: Letzte Änderung durch

# field:elasticsearch.index_backlog,create_date:
source: Create Date
de: Erstellungsdatum

# field:elasticsearch.index_backlog,create_uid:
source: Create User
de: Erstellt durch

# field:elasticsearch.index_backlog,rec_name:
source: Record Name
de: Name

# field:elasticsearch.index_backlog,record_id:
source: Record ID
de: Datensatz ID

# field:elasticsearch.index_backlog,record_model:
source: Record Model
de: Datensatzmodell

# field:elasticsearch.index_backlog,write_date:
source: Write Date
de: Zuletzt geändert

# field:elasticsearch.index_backlog,write_uid:
source: Write User
de: Letzte Änderung durch

# model:elasticsearch.configuration,name:
source: ElasticSearch Configuration
de: Einstellungen Elasticsearch

# model:elasticsearch.document.type,name:
source: Elastic Search Document Type Definition
de: Elasticsearch Dokumententypdefinition

# model:elasticsearch.index_backlog,name:
source: Index Backlog
de: Index Rückstand

# model:ir.action,name:act_document_type_form
source: Document Types
de: Dokumententypen

# model:ir.action,name:act_es_configuration_form
source: Configuration
de: Einstellungen

# model:ir.action,name:act_index_backlog_form
source: Index Backlog
de: Index Rückstand

# model:ir.message,text:invalid_json
source: The JSON data are invalid.
de: Die JSON Daten sind ungültig.

# model:ir.message,text:model_without_mapping
source: Model %s has no mapping specified.
de: Für Modell %s ist kein Mapping angegeben.

# model:ir.message,text:wrong_mapping
source: Mapping does not seem to be valid JSON.
de: Das Mapping scheint kein gültiges JSON-Format zu sein.

# model:ir.model.button,string:elastic_search_get_default_mapping_button
source: Get default mapping
de: Standardmapping

# model:ir.model.button,string:elastic_search_refresh_index_button
source: Update settings
de: Einstellungen aktualisieren

# model:ir.model.button,string:elastic_search_reindex_all_button
source: Reindex all records
de: Alle Datensätze neu indizieren

# model:ir.model.button,string:elastic_search_update_mapping_button
source: Update mapping
de: Mapping aktualisieren

# model:ir.model.button,string:elastic_search_update_settings_button
source: Update settings
de: Einstellungen aktualisieren

# model:ir.ui.menu,name:menu_configuration
source: Configuration
de: Einstellungen

# model:ir.ui.menu,name:menu_document_type_form
source: Document Types
de: Dokumententypen

# model:ir.ui.menu,name:menu_es_configuration
source: Configuration
de: Einstellungen

# model:ir.ui.menu,name:menu_index_backlog_form
source: Index Backlog
de: Index Rückstand

# model:res.group,name:group_elasticsearch_admin
source: Elastic Search Administrator
de: Elasticsearch Administration

# model:res.user,name:
source: Cron Elastic Search Index
de: Zeitplaner Elasticsearch Index

# selection:ir.cron,method:
source: Elastic Search Index
de: Elastic Search Index aktualisieren

# view:elasticsearch.configuration:
source: Refresh Index
de: Index auffrischen

# view:elasticsearch.configuration:
source: Settings
de: Einstellungen

# view:elasticsearch.configuration:
source: Update Settings
de: Einstellungen aktualisieren

# view:elasticsearch.document.type:
source: Get default mapping from Model
de: Standardmapping vom Modell holen

# view:elasticsearch.document.type:
source: Reindex All Records
de: Alle Datensätze neu indizieren

# view:elasticsearch.document.type:
source: Update Mapping
de: Mapping aktualisieren

# view:elasticsearch.document.type:
source: Update Mapping on ES
de: Mapping auf dem ES Server aktualisieren

# view:elasticsearch.index_backlog:
source: Index Backlog
de: Index Rückstand
