Repository: pypi-data/pypi-mirror-99
Catalog: packages/m9s-shipping/m9s_shipping-5.2.6.tar.gz/m9s_shipping-5.2.6/locale/*.po
Languages: de

# field:carrier,active:
source: Active?
de: Aktiv

# field:carrier,box_types:
source: Box Types
de: Behältnistypen

# field:carrier,currency:
source: Currency
de: Währung

# field:carrier,services:
source: Services
de: Dienste

# field:carrier.box_type,carrier_cost_method:
source: Carrier Cost Method
de: Frachtführer Kostenmethode

# field:carrier.box_type,create_date:
source: Create Date
de: Erstellungsdatum

# field:carrier.box_type,create_uid:
source: Create User
de: Erstellt durch

# field:carrier.box_type,distance_unit:
source: Distance Unit
de: Abmessungseinheit

# field:carrier.box_type,height:
source: Height
de: Höhe

# field:carrier.box_type,length:
source: Length
de: Länge

# field:carrier.box_type,rec_name:
source: Record Name
de: Name

# field:carrier.box_type,width:
source: Width
de: Breite

# field:carrier.box_type,write_date:
source: Write Date
de: Zuletzt geändert

# field:carrier.box_type,write_uid:
source: Write User
de: Letzte Änderung durch

# field:carrier.carrier-box-type,box_type:
source: Box Type
de: Behältnistyp

# field:carrier.carrier-box-type,carrier:
source: Carrier
de: Frachtführer

# field:carrier.carrier-box-type,create_date:
source: Create Date
de: Erstellungsdatum

# field:carrier.carrier-box-type,create_uid:
source: Create User
de: Erstellt durch

# field:carrier.carrier-box-type,rec_name:
source: Record Name
de: Name

# field:carrier.carrier-box-type,write_date:
source: Write Date
de: Zuletzt geändert

# field:carrier.carrier-box-type,write_uid:
source: Write User
de: Letzte Änderung durch

# field:carrier.carrier-service,carrier:
source: Carrier
de: Frachtführer

# field:carrier.carrier-service,create_date:
source: Create Date
de: Erstellungsdatum

# field:carrier.carrier-service,create_uid:
source: Create User
de: Erstellt durch

# field:carrier.carrier-service,rec_name:
source: Record Name
de: Name

# field:carrier.carrier-service,service:
source: Service
de: Dienstleistung

# field:carrier.carrier-service,write_date:
source: Write Date
de: Zuletzt geändert

# field:carrier.carrier-service,write_uid:
source: Write User
de: Letzte Änderung durch

# field:carrier.log,carrier:
source: Carrier
de: Frachtführer

# field:carrier.log,create_date:
source: Create Date
de: Erstellungsdatum

# field:carrier.log,create_uid:
source: Create User
de: Erstellt durch

# field:carrier.log,rec_name:
source: Record Name
de: Name

# field:carrier.log,sale:
source: Sale
de: Verkauf

# field:carrier.log,shipment_out:
source: Shipment Out
de: Kundenlieferposten

# field:carrier.log,write_date:
source: Write Date
de: Zuletzt geändert

# field:carrier.log,write_uid:
source: Write User
de: Letzte Änderung durch

# field:carrier.service,carrier_cost_method:
source: Carrier Cost Method
de: Frachtführer Kostenmethode

# field:carrier.service,create_date:
source: Create Date
de: Erstellungsdatum

# field:carrier.service,create_uid:
source: Create User
de: Erstellt durch

# field:carrier.service,rec_name:
source: Record Name
de: Name

# field:carrier.service,write_date:
source: Write Date
de: Zuletzt geändert

# field:carrier.service,write_uid:
source: Write User
de: Letzte Änderung durch

# field:party.address.validation.end,done_msg:
source: Message
de: Nachricht

# field:party.address.validation.start,city:
source: Suggested City
de: Vorgeschlagene Stadt

# field:party.address.validation.start,country:
source: Suggested Country
de: Vorgeschlagener Staat

# field:party.address.validation.start,current_city:
source: Current City
de: Aktuelle Stadt

# field:party.address.validation.start,current_country:
source: Current Country
de: Aktueller Staat

# field:party.address.validation.start,current_name:
source: Current Name
de: Aktueller Name

# field:party.address.validation.start,current_street:
source: Current Street
de: Aktuelle Straße

# field:party.address.validation.start,current_subdivision:
source: Current Subdivision
de: Aktuelle Subnationale Einheit

# field:party.address.validation.start,current_zip:
source: Current Zip
de: Aktuelle Postleitzahl

# field:party.address.validation.start,street:
source: Suggested Street
de: Vorgeschlagene Stadt

# field:party.address.validation.start,subdivision:
source: Suggested Subdivision
de: Vorgeschlagene Subnationale Einheit

# field:party.address.validation.start,zip:
source: Suggested Zip
de: Vorgeschlagene Postleitzahl

# field:party.configuration,default_validation_carrier:
source: Default Validation Carrier
de: Standardvalidierungsfrachtführer

# field:sale.channel,shipping_carriers:
source: Shipping Carriers
de: Frachtführer

# field:sale.channel.carrier,available_carrier_services:
source: Available Carrier Services
de: Verfügbare Dienste

# field:sale.channel.carrier,carrier:
source: Carrier
de: Versanddienstleister

# field:sale.channel.carrier,carrier_service:
source: Service
de: Leistung

# field:sale.channel.carrier,channel:
source: Channel
de: Vertriebskanal

# field:sale.channel.carrier,create_date:
source: Create Date
de: Erstellungsdatum

# field:sale.channel.carrier,create_uid:
source: Create User
de: Erstellt durch

# field:sale.channel.carrier,rec_name:
source: Record Name
de: Name

# field:sale.channel.carrier,write_date:
source: Write Date
de: Zuletzt geändert

# field:sale.channel.carrier,write_uid:
source: Write User
de: Letzte Änderung durch

# field:sale.line,summary:
source: Summary
de: Beschreibung

# field:sale.sale,available_carrier_services:
source: Available Carrier Services
de: Verfügbare Dienste

# field:sale.sale,carrier_cost_method:
source: Carrier Cost Method
de: Frachtführer Kostenmethode

# field:sale.sale,carrier_service:
source: Carrier Service
de: Versanddienstleistung

# field:sale.sale,is_international_shipping:
source: Is International Shipping
de: Internationaler Versand

# field:sale.sale,volume:
source: Volume
de: Volumen

# field:sale.sale,volume_digits:
source: Weight Digits
de: Nachkommastellen Gewicht

# field:sale.sale,volume_uom:
source: Volume UOM
de: Volumeneinheit

# field:sale.sale,weight:
source: Weight
de: Gewicht

# field:sale.sale,weight_digits:
source: Weight Digits
de: Nachkommastellen Gewicht

# field:sale.sale,weight_uom:
source: Weight UOM
de: Maßeinheit Gewicht

# field:sale.sale.apply_shipping.select_rate,rate:
source: Rate
de: Tarif

# field:sale.sale.apply_shipping.start,available_carrier_services:
source: Available Carrier Services
de: Verfügbare Dienste

# field:sale.sale.apply_shipping.start,carrier:
source: Carrier
de: Frachtführer

# field:sale.sale.apply_shipping.start,carrier_service:
source: Service
de: Dienstleistung

# field:sale.sale.apply_shipping.start,volume:
source: Volume
de: Volumen

# field:sale.sale.apply_shipping.start,weight:
source: Weight
de: Gewicht

# field:shipment.tracking,carrier:
source: Carrier
de: Frachtführer

# field:shipment.tracking,create_date:
source: Create Date
de: Erstellungsdatum

# field:shipment.tracking,create_uid:
source: Create User
de: Erstellt durch

# field:shipment.tracking,delivery_date:
source: Delivery Date
de: Lieferdatum

# field:shipment.tracking,delivery_time:
source: Delivery Time
de: Lieferzeitraum

# field:shipment.tracking,is_master:
source: Is Master ?
de: Hauptnummer

# field:shipment.tracking,origin:
source: Origin
de: Herkunft

# field:shipment.tracking,rec_name:
source: Record Name
de: Name

# field:shipment.tracking,state:
source: State
de: Status

# field:shipment.tracking,tracking_number:
source: Tracking Number
de: Sendungsnummer

# field:shipment.tracking,tracking_url:
source: Tracking Url
de: Sendungsverfolgungs-URL

# field:shipment.tracking,write_date:
source: Write Date
de: Zuletzt geändert

# field:shipment.tracking,write_uid:
source: Write User
de: Letzte Änderung durch

# field:shipping.label.end,attachments:
source: Attachments
de: Anhänge

# field:shipping.label.end,cost:
source: Cost
de: Kosten

# field:shipping.label.end,cost_currency:
source: Cost Currency
de: Währung Kosten

# field:shipping.label.end,message:
source: Message
de: Nachricht

# field:shipping.label.end,tracking_number:
source: Tracking number
de: Trackingnummer

# field:shipping.label.select_rate,rate:
source: Select Rate
de: Tarif

# field:shipping.label.start,available_box_types:
source: Available Box Types
de: Verfügbare Behältnistypen

# field:shipping.label.start,available_carrier_services:
source: Available Carrier Services
de: Verfügbare Dienste

# field:shipping.label.start,box_type:
source: Box Type
de: Behältnistyp

# field:shipping.label.start,carrier:
source: Carrier
de: Frachtführer

# field:shipping.label.start,carrier_service:
source: Carrier Service
de: Versanddienstleistung

# field:shipping.label.start,no_of_packages:
source: Number of packages
de: Anzahl Packstücke

# field:shipping.label.start,override_weight:
source: Override Weight
de: Korrekturgewicht

# field:shipping.label.start,shipping_instructions:
source: Shipping Instructions
de: Versandanweisungen

# field:shipping.manifest,carrier:
source: Carrier
de: Frachtführer

# field:shipping.manifest,carrier_cost_method:
source: Carrier Cost Method
de: Versandkostenmethode

# field:shipping.manifest,close_date:
source: Close Date
de: Abschlussdatum

# field:shipping.manifest,create_date:
source: Create Date
de: Erstellungsdatum

# field:shipping.manifest,create_uid:
source: Create User
de: Erstellt durch

# field:shipping.manifest,rec_name:
source: Record Name
de: Name

# field:shipping.manifest,shipments:
source: Shipments
de: Lieferposten

# field:shipping.manifest,state:
source: State
de: Status

# field:shipping.manifest,warehouse:
source: Warehouse
de: Warenlager

# field:shipping.manifest,write_date:
source: Write Date
de: Zuletzt geändert

# field:shipping.manifest,write_uid:
source: Write User
de: Letzte Änderung durch

# field:stock.location,return_address:
source: Return Address
de: Rücksendeadresse

# field:stock.package,available_box_types:
source: Available Box Types
de: Verfügbare Behältnistypen

# field:stock.package,box_type:
source: Box Type
de: Behältnistyp

# field:stock.package,computed_weight:
source: Computed Weight
de: Berechnetes Gewicht

# field:stock.package,distance_unit:
source: Distance Unit
de: Abmessungseinheit

# field:stock.package,height:
source: Height
de: Höhe

# field:stock.package,length:
source: Length
de: Länge

# field:stock.package,override_weight:
source: Override Weight
de: Korrekturgewicht

# field:stock.package,override_weight_uom:
source: Override Weight UOM
de: Korrekturgewichtseinheit

# field:stock.package,tracking_number:
source: Tracking Number
de: Trackingnummer

# field:stock.package,weight:
source: Weight
de: Gewicht

# field:stock.package,weight_digits:
source: Weight Digits
de: Nachkommastellen Gewicht

# field:stock.package,weight_uom:
source: Weight UOM
de: Maßeinheit Gewicht

# field:stock.package,width:
source: Width
de: Breite

# field:stock.shipment.out,available_carrier_services:
source: Available Carrier Services
de: Verfügbare Dienste

# field:stock.shipment.out,carrier_cost_method:
source: Carrier Cost Method
de: Frachtführer Kostenmethode

# field:stock.shipment.out,carrier_service:
source: Carrier Service
de: Versanddienstleistung

# field:stock.shipment.out,is_international_shipping:
source: Is International Shipping
de: Internationaler Versand

# field:stock.shipment.out,shipping_instructions:
source: Shipping Instructions
de: Versandanweisungen

# field:stock.shipment.out,shipping_manifest:
source: Shipping Manifest
de: Frachtliste

# field:stock.shipment.out,tracking_number:
source: Tracking Number
de: Trackingnummer

# field:stock.shipment.out,weight:
source: Weight
de: Gewicht

# field:stock.shipment.out,weight_digits:
source: Weight Digits
de: Nachkommastellen Gewicht

# field:stock.shipment.out,weight_uom:
source: Weight UOM
de: Maßeinheit Gewicht

# help:stock.location,return_address:
source: Return undelivered shipments to this address
de: Unzustellbare Sendungen an diese Adresse retournieren

# model:carrier.box_type,name:
source: Carrier Box Type
de: Behältnistyp

# model:carrier.carrier-box-type,name:
source: Carrier - Box Type
de: Frachtführer - Behältnistyp

# model:carrier.carrier-service,name:
source: Carrier - Service
de: Frachtführer - Dienstleistung

# model:carrier.log,name:
source: Carrier Log
de: Frachtführer Log

# model:carrier.service,name:
source: Carrier Service
de: Versanddienstleistung

# model:ir.action,name:
source: Configuration
de: Einstellungen

# model:ir.action,name:act_box_type_form
source: Shipping Box Type
de: Behältnistyp

# model:ir.action,name:act_carrier_service
source: Carrier Service
de: Versanddienstleistung

# model:ir.action,name:act_shipping_manifest_form
source: Manifest
de: Frachtliste

# model:ir.action,name:wizard_address_validation
source: Address Validation
de: Adressvalidierung

# model:ir.action,name:wizard_generate_shipping_label
source: Generate Shipment Label
de: Versandetikett erstellen

# model:ir.action,name:wizard_sale_apply_shipping
source: Apply Shipping
de: Versandkosten eintragen

# model:ir.action.act_window.domain,name:
source: Active
de: Aktiv

# model:ir.action.act_window.domain,name:act_carrier_form_active
source: Active
de: Aktiv

# model:ir.action.act_window.domain,name:act_carrier_form_inactive
source: Disabled
de: Deaktiviert

# model:ir.action.act_window.domain,name:act_manifest_form_close
source: Closed
de: Geschlossen

# model:ir.action.act_window.domain,name:act_manifest_form_open
source: Open
de: Öffnen

# model:ir.model.button,string:channel_import_carriers_button
source: Import carriers
de: Frachtführer importieren

# model:ir.model.button,string:party_validate_address_button
source: Validate Address
de: Adresse validieren

# model:ir.model.button,string:sale_apply_shipping_button
source: Apply Shipping
de: Versandkosten eintragen

# model:ir.model.button,string:shipment_cancel_tracking_number_button
source: Cancel tracking number
de: Trackingnummer widerrufen

# model:ir.model.button,string:shipment_label_wizard_button
source: Generate Shipping Label
de: Versandlabel erstellen

# model:ir.model.button,string:shipment_refresh_tracking_status_button
source: Refresh tracking status
de: Tracking Status aktualisieren

# model:ir.model.button,string:shipping_manifest_close_button
source: Close
de: Schließen

# model:ir.ui.menu,name:
source: Configuration
de: Einstellungen

# model:ir.ui.menu,name:carrier_service
source: Shipping Carrier Services
de: Versanddienstleistungen

# model:ir.ui.menu,name:menu_box_type_form
source: Shipping Box Type
de: Behältnistypen

# model:ir.ui.menu,name:shipping_manifest
source: Shipping Manifest
de: Frachtlisten

# model:party.address.validation.end,name:
source: End State for Address Validation
de: Endstatus Adressvalidierung

# model:party.address.validation.start,name:
source: Address Validation Wizard Suggestion View
de: Adressvalidierung Vorschlag

# model:sale.channel.carrier,name:
source: Shipping Carriers
de: Frachtführer

# model:sale.sale.apply_shipping.select_rate,name:
source: Select Rate
de: Tarif auswählen

# model:sale.sale.apply_shipping.start,name:
source: Apply Shipping
de: Versandkosten eintragen

# model:shipment.tracking,name:
source: Shipment Tracking
de: Sendungsverfolgung

# model:shipping.label.end,name:
source: Generate Labels Message
de: Nachricht für Etikett erstellen

# model:shipping.label.select_rate,name:
source: Select Shipping Rate
de: Tarif auswählen

# model:shipping.label.start,name:
source: View To Select Carrier
de: Frachtführer Auswahl

# model:shipping.manifest,name:
source: Manifest Model for shipping.
de: Frachtliste

# selection:ir.cron,method:
source: Refresh tracking numbers
de: Trackingnummern aktualisieren

# selection:sale.line,purchase_request_state:
source: Done
de: Erledigt

# selection:sale.line,purchase_request_state:
source: In Process
de: In Bearbeitung

# selection:shipment.tracking,state:
source: Cancelled
de: Annulliert

# selection:shipment.tracking,state:
source: Delivered
de: Ausgeliefert

# selection:shipment.tracking,state:
source: Exception
de: Vorbehalt

# selection:shipment.tracking,state:
source: Failure
de: Fehler

# selection:shipment.tracking,state:
source: In Transit
de: Unterwegs

# selection:shipment.tracking,state:
source: Out For Delivery
de: Versandbereit

# selection:shipment.tracking,state:
source: Pending Cancellation
de: Annullierung anhängig

# selection:shipment.tracking,state:
source: Returned
de: Retoure

# selection:shipment.tracking,state:
source: Unknown
de: Unbekannt

# selection:shipment.tracking,state:
source: Waiting
de: Wartend

# selection:shipping.manifest,state:
source: Closed
de: Geschlossen

# selection:shipping.manifest,state:
source: Open
de: Öffnen

# view:carrier.box_type:
source: Dimensions
de: Abmessungen

# view:carrier.service:
source: Carrier Service
de: Versanddienstleistung

# view:carrier.service:
source: Carrier Services
de: Versanddienstleistungen

# view:carrier:
source: Box Types
de: Behältnistypen

# view:carrier:
source: Services
de: Dienste

# view:party.address.validation.end:
source: Address Validation Complete
de: Adressvalidierung Vollständig

# view:party.address.validation.start:
source: Address Validation Form
de: Adressvalidierung Formular

# view:party.address:
source: Validate Address
de: Adresse validieren

# view:sale.channel:
source: Shipping Carriers
de: Frachtführer

# view:sale.sale.apply_shipping.select_rate:
source: Select Rate
de: Tarif auswählen

# view:sale.sale.apply_shipping.start:
source: Apply Shipping
de: Versandkosten eintragen

# view:sale.sale:
source: Apply Shipping
de: Versandkosten eintragen

# view:sale.sale:
source: Carrier Details
de: Frachtführer Details

# view:shipment.tracking:
source: Cancel
de: Annullieren

# view:shipment.tracking:
source: Cancel Tracking Number
de: Sendungsnummer annullieren

# view:shipment.tracking:
source: Refresh Status
de: Status aktualisieren

# view:shipping.label.end:
source: Shipment Label Generated
de: Versandetikett erstellt

# view:shipping.label.select_rate:
source: Select Rate
de: Tarif auswählen

# view:shipping.label.start:
source: If the number of packages is zero, a single new package will automatically be created for this shipment.
de: Wenn die Anzahl an Packstücken Null ist, wird automatisch ein einziges neues Packstück erstellt.

# view:shipping.label.start:
source: This weight will be equally distributed among all packages.
de: Dieses Gewicht wird gleichmäßig auf alle Packstücke verteilt.

# view:shipping.manifest:
source: Close
de: Schließen

# view:stock.package:
source: Dimensions
de: Abmessungen

# view:stock.package:
source: Weight Details
de: Details

# view:stock.shipment.out:
source: Carrier
de: Frachtführer

# view:stock.shipment.out:
source: Packages
de: Packstücke

# view:stock.shipment.out:
source: Shipping Instructions
de: Versandanweisungen

# wizard_button:party.address.validation,start,end:
source: Cancel
de: Abbrechen

# wizard_button:party.address.validation,start,update:
source: Save
de: Speichern

# wizard_button:sale.sale.apply_shipping,select_rate,apply_rate:
source: Apply
de: Anwenden

# wizard_button:sale.sale.apply_shipping,select_rate,end:
source: Cancel
de: Abbrechen

# wizard_button:sale.sale.apply_shipping,start,end:
source: Cancel
de: Abbrechen

# wizard_button:sale.sale.apply_shipping,start,get_rates:
source: Choose Rate
de: Tarif auswählen

# wizard_button:shipping.label,select_rate,end:
source: Cancel
de: Abbrechen

# wizard_button:shipping.label,select_rate,generate_labels:
source: Continue
de: Weiter

# wizard_button:shipping.label,start,end:
source: Cancel
de: Abbrechen

# wizard_button:shipping.label,start,next:
source: Continue
de: Weiter
