phrase_list_male = [", ты являешься прямым доказательством того, что человек может жить без мозгов.",
", а ты умнее, чем о тебе говорят!",
", проверьте подсоединение языка к мозгу.",
", тупость - ваш лучший друг!",
" такой умный. Интересно, ему череп не жмет?",
", отлично выглядишь! Бухал вчера?",
", тебе идёт мейк-ап а-ля дебил.",
", cделай фокус, растворись в воздухе.",
", ты тупой или да?",
]
phrase_list_female = [", ты являешься прямым доказательством того, что человек может жить без мозгов.",
", а ты умнее, чем о тебе говорят!",
", проверьте подсоединение языка к мозгу.",
", тупость - ваш лучший друг!",
" такая умная. Интересно, ей череп не жмет?",
", отлично выглядишь! Бухала вчера?",
", тебе идёт мейк-ап а-ля дебил.",
", cделай фокус, растворись в воздухе.",
", ты тупой или да?",
]

pozor_list = []
ban_list = []

hmtai_categories = ["wallpaper", "mobileWallpaper", "neko", "jahy", "manga", 
                    "hentai", "ahegao", "nsfwMobileWallpaper", "gif", "nsfwNeko", "gangbang", "uniform", "foot",
                    "pantsu", "tentacles", "thighs"]
hc_len = len(hmtai_categories) - 1
list_len = len(phrase_list_male) - 1