Repository: pypi-data/pypi-mirror-99
Catalog: packages/ajenti.plugin.check-certificates/ajenti.plugin.check_certificates-0.6.tar.gz/ajenti.plugin.check_certificates-0.6/ajenti_plugin_check_certificates/locale/*/LC_MESSAGES/app.po
Languages: ar, fr, it, pl, ru, sv_se

source: ({{h.restTime}} days)
ar: ({{h.restTime}} أيام)
fr: ({{h.restTime}} jours)
it: ({{h.restTime}} giorni)
pl: ({{h.restTime}} dni)
ru: ({{h.restTime}} дней)
sv_se: ({{h.restTime}} dagar)

source: <i class="fas fa-check"></i> All certificates are up to date !
ar: <i class="fas fa-check"></i> جميع الشهادات محدثة!
fr: <i class="fas fa-check"></i> Tous les certificats sont à jour !
it: <i class="fas fa-check"></i> Tutti i certificati sono aggiornati !
pl: <i class="fas fa-check"></i> Wszystkie certyfikaty są aktualne!
ru: <i class="fas fa-check"></i> Все сертификаты актуальны!
sv_se: <i class="fas fa-check"></i> Alla certifikat är uppdaterade!

source: Add host
ar: إضافة مضيف
fr: Ajouter un hôte
it: Aggiungi host
pl: Dodaj hosta
ru: Добавить хост
sv_se: Lägg till värd

source: Certificate end :
ar: نهاية الشهادة:
fr: Fin du certificat :
it: Fine certificato :
pl: Koniec certyfikatu:
ru: Окончание Сертификата:
sv_se: Certifikatets slut :

source: Certificate start :
ar: بداية الشهادة:
fr: Début du certificat :
it: Inizio certificato :
pl: Początek certyfikatu:
ru: Начало сертификата:
sv_se: Startar certifikat:

source: Certificates to be renewed
ar: الشهادات التي يتعين تجديدها
fr: Certificats à renouveler
it: Certificati da rinnovare
pl: Certyfikaty, które mają zostać odnowione
ru: Сертификаты должны быть обновлены
sv_se: Certifikat som ska förnyas

source: Certificates
ar: الشهادات
fr: Certificats
it: Certificati
pl: Certyfikaty
ru: Сертификаты
sv_se: Certifikat

source: Check certificates
ar: التحقق من الشهادات
fr: Vérifier les certificats
it: Controlla certificati
pl: Sprawdź certyfikaty
ru: Проверить сертификаты
sv_se: Kontrollera certifikat

source: New url
ar: رابط جديد
fr: Nouvelle url
it: Nuovo url
pl: Nowy adres url
ru: Новый url
sv_se: Ny URL

source: Remove the url
ar: إزالة الرابط
fr: Supprimer l'url
it: Rimuovi l'url
pl: Usuń adres url
ru: Удалить url
sv_se: Ta bort webbadressen

source: Remove
ar: إزالة
fr: Supprimer
it: Rimuovi
pl: Usuń
ru: Удалить
sv_se: Ta bort

source: Cancel
ar: إلغاء الأمر
fr: Annuler
it: Annulla
pl: Anuluj
ru: Отменить
sv_se: Avbryt
