Repository: pypi-data/pypi-mirror-99
Catalog: packages/valer.health/valer.health-1.2.4rc19-py2-none-any.whl/bika/health/locales/*/LC_MESSAGES/senaite.core.po
Languages: pl

source: A list of aetiologic agent subtypes.
pl: Lista podtypów czynników etiologicznych

source: A list of immunizations administered to the patient.
pl: Lista szczepień pacjenta

source: A list of patient treatments and drugs administered.
pl: Lista terapii i przepisanych pacjentowi leków

source: A list of places visited by the patient.
pl: Lista placówek, w których przebywał pacjent

source: Active
pl: Aktywne

source: Active treatment
pl: Leczenie czynne

source: Add
pl: Dodaj

source: Additional IDs
pl: Dodatkowe identyfikatory

source: Additional Symptoms not covered by ICD codes, can be entered here.
pl: Tu mogą być wpisane dodatkowe objawy, nie objęte klasyfikacją ICD,

source: Additional identifiers
pl: Identyfikatory dodatkowe

source: Additional notes
pl: Uwagi dodatkowe

source: Aetiologic Agents
pl: Czynniki Etiologiczne

source: Aetiologic agent
pl: Czynnik Etiologiczny

source: Age
pl: Wiek

source: Allow results distribution to Patients
pl: Zezwól na dystrybucję wyników wśród pacjentów

source: Allow results distribution to this patient
pl: Zezwól na dystrybucję wyników do tego pacjenta

source: Anonymous
pl: Anonimowy

source: Applies to
pl: Dotyczy

source: Appropriate doses and dosage
pl: Odpowiednie dawki i dawkowanie

source: Asian
pl: Azjatycki

source: Birth date
pl: Data urodzenia

source: Birth date is estimated
pl: Przybliżona data urodzenia

source: Birth place
pl: Miejsce urodzenia

source: BirthDate
pl: Data urodzenia

source: Black
pl: Czarnoskóry

source: Business Phone
pl: Telefon służbowy

source: Case
pl: Przypadek

source: Case ID
pl: ID Przypadku

source: Category
pl: Kategoria

source: Causal treatment
pl: Leczenie przyczynowe

source: Changes saved.
pl: Zmiany zachowane.

source: Check if patient can experience different stress levels (none, mild, moderate, severe) of the symptom
pl: Sprawdź, czy u pacjenta występują różne poziomy stresu (brak, łagodny, umiarkowany, silny) dla objawu

source: Citizenship
pl: Obywatelstwo

source: Civil status
pl: Stan cywilny

source: Client
pl: Klient

source: Client ID
pl: Identyfikator ID jednostki zlecającej badanie

source: Client PID
pl: Identyfikator PID jednostki zlecającej badanie

source: Client Patient ID
pl: Identyfikator ID Pacjenta jednostki zlecającej badanie

source: Client Patient ID must be unique
pl: Identyfikator ID Pacjenta Jednostki zlecającej badanie musi być wyjątkowy

source: Clients
pl: Jednostki zlecające badania

source: Code
pl: Kod

source: Collectives at risk
pl: Grupy ryzyka

source: Company Name
pl: Nazwa firmy

source: Consent to SMS
pl: Zgoda na SMS

source: Conservative treatment
pl: Leczenie zachowawcze

source: Country
pl: Kraj

source: Country and state
pl: Kraj i województwo

source: Date
pl: Data

source: Default publication preference for Patients
pl: Domyślne ustawienia publikacji dla Pacjentów

source: Description
pl: Opis

source: Disease
pl: Choroba

source: Diseases
pl: Choroby

source: District
pl: Powiat

source: Doctor
pl: Lekarz

source: Doctor ID
pl: Identyfikator ID lekarza

source: Doctor field is mandatory in cases
pl: Pole lekarza jest obowiązkowe w przypadkach

source: Doctors
pl: Lekarze

source: Don't Know
pl: Nie Znane

source: Drug
pl: Lek

source: Drug Prohibition
pl: Zakaz stosowania leku

source: Drug Prohibition Explanation
pl: Uzasadnienie zakazu stosowania leku

source: Drug Prohibition Explanations
pl: Uzasadnienia zakazu stosowania leku

source: Drug indications
pl: Wskazania do zastosowania leku

source: Drug posology
pl: Dawkowanie leku

source: Drug preservation
pl: Przechowywanie leku

source: Drug side effects
pl: Działania niepożądane leku

source: Drugs
pl: Leki

source: Email Address
pl: Adres E-mail

source: Empirical treatment
pl: Leczenie empiryczne

source: End
pl: Koniec

source: Ethnicities
pl: Pochodzenie etniczne

source: Ethnicity
pl: Pochodzenie etniczne

source: Ethnicity eg. Asian, African, etc.
pl: Pochodzenie etniczne np. Azjata, Afrykanin itp.

source: Fathers name
pl: Imię ojca

source: Fax
pl: Faks

source: Feature
pl: Cecha

source: Feet/inches
pl: Stopy/cale

source: Female
pl: Żeńska

source: File
pl: plik

source: File attachments to results, e.g. microscope photos, will be included in emails to patient if this option is enabled
pl: Pliki z załącznikami do wyników, np. zdjęcia mikroskopowe będą dołączane do wiadomości e-mail do pacjenta, jeśli ta opcja jest włączona

source: File attachments to results, e.g. microscope photos, will be included in emails to patients if this option is enabled. This setting can be overriden either on 'Patient publication preferences' tab from Client view or on Patient's 'Publication preferences' tab.
pl: Pliki z załącznikami do wyników, np. zdjęcia mikroskopowe będą dołączane do wiadomości e-mail do pacjentów, jeśli ta opcja jest włączona. To ustawienie można zastąpić na karcie „Preferencje publikacji pacjenta” w widoku klienta lub na karcie „Preferencje publikacji” pacjenta.

source: File attachments to results, e.g. microscope photos, will be included in emails to patients if this option is enabled. This setting can be overriden on Patient's 'Publication preferences' tab.
pl: Pliki z załącznikami do wyników, np. zdjęcia mikroskopowe będą dołączane do wiadomości e-mail do pacjentów, jeśli ta opcja jest włączona. To ustawienie można zastąpić na karcie „Preferencje publikacji” pacjenta.

source: Gender
pl: Płeć

source: Geographical areas can be characterized as having high, intermediate or low levels of infection.
pl: Obszary geograficzne, którym można przypisać wysoki, średni lub niski poziom zakażeń.

source: Geographical distribution
pl: Rozmieszczenie geograficzne

source: Guarantor ID
pl: ID Ubezpieczyciela

source: Hispanic or Latino
pl: Hiszpanie lub Latynosi

source: Historic Results
pl: Wyniki historyczne

source: Hours fasting
pl: Godziny postu

source: ICD Code
pl: Kod ICD

source: Identifier
pl: Identyfikator

source: Identifier Type
pl: Typ dokumentu tożsamości

source: Identifier Types
pl: Rodzaje dowodu tożsamości

source: If checked, results reports will also be sent to the Patient automatically.
pl: Jeśli zaznaczone, raporty wyników będą również automatycznie wysyłane do pacjenta.

source: If checked, results reports will also be sent to the Patient automatically. This setting can be overriden either on 'Patient publication preferences' tab from Client view or on Patient's 'Publication preferences' tab.
pl: Jeśli zaznaczone, raporty wyników będą również automatycznie wysyłane do pacjenta. To ustawienie można zastąpić na karcie „Preferencje publikacji pacjenta” w widoku klienta lub na karcie „Preferencje publikacji” pacjenta.

source: If checked, results reports will also be sent to the Patient automatically. This setting can be overriden either on Patient's 'Publication preferences' tab.
pl: Jeśli zaznaczone, raporty wyników będą również automatycznie wysyłane do pacjenta. To ustawienie można zastąpić na karcie „Preferencje publikacji” pacjenta.

source: If checked, settings will be inherited from the Client, so further changes in Client for this setting will be populated too.
pl: Jeśli zaznaczone, ustawienia zostaną odziedziczone od klienta, więc dalsze zmiany w kliencie dla tego ustawienia również zostaną wypełnione.

source: If checked, the settings for results reports distribution to patients will be inherited from Bika Setup, so further changes in Bika Setup for this setting will be populated too.
pl: Jeśli ta opcja jest zaznaczona, ustawienia dystrybucji raportów wyników wśród pacjentów zostaną odziedziczone z Senaite Setup, więc dalsze zmiany w Senaite Setup dla tego ustawienia również zostaną wypełnione.

source: If it is checked the invoices will be send to the insurance company. In this case the insurance number will be mandatory.
pl: Jeśli zaznaczone, faktury zostaną wysłane do firmy ubezpieczeniowej. W takim przypadku numer ubezpieczenia będzie obowiązkowy.

source: If selected, Client Patient IDs will be forced to be unique
pl: Jeśli ta opcja zostanie wybrana, identyfikatory pacjenta będą musiały być unikalne

source: Immunization
pl: Szczepienie

source: Immunization form
pl: Formularz szczepienia

source: Immunizations
pl: Szczepienia

source: Inches
pl: Cale

source: Incorrect data format in '${title}', should be YYYY-MM-DD
pl: Niepoprawny format daty w '${title}', powinien być w postaci RRRR-MM-DD

source: Inherit default settings
pl: Dziedzicz ustawienia domyślne

source: Insurance Companies
pl: Firmy ubezpieczeniowe

source: Insurance Company
pl: Firma ubezpieczeniowa

source: Insurance Number
pl: Numer ubezpieczenia

source: Invoices
pl: Faktury

source: Known Patient allergies to keep information that can aid drug reaction interpretation
pl: Znane reakcje uczuleniowe Pacjenta pomocne w interpretacji reakcji na leki

source: Known undesirable effects of the drug
pl: Znane niepożądane oddziaływanie leku

source: Lbs
pl: Funty

source: Location
pl: Lokalizacja

source: Mobile Phone
pl: Telefon Komórkowy

source: Native American
pl: Rdzenny Amerykanin

source: Native Hawaiian or Other Pacific Islander
pl: Hawajczyk lub mieszkaniec Wysp Pacyfiku

source: No menstrual cycle
pl: Brak cyklu miesiączkowego

source: Objective clinical findings
pl: Badanie fizykalne

source: Onset Date
pl: Data wystąpienia

source: Onset Date Estimated
pl: Szacowana data wystąpienia

source: Palliative treatment
pl: Leczenie paliatywne

source: Parameter '%s' is missing
pl: Brakuje parametru '%s'

source: Passive immunization
pl: Immunizacja bierna

source: Patient
pl: Pacjent

source: Patient Age at Case Onset Date
pl: Wiek pacjenta w czasie wystąpienia objawów

source: Patient ID
pl: Identyfikator ID pacjenta

source: Patient additional identifiers
pl: Dodatkowe identyfikatory pacjenta

source: Patient's past medical history.
pl: Historia medyczna pacjenta

source: Patients
pl: Pacjenci

source: Phone
pl: Telefon

source: Photo
pl: Zdjęcie

source: Please correct the indicated errors.
pl: Proszę poprawić wykryte błędy

source: Prevention
pl: Zapobieganie

source: Preventive/Prophylactic treatment
pl: Leczenie profilaktyczno zapobiegawcze

source: Relevant Facts
pl: Istotne fakty

source: Remarks
pl: Uwagi

source: Select a type of immunization. <br/>Active immunization entails the introduction of a foreign molecule into the body, which causes the body itself to generate immunity against the target. Vaccination is an active form of immunization<br/>Passive immunization is where pre-synthesized elements of the immune system are transferred to a person so that the body does not need to produce these elements itself. Currently, antibodies can be used for passive immunization
pl: Wybierz typ uodpornienia. <br/>Uodpornienie aktywne zakłada wprowadzenia do organizmu obcych molekuł, co mobilizuje organizm do wytworzenia odporności przeciwko nim. Szczepienie jest formą aktywnego uodpornienia<br/>Bierne uodpornienie następuje gdy wcześniej wytworzone elementy układu odpornościowego zostają przeniesione do organizmu, który nie musi ich generować samodzielnie. Do biernego uodporniania mogą zostać użyte przeciwciała.

source: Select a type of treatment.
pl: Wybierz sposób leczenia

source: Send invoices to the insurance company.
pl: Wyślij faktury do firmy ubezpieczeniowej.

source: Service '%s' not found for %s
pl: Nie znaleziono usługi '%s' dla %s

source: Service not defined
pl: Usługa nie została zdefiniowana

source: Severity levels permitted
pl: Poziomy ważności są dozwolone

source: Shock treatment
pl: Terapia szokowa

source: Should the Doctor field be mandatory while creating a case?
pl: Czy pole Lekarz powinno być obowiązkowe podczas tworzenia sprawy?

source: Specific treatment
pl: Leczenie specyficzne

source: Subtype
pl: Podtyp

source: Supporting treatment
pl: Terapia wspomagająca

source: Symptom
pl: Objaw

source: Symptoms
pl: Objawy

source: Title
pl: Tytuł

source: Treatment
pl: Leczenie

source: Treatment type
pl: Rodzaj leczenia

source: Vaccination Center
pl: Ośrodek szczepień

source: Vaccination Centers
pl: Ośrodki szczepień

source: White
pl: Biały

source: preservation
pl: utrwalenie
