Repository: pypi-data/pypi-mirror-99
Catalog: packages/feincms3/feincms3-0.90b9.tar.gz/feincms3-0.90b9/feincms3/locale/*/LC_MESSAGES/django.po
Languages: fr

source: title
fr: titre

source: move
fr: déplacer

source: Move %s
fr: Déplacer %s

source: Clone %s
fr: Cloner %s

source: New location
fr: Nouvel emplacement

source: Moving isn't possible because there are no valid targets. Maybe you selected the only root node?
fr: Le déplacement n’est pas possible car il n’y a pas de cibles valides. Peut-être avez-vous sélectionné le seul nœud racine ?

source: move here
fr: déplacer ici

source: The node %(node)s has been moved to the new position.
fr: Le nœud %(node)s a été déplacé vers la nouvelle position.

source: target
fr: cible

source: Replace target's content
fr: Remplacer le contenu de la cible

source: Affects the following models: %s.
fr: Affecte les modèles suivants : %s.

source: Current: "%s"
fr: Actuel : « %s »

source: Cannot clone node to itself.
fr: Impossible de cloner le nœud sur lui-même.

source: Updated fields of %(node)s: %(fields)s
fr: Champs mis à jour de %(node)s : %(fields)s

source: Replaced the content of %(target)s with the contents of %(source)s.
fr: Remplacement du contenu de %(target)s par le contenu de %(source)s.

source: This exact app already exists.
fr: Cette application exacte existe déjà.

source: template
fr: modèle

source: language
fr: langue

source: translation of
fr: traduction de

source: Objects in the primary language cannot be the translation of another object.
fr: Les objets dans la langue principale ne peuvent pas être la traduction d’un autre objet.

source: Objects may only be the translation of objects in the primary language.
fr: Les objets peuvent seulement être la traduction d’objets dans la langue principale.

source: Redirect to URL
fr: Rediriger vers l’URL

source: Redirect to page
fr: Rediriger vers la page

source: Only set one redirect value.
fr: Définissez une seule valeur de redirection.

source: Cannot redirect to self.
fr: Impossible de rediriger vers soi.

source: Do not chain redirects. The selected page "%(title)s" redirects to "%(path)s".
fr: Ne pas enchaîner les redirections. La page sélectionnée « %(title)s » redirige vers « %(path)s ».

source: Do not chain redirects. The following pages already redirect to this page: %(pages)s
fr: Ne pas enchaîner les redirections. Les pages suivantes redirigent déjà vers cette page : %(pages)s

source: is active
fr: est actif

source: Position is expected to be greater than zero.
fr: La position devrait être supérieure à zéro.

source: path
fr: chemin

source: Path must start and end with a slash (/).
fr: Le chemin doit commencer et se terminer par une barre oblique (/).

source: Static paths cannot be empty. Did you mean '/'?
fr: Les chemins statiques ne peuvent pas être vides. Vouliez-vous dire « / » ?

source: The page %(page)s's new path %(path)s would not be unique.
fr: Le nouveau chemin %(path)s de la page %(page)s ne serait pas unique.

source: external content
fr: contenu externe

source: Unable to fetch HTML for this URL, sorry!
fr: Impossible de récupérer le HTML pour cette URL, désolé !

source: The content will be inserted directly into the page. It is VERY important that the HTML snippet is well-formed!
fr: Le contenu sera inséré directement dans la page. Il est TRÈS important que l’extrait de code HTML soit bien formé !

source: image width
fr: Largeur de l’image

source: image height
fr: hauteur de l’image

source: primary point of interest
fr: principal point d’intérêt

source: text
fr: texte

source: rich text
fr: texte riche

source: rich texts
fr: textes riches
