Repository: pypi-data/pypi-mirror-99
Catalog: packages/fiduswriter/fiduswriter-3.9.18.tar.gz/fiduswriter-3.9.18/fiduswriter/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Admin Console
fr: Console d'administration

source: Current number of user sessions:
fr: Nombre actuel de sessions utilisateur:

source: Send a system message to all connected users:
fr: Envoyez un message système à tous les utilisateurs connectés:

source: This system will go offline for scheduled maintenance in 30 minutes. All your work will be saved automatically and we will be back shortly.
fr: Ce système sera mis hors ligne pour une maintenance planifiée dans 30 minutes. Tout votre travail sera enregistré automatiquement et nous reviendrons sous peu.

source: Send to connected users
fr: Envoyer aux utilisateurs connectés

source: Document Maintenance
fr: Maintenance des documents

source: The all in one solution for collaborative academic writing.
fr: La solution tout en un pour la publication académique collaborative.

source: JavaScript disabled
fr: JavaScript désactivé

source: Fidus Writer requires you to enable JavaScript.
fr: Fidus Writer nécessite d'activer JavaScript.

source: Browser not supported
fr: Navigateur non pris en charge

source: Your browser is not supported by Fidus Writer. Please update! We recommend using a current version of Chrome/Chromium or Firefox on a desktop computer.
fr: Votre navigateur n'est pas pris en charge par Fidus Writer. Veuillez mettre à jour! Nous vous recommandons d'utiliser une version à jour courant de Chrome / Chromium ou Firefox sur un ordinateur de bureau.

source: English
fr: Anglais

source: Bulgarian
fr: Bulgare

source: German
fr: Allemand

source: French
fr: français

source: Italian
fr: Italien

source: Spanish
fr: Espagnol

source: Portuguese (Brazil)
fr: Portugais (Brésil)

source: Fidus Writer Administration Site
fr: Site d'administration de Fidus Writer

source: Welcome to the Fidus Writer Administration Site
fr: Bienvenue sur le site d'administration de Fidus Writer

source: Duplicate selected document templates
fr: Dupliquer les modèles de documents sélectionnés

source: Add %(name)s
fr: Ajouter %(name)s

source: Before and after upgrading Fidus Writer, you should update all the documents of all users to the newest document version. Only do this if you know that no user is currently editing any document!
fr: Avant et après la mise à niveau de Fidus Writer, vous devez mettre à jour tous les documents de tous les utilisateurs à la dernière version du document. Ne faites cela que si vous savez que aucun utilisateur ne modifie actuellement aucun document!

source: Update all documents (DANGER!)
fr: Mettre à jour tous les documents (DANGER!)

source: Untitled
fr: Sans titre

source: shared
fr: partagé

source: Author
fr: Auteur

source: Access Rights
fr: Des droits d'accès

source: Access the document
fr: Accéder au document

source: Document shared:
fr: Document partagé:

source: Sign up or log in and access the document
fr: Inscrivez-vous ou connectez-vous et accédez au document

source: Comment on :
fr: Commenter :

source: Comment assignment on :
fr: Affectation des commentaires sur:

source: Comment
fr: Commentaire

source: Default
fr: Défaut

source: The template needs at least 1 document style
fr: Le modèle nécessite au moins 1 style de document

source: Hello from %(site_name)s!
fr: Bonjour de %(site_name)s!

source: You're receiving this e-mail because user %(user_display)s has given yours as an e-mail address to connect their account.
fr: Vous recevez cet e-mail car l'utilisateur %(user_display)s a donné la votre comme adresse e-mail pour connecter son compte.

source: To confirm this is correct, go to <a href="%(url)s">%(url)s</a>.
fr: Pour confirmer que cela est correct, accédez à <a href="%(url)s">%(url)s</a>.

source: Thank you from %(site_name)s!
fr: Merci de %(site_name)s!

source: You're receiving this e-mail because you or someone else has requested a password for your user account.
fr: Vous recevez cet e-mail parce que vous ou quelqu'un d'autre avez demandé un mot de passe pour votre compte d'utilisateur.

source: It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
fr: Il peut être ignoré en toute sécurité si vous n'avez pas demandé de réinitialisation du mot de passe. Cliquez sur le lien ci-dessous pour réinitialiser votre mot de passe.

source: In case you forgot, your username is %(username)s.
fr: Si vous avez oublié, votre nom d'utilisateur est %(username)s.

source: Filetype not supported
fr: Type de fichier non pris en charge

source: No file uploaded
fr: Aucun fichier téléchargé

source: Error 500
fr: Erreur 500

source: We are sorry, but a server error occured. Our team will be looking into the issue shortly.
fr: Nous sommes désolés, mais une erreur de serveur s'est produite. Notre équipe examinera le problème sous peu.

source: Error 404
fr: Erreur 404

source: We are sorry, but this page was not found.
fr: Nous sommes désolés, mais cette page est introuvable.

source: Hello from %(site_name)s!
fr: Bonjour de %(site_name)s!

source: You are receiving this e-mail because user %(user_display)s has given yours as an e-mail address to connect their account.
fr: Vous recevez cet e-mail car l'utilisateur %(user_display)s a donné la vôtre comme adresse e-mail pour connecter son compte.

source: To confirm this is correct, go to <a href="%(url)s">%(url)s</a>.
fr: Pour confirmer que c'est correct, accédez à <a href="%(url)s">%(url)s </a>.

source: Thank you from %(site_name)s!
fr: Merci de %(site_name)s!

source: You are receiving this e-mail because you or someone else has requested a password for your user account.
fr: Vous recevez cet e-mail car vous ou quelqu'un d'autre avez demandé un mot de passe pour votre compte utilisateur.

source: It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
fr: Il peut être ignoré en toute sécurité si vous n'avez pas demandé de réinitialisation de mot de passe. Cliquez sur le lien ci-dessous pour réinitialiser votre mot de passe.

source: Image too large
fr: Image trop grande

source: Can login as another user
fr: Peut se connecter en tant qu'autre utilisateur
