Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid-router-2.5.7.tar.gz/rapid-router-2.5.7/game/locale/*/LC_MESSAGES/django.po
Languages: it_it

source: How about using <b>Repeat</b> inside another <b>Repeat</b>? <br><br> This level can be broken down into sets of: <ul><li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn left</b>s, </li> <li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn right</b>s. </li></ul>
it_it: Che ne dici di usare un blocchetto <b>Ripeti</b> all'interno di un altro blocchetto <b>Ripeti</b>? <br><br> Questo livello può essere suddiviso in sequenze di: <ul><li> un ciclo annidato di <b>Muovi in avanti</b>, </li><li> due <b>Gira a sinistra</b>, </li><li> un ciclo annidato di <b>Muovi in avanti</b>, </li><li> due <b>Gira a destra</b>. </li></ul>

source: Wow! Look at that! It won't get more complicated than this, we promise.
it_it: Wow! Guarda questo livello! Non diventerà più complicato di così, te lo promettiamo.

source: With all these twists and turns, you will have to think hard about what sets of repeated instructions to use. <br><br>
it_it: Con tutte queste curve dovrai pensare bene a quali sequenze di istruzioni andranno ripetute. <br><br>

source: Since you did so well with the repeat loops, have a go at this level.
it_it: Visto che stai andando bene con i cicli, prova questo livello.

source: Most of the program will consist of repeated sets of <b>Move forwards</b> and a set of <b>Turn right</b> and <b>Turn left</b>.
it_it: Una gran parte del programma consisterà in sequenze ripetute di <b>Muovi in avanti</b> e una sequenza di <b>Gira a destra</b> e <b>Gira a sinistra</b>.

source: Notice the snow! You can create new levels with different 'themes' of backgrounds and decorations in the Level Editor. But first, try getting the van to the house!
it_it: Guarda la neve! Puoi creare nuovi livelli con 'temi' differenti per sfondi e decorazioni nell'Editor dei Livelli. Ma prima, prova a portare il furgoncino alla casa!

source: Break the program into two <b>Repeat</b>s with a <b>Turn left</b> in between them.
it_it: Suddividi il programma in due <b>Ripeti</b> con un <b>Gira a sinistra</b> in mezzo.

source: What a muddy road! Can you help Dee find her way from the barn to the house?
it_it: Che strada fangosa! Riesci ad aiutare Dee a tornare dal fienile alla casa?

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
it_it: Assicurati di inserire i blocchetti per girare nel giusto ordine dentro il blocchetto <b>Ripeti</b>.

source: Can you get the van from the warehouse to the house? Don't stop at any shops on the way!
it_it: Riesci a portare il furgoncino dal magazzino alla casa? Non fermarti a nessun negozio lungo la via!

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
it_it: Assicurati di inserire i blocchetti per girare nel giusto ordine dentro il blocchetto <b>Ripeti</b>.

source: Drag a block inside a <b>Repeat until</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to stop repeating the instruction. <br> Here, you want the van to repeat your instruction until it is at the destination. <br> Doing this means you don't have to work out how many times the van should repeat your instruction.
it_it: Trascina un blocchetto all'interno del blocchetto <b>Ripeti finché</b> per far ripetere un comando al furgoncino. <br> Attacca una 'condizione' così che il furgoncino sappia quando smettere di ripetere il comando. <br> In questo caso il furgoncino deve ripetere il comando fino a quando non raggiungerà la destinazione. <br> Questo significa che non dovrai specificare quante volte il furgoncino dovrà ripetere il tuo comando.

source: The blocks should read like a sentence: '<b>Repeat until at destination do</b>: <b>Move forwards</b>'.
it_it: Puoi usare un blocchetto '<b>Ripeti finché</b> con un blocchetto <b>Muovi in avanti</b>' all'interno.

source: Can you do that again?
it_it: Riesci a farlo di nuovo?

source: Well done, you did it! Now have a go at using the <b>Repeat until</b> block on a road with lots of turns.
it_it: Molto bene, ce l'hai fatta! Adesso prova ad usare il blocchetto <b>Ripeti finché</b> su una strada con molte curve.

source: The blocks should read like a sentence: '<b>Repeat until at destination do</b>: <b>Turn left</b>, <b>Turn right</b>'.
it_it: Dovresti riuscire a leggere i blocchetti come una frase: '<b>Ripeti fino a destinazione</b>: <b>Gira a sinistra</b>, <b>Gira a destra</b>'.

source: Have another go to make sure you have got the hang of it.
it_it: Provaci di nuovo e assicurati di prenderci la mano.

source: This program can be broken into repeated sets of <b>Turn left</b>, <b>Turn right</b> and two <b>Move forwards</b>.
it_it: Questo programma si può scomporre in sequenze ripetute di <b>Gira a sinistra</b>, <b>Gira a destra</b> e due <b>Muovi in avanti</b>.

source: Uh oh, it's <b>Until</b> fever!
it_it: Oh, è la febbre del <b>Finché</b>!

source: Good job! Can you help the driver reach the destination again?
it_it: Ben fatto! Riesci ad aiutare di nuovo l'autista ad arrivare a destinazione?

source: This program is quite similar to the one you just solved. Do you remember the solution you came up with back then?
it_it: Questo programma è abbastanza simile a quello che hai appena risolto. Ricordi la soluzione che hai usato in quel caso?

source: Another way of telling the van what to do is to use the <b>If</b> block. For example, <b>If</b> the <b>road exists forwards do</b> <b>Move forwards</b>. <br> This is called an 'if statement'. <br> Try using the <b>If</b> block and the <b>Repeat</b> block together. <br> The <b>Repeat</b> block will stretch if you attach the <b>If</b> block inside it.
it_it: Un altro modo di dire al furgoncino cosa fare è di utilizzare il blocchetto <b>Se</b>. Ad esempio, <b>Se</b> <b>esiste una strada in avanti allora</b> <b>Muovi in avanti</b>, <br> Questa è chiamata un'istruzione condizionale. <br> Prova ad usare i blocchetti <b>Se</b> e <b>Ripeti</b> insieme. <br> Il blocchetto <b>Ripeti</b> si allungherà se attacchi il blocchetto <b>Se</b> al suo interno.

source: We say that the road 'exists' in a direction. For example, if the road goes forwards we say that it 'exists forwards'. <br><br> <b>If</b> a <b>road exists forwards</b> then <b>do Move forwards</b>.<br><br>Repeat this set to get the van to the house.
it_it: Possiamo dire che la strada 'esiste' in una direzione. Ad esempio, se la strada continua in avanti diciamo che 'esiste in avanti' <br><br> <b>Se</b> <b>esiste una strada in avanti allora</b> <b>Muovi in avanti</b>.<br><br>Ripeti questa sequenza per portare il furgoncino alla casa.

source: It can be handy to use <b>If</b> to give your van choices, so you don't have to give the van new instructions at every step. <br> For example: Tell the van <b>If</b> the <b>road exists forwards do Move forwards,</b> but <b>If</b> the <b>road exists left do Turn left</b>. <br> The van will choose correctly from the <b>Move forwards</b> and <b>Turn left</b> instructions depending on the road. <br> Use an 'if statement' in a 'loop' to drive the van down this bendy road.
it_it: Può tornarti utile utilizzare <b>Se</b> per dare al tuo furgoncino una scelta, così da non dovergli dare nuovi comandi ogni volta. <br> Ad esempio: dì al furgoncino che <b>Se</b> <b>esiste una strada in avanti allora Muovi in avanti.</b> ma <b>Se</b> <b>esiste una strada a sinistra allora Gira a sinistra</b>,<br> Il furgoncino sceglierà correttamente fra i comandi <b>Muovi in avanti</b> e <b>Gira a sinistra</b> a seconda della strada. <br> Usa un'istruzione condizionale all'interno di un ciclo per guidare il furgoncino in questa strada tortuosa.

source: At each bend the van can either <b>Move forwards</b> or <b>Turn left</b>. Create a loop so it can make the correct choice. <br><br> We say that the road 'exists' in a direction. For example, if the road goes forwards we say that it 'exists forwards'.
it_it: Ad ogni curva il furgoncino può eseguire <b>Muovi in avanti</b> o <b>Gira a sinistra</b>. Crea un ciclo così da fargli fare la scelta giusta. <br><br> Diciamo che la strada 'esiste' in una direzione. Ad esempio, se la strada continua in avanti diciamo che 'esiste in avanti'.

source: You have discovered the magic of 'if statements'. Can you make a program that uses <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> to get the van to the house.
it_it: Hai scoperto la magia delle espressioni condizionali. Riesci a creare un programma che usa <b>Muovi in avanti</b>, <b>Gira a sinistra</b> e <b>Gira a destra</b> per far arrivare il furgoncino alla casa.

source: What else? If-else, that's what!
it_it: Altrimenti? Se-Altrimenti, allora!

source: You can change the <b>If</b> block to make more choices. Click on the star in the <b>If</b> block and add <b>Else if</b>. <br> This will tell the van what to do if the first <b>If</b> direction can't be done. <br> For example, tell the van to <b>Turn left</b> <b>If</b> the <b>road exists left</b>. Add <b>Else if</b> the <b>road exists right</b>, <b>Turn right</b>. <br> This uses fewer blocks and makes sure that only one step is taken in each loop. <br> This type of algorithm is called a 'general algorithm' as it can be used with most simple routes.
it_it: Puoi cambiare il blocchetto <b>Se</b> per avere più opzioni. Clicca sulla stella nel blocchetto <b>Se</b> e aggiungi <b>Altrimenti Se</b>. <br> Questo dirà al furgoncino cosa fare se la prima istruzione <b>Se</b> non può essere completata. <br> Ad esempio, dì al furgoncino <b>Gira a sinistra</b> <b>Se</b> <b>esiste una strada a sinistra</b>. Utilizza <b>Altrimenti se</b>, <b>esiste una strada a destra</b>, e <b>Gira a destra</b>. <br> In questo modo userai meno blocchetti e avrai la certezza che un solo comando verrà eseguito ad ogni ciclo. <br> Questo tipo di algoritmo si chiama 'algoritmo generale' perché può essere utilizzato in molti dei percorsi più semplici.

source: The program should be a simple set of: <b>If road exists forwards do</b> <b>Move forwards</b>, <b>Else if road exists left do Turn left</b>, <b>Else if road exists right do Turn right</b>. <br><br> You can find <b>Else if</b> by clicking the star on the <b>If</b> block and adding the <b>Else if</b>.<br><br> If the first 'condition' is true (this means if the road exists in the direction you put first) the van will follow the blocks after <b>If</b>. <br><br> If not, the van will check to see if it can follow the direction you put after <b>Else if</b>. It will keep checking until it has a direction it can take.
it_it: Il programma dovrebbe essere una sequenza semplice di: <b>Se esiste una strada in avanti allora</b> <b>Muovi in avanti</b>, <b>Altrimenti se esiste una strada a sinistra allora Gira a sinistra</b>, <b>Altrimenti esiste una strada a destra allora Gira a destra</b>. <br><br> Puoi trovare <b>Altrimenti se</b> cliccando la stella sul blocchetto <b>Se</b> e aggiungendo <b>Altrimenti se</b>. <br><br> Se la prima 'condizione' è vera (cioè se esiste la strada nella direzione che stai controllando per prima), il furgoncino seguirà le istruzioni sotto <b>Se</b>. <br><br> Altrimenti, il furgoncino controllerà se può eseguire le istruzioni specificate sotto <b>Altrimenti se</b>. Il furgoncino continuerà a controllare finché non trova una direzione in cui può proseguire.

source: Let's see if we can go further - this road is longer. Notice that the length of the road does not change the length of your program!
it_it: Vediamo se possiamo andare oltre - la strada è più lunga. Usando i blocchetti corretti noterai che la lunghezza della strada non cambia la lunghezza del tuo programma!

source: Think back to the solutions you produced using 'if statements' before.
it_it: Ricorda le soluzioni che hai creato in passato usando le espressioni condizionali.

source: Third time lucky!
it_it: Non c'è due senza tre!

source: Well done! You've got so far. <br> Can you apply the knowledge you gained going through this part of the game to this level?
it_it: Molto bene! Sei arrivato fino a qui. <br> Riesci ad applicare ciò che hai imparato fino a questo livello?

source: Dead ends!
it_it: Vicoli ciechi!

source: Can you think of a way you could change the 'general algorithm' you have implemented earlier to make sure the van driver reaches the house having travelled the shortest route?
it_it: Riesci a pensare ad un modo di cambiare l'algoritmo generale che hai scritto in precedenza per assicurarti che il furgoncino raggiunga la casa con il percorso più breve?

source: The 'general algorithm' will work here. <br><br> Make sure you change the order the van checks for directions to take the shortest route to the destination.
it_it: L'algoritmo generale funziona in questo caso. <br><br>Assicurati di cambiare l'ordine con cui il furgoncino controlla le direzioni per fare in modo che prenda il percorso più breve per arrivare a destinazione.

source: Do you think changes to the 'general algorithm' will help the van find the shortest route? <br> Or do you have to come up with a different solution? <br> Time to make a decision...
it_it: Pensi che delle modifiche al tuo 'algoritmo generale' permetterebbero al furgoncino di trovare il percorso più breve? <br> Oppure devi trovare una soluzione diversa? <br> È tempo di decidere...

source: Psst! You can simply make a change to the 'general algorithm'. <br><br> If you make the van check for turns before it checks the road exists forwards, you will come up with the perfect solution. <br><br>Notice that here it doesn't matter which turn you check for first - it will change the route but provide you with the same score.
it_it: Psst! Puoi fare una piccola modifica all'algoritmo generale. <br><br>Se fai in modo che il furgoncino controlli che le curve esistano prima di controllare se esiste una strada in avanti, avrai una soluzione perfetta. <br><br>Osserva che in questo caso non è importante quale curva controlli per prima - cambierà il percorso, ma otterrai sempre lo stesso punteggio.

source: What do you think this time?
it_it: Che ne pensi questa volta?

source: Can you use the 'general algorithm' here? <br> Can it be changed so that it finds a shorter route, or will you need a new solution?
it_it: Riesci ad usare l'algoritmo generale in questo caso? <br> Riesci a cambiarlo così da trovare un percorso più breve, o ti servirà una soluzione nuova?

source: Uh oh, moving around the blocks in your 'general algorithm' won't help. <br> How about creating a simple solution without 'if statements' that will help the van reach the house?
it_it: Ops, girare fra gli isolati con l'algoritmo generale non funzionerà. <br> Che ne pensi invece di creare una soluzione senza istruzioni condizionali per permettere al furgoncino di raggiungere la casa?

source: Good work! What else can you do?
it_it: Bel lavoro! Che altro puoi fare?

source: You should be really good at this by now. Can you manage this complicated road?
it_it: Dovresti essere decisamente bravo nel guidare il furgoncino. Riesci a risolvere questa strada complicata?

source: This road cannot be solved by a 'general algorithm'. Can you solve it without 'if statements'? <br><br> Remember to choose the shortest route and an algorithm which is as short as possible.
it_it: Questo percorso non può essere risolto con l'algoritmo generale. Riesci a risolverlo senza istruzioni condizionali? <br><br> Ricordati di trovare il percorso più breve e l'algoritmo più conciso possibile.

source: Oh no! Traffic lights!
it_it: Oh no! Semafori!

source: The light varies from red to green. <br>The van must check which colour the traffic light is when it reaches them - if it goes past a red light it will break the Highway Code.<br> Here, you want the van to repeat the wait instruction while the traffic light is red. Drag a block inside a <b>Repeat while</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to repeat the instruction.
it_it: Il semaforo cambia da rosso a verde. <br> Il furgoncino deve controllare di che colore è il semaforo quando lo raggiunge - se passa con il rosso infrangerà il Codice della Strada.<br> In questo caso, il furgoncino dovrà attendere finché il semaforo è rosso. Trascina all'interno del blocchetto <b>Ripeti mentre</b> un altro blocchetto per far ripetere al furgoncino quel comando. <br> Attacca una 'condizione' così che il furgoncino sappia quando deve ripetere il comando.

source: Don't worry about the 'general algorithm' here. Just go forwards. <br><br>Once the van is right under the traffic light, make it wait for a green light by adding a <b>Wait</b> block.
it_it: Non preoccuparti dell'algoritmo generale. Basta andare avanti. <br><br>Quando il furgoncino è proprio sotto il semaforo, aspetta che diventi verde aggiungendo un blocchetto <b>Aspetta</b>.

source: Can you write a program so the van moves forwards on a green light but waits at a red light?
it_it: Riesci a scrivere un programma per cui il furgoncino si muove in avanti col semaforo verde ma si ferma ad un semaforo rosso?

source: Use an 'if statement' to tell the van <b>If traffic light is red, Wait, Else Move forwards</b>. <br><br> Remember to repeat that until you get to the destination.
it_it: Utilizza un'istruzione condizionale per dire al furgoncino <b>Se il semaforo è rosso, Aspetta; Altrimenti, Muovi in avanti</b>. <br><br> Ricordati di ripeterlo finché non arrivi a destinazione.

source: Well done - you've made it really far!
it_it: Molto bene - sei andato decisamente lontano!

source: Let's practise what you've learnt so far. <br> Don't forget to add a turn and to make the van wait at a traffic light.
it_it: Mettiamo in pratica quello che hai imparato finora. <br> Non dimenticarti di aggiungere una curva e far fermare il furgoncino al semaforo.

source: Be careful about the order you put your <b>If</b> blocks in. <br><br>If you make the van check the road exists forwards before checking for a light, it might break the Highway Code.
it_it: Fai attenzione all'ordine nel quale metti i blocchetti <b>Se</b>. <br><br>Se fai controllare al furgoncino se esiste una strada prima di controllare il semaforo, potresti violare il Codice della Strada.

source: What a mess! But can you spot a route?
it_it: Che confusione! Riesci a trovare un percorso?

source: Put your knowledge to test. Create an algorithm to lead the van to the house. <br> Don't forget to add a turn and to make the van wait at a traffic light.
it_it: Metti alla prova la tua conoscenza. Crea un algoritmo per condurre il furgoncino alla casa. <br> Non dimenticarti di aggiungere una curva e far attendere il furgoncino al semaforo.

source: Use an 'if statement' and check if the light is red. <br><br> <b>If traffic light is red, wait, Else if road exists forwards, Move forwards, Else Turn left</b>. <br><br> Remember to repeat that until you get to the destination!
it_it: Utilizza un'espressione condizionale per controllare se il semaforo è rosso. <br><br> <b>Se il semaforo è rosso, aspetta; altrimenti se esiste una strada in avanti, muovi in avanti; altrimenti, gira a sinistra</b>. <br><br> Ricordati di ripeterlo finché non arrivi a destinazione!

source: Congratulations - you've made it really far! <br> Can you create a 'general algorithm' that will help the van reach the destination in the shortest way but stop at a traffic light?
it_it: Complimenti - sei andato molto lontano! <br> Riesci a creare un algoritmo generale che permetta al furgoncino di raggiungere la destinazione nel modo più breve fermandosi ai semafori?

source: You need to check: <ul><li> if the lights are red </li><li> if the road exists right </li><li> if the road exists forwards </li> <li> if the road exists left </li><li> if it is a dead end </li></ul>Make sure you put the checks in the right order.
it_it: Devi controllare: <ul><li> se il semaforo è rosso </li><li> se esiste una strada sulla destra </li><li> se esiste una strada in avanti </li><li> se esiste una strada sulla sinistra </li><li> se è un vicolo cieco </li></ul>Assicurati di mettere questi controlli nell'ordine giusto.

source: Amazing! Have another go!
it_it: Fantastico! Provaci di nuovo!

source: Can you change the 'general algorithm' you created before to make the van take the shortest route to the destination?
it_it: Riesci a modificare l'algoritmo generale che hai creato in precedenza per far percorrere al furgoncino il percorso più breve per arrivare a destinazione?

source: You need to check: <ul><li> if the light is red </li><li> if the road exists left </li><li> if the road exists forwards </li><li> or if the road exists right </li></ul>Do you think you need to check for a dead end? <br> Make sure you put the checks in the right order.
it_it: Devi controllare: <ul><li> se il semaforo è rosso </li><li> se esiste una strada sulla sinistra </li><li> se esiste una strada in avanti </li><li> se esiste una strada sulla destra </li></ul>Pensi che ci sia bisogno di controllare se è un vicolo cieco? <br> Assicurati di mettere questi controlli nel giusto ordine.

source: Well this is tricky. Look at all those lights! <br> Can you find the shortest route to the destination? It would be good if the van doesn't have to wait at too many lights.
it_it: Mmm, questo livello è complicato. Guarda quanti semafori ci sono! <br> Riesci a trovare il percorso più breve per la destinazione? Sarebbe fantastico se riuscissi a non far aspettare il furgoncino a troppi semafori.

source: Don't worry about the algorithm you've already come up with. Take the first turn left which has fewer traffic lights. <br><br> Once your van is right under the traffic lights, make sure it waits for a green light.
it_it: Non preoccuparti dell'algoritmo che hai già. All'inizio gira a sinistra, dove ci sono meno semafori.<br><br>Quando il tuo furgoncino è proprio sotto i semafori, assicurati di aspettare che diventino verdi.

source: Can you come up with a solution to this level using the limited number of blocks we provide at the start?
it_it: Riesci a trovare una soluzione per questo livello usando solo i blocchetti disponibili?

source: Think back to earlier levels - what did you learn?
it_it: Ripensa ai livelli precedenti - cosa hai imparato?

source: Well done so far! Can you find a solution to this road? You have to move forward, but you have no forward block to use. Do you know how to help the van get to the destination?
it_it: Ben fatto fino a qui! Riesci a trovare la soluzione per questa strada? Dovrai muoverti in avanti, ma non ci sono blocchetti 'muovi in avanti' da utilizzare. Come farai a portare il furgoncino a destinazione?

source: Don't forget to use the repeat loop.
it_it: Non dimenticarti di usare il blocchetto Ripeti.

source: Can you find the shortest route? Use your blocks carefully and don't forget the <b>repeat</b> loop.
it_it: Riesci a trovare il percorso più breve? Usa bene i tuoi blocchetti e non dimenticare il blocchetto <b>Ripeti</b>.

source: Think back to earlier levels - what did you learn
it_it: Ripensa ai livelli precedenti - cosa hai imparato

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Wonky Fish.
it_it: Utilizza i blocchetti <b>Ripeti finché</b> e <b>Se</b> per superare il livello Pesce Ondoso.

source: Think back to earlier levels - what did you learn.
it_it: Ripensa ai livelli precedenti - cosa hai imparato.

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Concrete Wasteland
it_it: Usa i blocchetti <b>Ripeti finché</b> e <b>Se</b> per farti strada nel Deserto di Cemento
