Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid-router-2.5.7.tar.gz/rapid-router-2.5.7/game/locale/*/LC_MESSAGES/djangojs.po
Languages: ca_es, tr_tr

source: You ran into a cow! Keep in mind that cows can appear anywhere on the map.
ca_es: Has xocat contra una vaca! Tingues en compte que les vaques poden aparèixer en qualsvol lloc del mapa.
tr_tr: Bir ineğe çarptın! İneklerin haritanın herhangi bir noktasında ortaya çıkabileceğini unutmayın.

source: Your first move was a crash. What went wrong?
ca_es: El teu primer moviment ha estat accidentat. Què ha fallat?
tr_tr: İlk hareketiniz bir kazaya sebep oldu. Yanlış olan neydi?

source: Your first move was right. What went wrong after that?
ca_es: El teu primer moviment ha funcionat. Què ha fallat després?

source: You ran out of fuel! Try to find a shorter route to the destination.
ca_es: T'has quedat sense benzina! Intenta trobar una ruta més curta al destí.
tr_tr: Yakıtınız bitti! Hedefe giden daha kısa bir bulun.

source: Uh oh, you just sent the van through a red light! Stick to the Highway Code - the van must wait for green.
ca_es: Oh oh, acabes de fer que la furgoneta se salti un semàfor en vermell! Segueix les normes de circulació: la furgoneta ha d'esperar el verd.
tr_tr: Eyvah eyvah, kamyoneti kırmızı ışıkta geçirdin! Otoyol kurallarına bağlı kalın - kamyonet yeşil ışığı beklemeli.

source: You have already delivered to that destination! You must only deliver once to each destination.
ca_es: Ja has lliurat a aquesta destinació! Has fer un sol lliurament per destinació.
tr_tr: Zaten bu hedefe daha önce teslimat yaptınız! Her hedefe yalnızca bir defa teslimat yapabilirsiniz.

source: The van ran out of instructions before it reached a destination. Make sure there are enough instructions to complete the delivery.
ca_es: La furgoneta s'ha quedat sense instruccions abans d'arribar a lloc. Comprova que tens prou instruccions per completar el repartiment.
tr_tr: Kamyonet hedefine daha ulaşmadan komutlar bitti. Teslimatı tamamlamak için yeterli miktarda komut kullandığınızdan emin olun.

source: The van visited the destination, but didn't stop there!
ca_es: La furgoneta ha visitat la destinació, pero no s'hi ha aturat!
tr_tr: Kamyonet hedefe ulaştı fakat orada durmadı!

source: There are destinations that have not been delivered to. Ensure you visit all destinations and use the deliver command at each one.
ca_es: Hi ha destinacions a les que no s'ha fet el lliurament. Assegura't que visites totes les destinacions i fes servir la comanda lliurar a cadascuna.
tr_tr: Henüz teslimat yapılmamış hedefler var. Tüm hedefleri ziyaret ettiğinizden ve her birinde teslim et komutu kullandığınızdan emin olun.

source: Make sure your blocks are connected to the Start block.
ca_es: Assegura't que els teus blocs estan connectats al bloc inicial.
tr_tr: Blokları Başlangıç bloğuna tutturduğunuzdan emin olun.

source: Try finding a shorter route to the destination.
ca_es: Prova de trobar una ruta més curta al destí.
tr_tr: Hedefe giden daha kısa bir rota bulmayı deneyin.

source: Try creating a simpler program.
ca_es: Prova de fer un programa més senzill.
tr_tr: Daha basit bir program oluşturmayı deneyin.

source: That solution isn't quite right. Read the level instructions or click Help.
ca_es: Aquesta solució no està del tot bé. Llegeix les instruccions del nivell o vés a Ajuda.
tr_tr: Çözümünüz yeterli değil. Seviye komutlarını okuyun veya yardıma tıklayın.

source: Congratulations! You've aced it.
ca_es: L'has clavada.
tr_tr: Tebrikler! Başardın.

source: It looks as though your program's been running a while. Check your repeat loops are okay.
ca_es: Sembla que el teu programa porta un estona executant-se. Revisa que els teus bucles de repetició siguin correctes.
tr_tr: Programınız bir süredir çalışıyormuş gibi görünüyor. Tekrar döngülerinin doğru olup olmadığını kontrol edin.

source: Error
tr_tr: Hata

source: Oh no!
tr_tr: Ah hayır!

source: No
tr_tr: Hayır
