Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid-router-2.5.7.tar.gz/rapid-router-2.5.7/game/locale/*/LC_MESSAGES/django.po
Languages: it_it

source: Code For Life : Custom level to moderate
it_it: Code For Life : Livelli personalizzati da moderare

source: Your student {student_name} from your class {class_name} has created this level: {level_url}. If you want to moderate it, you can do it on the moderation board: {moderate_url}. Thanks, The Code for Life team. {home_url}
it_it: Lo studente {student_name} della tua classe {class_name} ha creato questo livello: {level_url}. Se desideri moderarlo, puoi farlo nella pagina di moderazione: {moderate_url}. Grazie, Il team di Code for Life. {home_url}

source: Play button
it_it: Tasto Play

source: You have no permission to see this.
it_it: Non hai i permessi per vedere questo contenuto.

source: This level is private. You can only see the public levels and the ones created by other users only if they share them with you.
it_it: Questo livello è privato. Puoi vedere solo i livelli pubblici o quelli che altri utenti hanno creato e condiviso con te.

source: No permission
it_it: Nessuna autorizzazione

source: Scoreboard is only visible to school students and teachers. Log in if you think you should be able to see it.
it_it: Solo gli studenti e gli insegnanti della scuola possono vedere il tabellone dei punteggi. Fai login se pensi di essere autorizzato a vederlo.

source: There is no data to show. Please contact your administrator if this is unexpected.
it_it: Non ci sono dati da mostrare. Contatta il tuo amministratore se pensi non sia corretto.

source: Level moderation is only visible to teachers. Log in if you think you should be able to see it.
it_it: La pagina di moderazione dei livelli è visibile solo agli insegnanti. Accedi al sito se pensi di essere autorizzato a vederla.

source: You do not teach this class. Please contact your administrator if this is unexpected.
it_it: Non sei un insegnante di questa classe. Contatta l'amministratore se pensi ci sia un errore.

source: You do not teach this student. Please contact your administrator if this is unexpected.
it_it: Non sei un insegnante per questo studente. Contatta l'amministratore se pensi ci sia un errore.

source: You have not created any classes and therefore is no data to show. Please contact your administrator if this is unexpected.
it_it: Non hai creato nessuna classe: non ci sono dati da mostrare. Contatta il tuo amministratore se pensi ci sia un errore.

source: Level Share
it_it: Condividi il livello

source: You shared your level with {0} {1} successfully!
it_it: Hai condiviso il tuo livello con {0} {1} con successo!

source: You shared your level with class {0} successfully!
it_it: Hai condiviso il tuo livello con la classe {0} con successo!

source: We were unable to find %(name)s %(surname)s.
it_it: Non è stato possibile trovare %(name)s %(surname)s.

source: We were unable to find class %(class)s. Are you sure you got it right?
it_it: Non siamo riusciti a trovare la classe %(class)s. Sei sicuro che il nome sia corretto?

source: It seems that you have not created any levels. How about creating one now?
it_it: Sembra che tu non abbia creato nessun livello. Che ne dici di crearne uno adesso?

source: All the levels you have created so far. Click on them to play them or share them with your friends.
it_it: Ecco tutti i livelli che hai creato fino ad ora. Clicca su un livello per provare a risolverlo o condividerlo con i tuoi amici.

source: All the levels created by others that were shared with you. Click on them to play them
it_it: Questi sono tutti i livelli creati da altri utenti che sono stato condivisi con te. Clicca su un livello per provare a risolverlo

source: No one shared a level with you yet.
it_it: Nessun utente ha ancora condiviso un livello con te.

source: Choose a class you want to see.
it_it: Scegli la classe che vuoi vedere.

source: You don't have permissions to see this.
it_it: Non sei autorizzato a vederlo.

source: Can you find the shortest route?
it_it: Riesci a trovare il percorso più breve?

source: Think back to earlier levels. What did you learn?
it_it: Ripensa ai livelli precedenti. Cosa hai imparato?

source: Can you help the van get to the house?
it_it: Puoi aiutare il furgoncino ad arrivare alla casa?

source: Choose the right blocks to tell the van where to go. <br> Drag the blocks under the <b>Start</b> block to attach them. <br> To remove a block, drag it into the bin in the bottom right of the screen. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Seleziona i diversi bloccheti per far muovere il furgoncino nella giusta direzione.<br> Trascina i blocchetti sotto al blocchetto <b>Start</b> per attaccarli.<br>Per rimuovere un blocchetto, trascinalo nel cestino in basso a destra dello schermo.<br>Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: Drag the <b>Move forwards</b> block so that it is under the <b>Start</b> block - close enough to be touching. <br><br>Clicking on the arrows next to the %(play_button)s button will also drag the blocks into a sequence for you. <br><br>Don't forget to press %(play_button)s when you are done.
it_it: Trascina il blocchetto<b>Muovi in avanti</b> sotto il blocchetto <b>Inizio</b>, in modo che si tocchino.<br><br>Se fai click sulle frecce vicino al pulsante %(play_button)s i blocchetti verranno messi in sequenza per te.<br><br>Non dimenticare di premere %(play_button)s quando hai finito.

source: A block can be placed next to or under another, like a jigsaw. A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br> To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Un blocchetto può essere messo vicino o sotto un altro, come in un puzzle. Un secondo blocchetto <b>Muovi in avanti</b> può essere messo sotto il primo blocchetto <b>Muovi in avanti</b>.<br>Per rimuovere un blocchetto, trascinalo verso sinistra o nel cestino.<br>Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br><br>The arrows next to the <b>%(play_button)s</b> button will drag the blocks into a sequence for you.
it_it: Un secondo blocchetto <b>Muovi in avanti</b> può essere messo sotto il primo blocchetto <b>Muovi in avanti</b>.<br><br>Le frecce vicino al pulsante <b>%(play_button)s</b> mettono i blocchetti in sequenza al posto tuo.

source: Can you make the van turn right?
it_it: Riesci a far girare il furgoncino a destra?

source: This time, the van has to turn right to reach the house. Make sure you use the <b>Turn right</b> block in your sequence. <br> Drag the blocks and attach them under the <b>Start</b> block like before. To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Questa volta il furgoncino deve girare a destra per raggiungere la casa. Assicurati di usare il blocchetto <b>Gira a destra</b> nella tua sequenza.<br> Trascina i blocchetti ed attaccali sotto il blocchetto <b>Inizio</b> come hai fatto precedentemente. Per rimuovere un blocchetto, trascinalo verso sinistra o nel cestino.<br>Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: A <b>Turn right</b> block can be placed under the first <b>Move forwards</b> block. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Un blocchetto <b>Gira a destra</b> può essere messo sotto il primo blocchetto <b>Muovi in avanti</b>.<br><br> Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: This time the van has to go left. Make sure you use the <b>Turn left</b> block in your sequence. <br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Questa volta, il furgoncino deve girare a sinistra. Assicurati di usare il blocchetto <b>Gira a sinistra</b> nella tua sequenza.<br>Trascina ed attacca i blocchetti come hai fatto prima.<br> Quando sei soddisfatto della sequenza che hai creato premi %(play_button)s!

source: A <b>Turn left</b> block can be placed under a series of <b>Move forwards</b> blocks. <br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Un blocchetto <b>Gira a sinistra</b> può essere messo sotto una serie di blocchetti <b>Muovi in avanti</b>.<br> Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: You already know how to make the van turn left or right. This time the van has to make lots of turns to reach the house. <br> Drag and attach the blocks to make your sequence.<br> When you are happy with your sequence, press %(play_button)s!
it_it: Sai già come far girare il furgoncino a destra o a sinistra. Questa volta il furgoncino deve fare un sacco di curve per raggiungere la casa. <br> Trascina e collega i blocchetti per creare una sequenza.<br> Quando sei soddisfatto della tua sequenza, premi %(play_button)s!

source: This road starts by curving to the <b>left</b>. Then it curves to the <b>right</b>. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Questa strada inizia con una curva a <b>sinistra</b> e continua con una curva a <b>destra</b>. <br><br> Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: This time the van has to <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b>. <br><br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Questa volta il furgoncino deve usare i blocchetti <b>Muovi in avanti</b>, <b>Gira a sinistra</b> e <b>Gira a destra</b>. <br><br> Trascina ed attacca i blocchetti come hai fatto prima.<br> Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: Follow the road around. How many <b>Move forwards</b> do you need? <br><br>The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Segui la strada. Di quanti blocchetti <b>Muovi in avanti</b> hai bisogno?<br><br>Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: Practise your new skills on this road by helping the driver to arrive at the house. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Metti in pratica le tue nuove abilità su questa strada ed aiuta l'autista ad arrivare alla casa.<br> Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: Follow the road around. Don't forget to <b>Turn left</b> first. <br><br>The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Segui la strada. Non dimenticare di usare il blocchetto <b>Gira a sinistra</b> per primo.<br><br>Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: This time the warehouse is somewhere else on the screen but you still need to use the <b>Move forwards</b> block. <br> Can you use the <b>Move forwards</b> block correctly even when it looks like the van goes in a different direction? <br> When you are happy with your sequence, press %(play_button)s!
it_it: Questa volta il magazzino è da qualche altra parte sullo schermo ma è ancora necessario utilizzare il blocchetto <b>Muovi in avanti</b>. <br>Riesci ad utilizzare il blocchetto <b>Muovi in avanti</b> correttamente anche quando sembra che il furgoncino vada in una direzione diversa? <br>Quando sei soddisfatto della tua sequenza, premi %(play_button)s!

source: On screen, the van looks like it follows the road down. If you were in the van, it would look like you should <b>Move forwards</b>, then <b>Turn right</b>.
it_it: Sullo schermo, sembra che il furgoncino segua la strada verso il basso. Se tu fossi sul furgoncino, dovresti usare <b>Muovi in avanti</b>, poi <b>Gira a destra</b>.

source: Can you go from right to left?
it_it: Riesci ad andare da destra a sinistra?

source: How many times do you have to <b>Move forwards</b> before you <b>Turn left</b>?
it_it: Quante volte devi usare il blocchetto <b>Muovi in avanti</b> prima di usare il blocchetto <b>Gira a sinistra</b>?

source: Well done! How about another go?
it_it: Ben fatto! Che ne dici di un altro giro?

source: You've done really well so far. Try to get the van to the house. <br> When you are happy with your sequence, press %(play_button)s!
it_it: Sei andato davvero bene finora. Cerca di portare il furgoncino alla casa. <br>Quando sei soddisfatto della sequenza che hai creato, premi %(play_button)s!

source: This map is not so hard. Notice that to you it looks like the road goes up, but if you were in the in the van, you would see the road goes right. <br><br> Do you know which turn the van will take next? <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Questa mappa non è così difficile. Nota che dal tuo punto di vista può sembrare che la strada vada in su ma se tu fossi sul furgoncino vedresti la strada andare a destra.<br><br> Riesci ad indovinare in quale direzione sarà la prossima curva?<br><br> Le frecce vicino al pulsante %(play_button)s mettono i blocchetti in sequenza al posto tuo.

source: Snail maze!
it_it: Labirinto della lumaca!

source: Uh oh, a tricky snail maze! Can you take the van through it? <br> When you are happy with your sequence, press %(play_button)s!
it_it: Oh no, un labirinto complicato! Riesci a guidare il furgoncino all'uscita? <br> Quando sei soddisfatto della tua sequenza, premi %(play_button)s!

source: The maze looks a bit like a snail, doesn't it? That means that for most of the time the van should only <b>Move forwards</b> and <b>Turn right</b>. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
it_it: Questo labirinto ricorda un po' una lumaca, non è vero? Questo significa che, nella maggior parte dei casi, il furgoncino dovrebbe solo <b>muoversi avanti</b> e <b>girare a destra</b>. <br><br>Le frecce vicino al pulsante %(play_button)s metteranno i blocchetti in sequenza per te.

source: Good work, by now you are able to solve quite complicated levels. Prove your skills! <br> When you are happy with your sequence, press %(play_button)s!
it_it: Bel lavoro, adesso dovresti essere in grado di risolvere dei livelli abbastanza complicati. Metti alla prova le tue abilità! <br> Quando sei soddisfatto della tua sequenza, premi %(play_button)s!

source: This road might look much longer and more complicated, but it's not that hard. <br> Start by using <b>Move forwards</b> a few steps and <b>Move left</b>.
it_it: Questo percorso potrebbe sembrare molto più lungo e complicato, ma non è così difficile. <br> Inizia usando alcuni blocchetti <b>Muovi in avanti</b> seguiti da blocchetti <b>Gira a sinistra</b>.

source: Often there is more than one way to get to the house. The route that needs the fewest directions is usually best. <br> Help the van find the shortest route to the house. <br> You can press the %(play_button)s or <b>Play</b> buttons to start the van.
it_it: Spesso c'è più di un modo per arrivare alla casa. Il percorso che richiede il minor numero di istruzione è solitamente il migliore. <br> Aiuta il furgoncino a trovare il percorso più breve per la casa. <br> Puoi premere il pulsante %(play_button)s o <b>Inizia</b> per far partire il furgoncino.

source: Try taking the route that starts by turning left then turns right. Do you know what follows next?
it_it: Prova a prendere il percorso che inizia girando a sinistra e poi a destra. Dove andiamo dopo?

source: Can you spot the shortest route?
it_it: Riesci a trovare il percorso più breve?

source: So many options to choose from! <br> Do you know which is the shortest route to get the van to house?
it_it: Un sacco di opzioni fra cui scegliere! <br> Sai qual è il percorso più breve per portare il furgoncino alla casa?

source: The middle route seems to be shortest. Do you know what sequence of instructions will make the van follow it?
it_it: Il percorso centrale sembra essere il più corto. Sai quale sequenza di istruzioni permette al furgoncino di percorrerlo?

source: What if there is more than one delivery?
it_it: E se ci fosse più di una consegna?

source: Our vans often need to go to more than one house. To make the van deliver to a house use the <b>Deliver</b> block. <br> Make sure your sequence gets the van to travel the shortest route!
it_it: I nostri furgoncini spesso devono raggiungere più case. Per fare una consegna ad una casa usa il blocchetto <b>Consegna</b>. <br> Assicurati che la tua sequenza faccia percorrere al furgoncino il percorso più breve!

source: Make the van turn left and go directly to the closest house first. This is the shortest route. <br><br> The <b>Deliver</b> block is not needed when the van is only going to one house, but you need it when the van is going to two or more houses. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
it_it: Per prima cosa, fai girare il furgoncino a sinistra e fallo arrivare alla casa più vicina. Questo è il percorso più breve. <br><br>Il blocchetto <b>Consegna</b> non è necessario quando il furgoncino deve raggiungere solo una casa, ma ti servirà quando dovrai raggiungere due o più case. <br><br>Usa il blocchetto <b>Consegna</b> ogni volta che il furgoncino raggiunge una casa.

source: Well done! You have done really well to get so far - let's take it to the next level and add another house. <br> Can you work out the shortest, most efficient route to each house?
it_it: Molto bene! Hai fatto un bel lavoro finora - rendiamo le cose più difficili e aggiungiamo un'altra casa. <br> Riesci a trovare il percorso più breve ed efficiente per raggiungere ogni casa?

source: Although the <b>Deliver</b> block is not needed when there is only one house, you need it when there are more houses, like now. <br><br>Once the van is at a house, make sure you use the <b>Deliver</b> block. Do that for each house.
it_it: Il blocchetto <b>Consegna</b> non è necessario con una sola casa, ma ti servirà quando ci sono più case, come in questo caso. <br><br>Quando il furgoncino è a una casa, assicurati di usare il blocchetto <b>Consegna</b>. Ripetilo per ogni casa.

source: House overload!
it_it: Sovraccarico di case!

source: Well done, you're getting a hang of it! Can you do the same for even more houses?<br> Don't forget to use the <b>Deliver</b> block at each house.
it_it: Molto bene, ci stai prendendo la mano! Riesci a fare lo stesso con ancora più case?<br> Non dimenticarti di usare il blocchetto <b>Consegna</b> ad ogni casa.

source: Test your sequence to make sure that the van takes the shortest route to visit all the houses on the way. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
it_it: Prova la tua sequenza per assicurarti che il furgoncino prenda il percorso più breve per raggiungere tutte le case. <br><br>Usa il blocchetto <b>Consegna</b> ogni volta che il furgoncino raggiunge una casa.

source: Practise your new skills on this road by getting the van to <b>Deliver</b> to each of the houses.
it_it: Pratica le tue abilità su questa strada portando il furgoncino ad ogni casa ed utilizzando il blocchetto <b>Consegna</b>.

source: To make sure the van takes the shortest route, first turn left. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
it_it: Per assicurarti che il furgoncino percorra il percorso più breve, per prima cosa gira a sinistra. <br><br> Usa il blocchetto <b>Consegna</b> ogni volta che il furgoncino raggiunge una casa.

source: Attach a block inside the <b>Repeat</b> block to make the van repeat that instruction. <br> This means you can use one block instead of lots of blocks to do the same thing over and over again. <br> How many times do you want the instruction repeated? Type the number into the <b>Repeat</b> block. <br> The repeated sets of blocks make a 'loop'. <br><br> When you are ready, press <b>Play</b>!
it_it: Attacca un blocchetto all'interno del blocchetto <b>Ripeti</b> per far ripetere al furgoncino quella istruzione. <br> Questo significa che puoi usare un blocchetto invece di un gruppo di blocchetti per fare la stessa cosa più e più volte. <br> Quante volte vuoi che l'istruzione venga ripetuta? Scrivi quel numero nel blocchetto <b>Ripeti</b>. <br> L'insieme dei blocchetti ripetuti forma un 'ciclo'. <br><br>Quando sei pronto, clicca su <b>Inizia</b>!

source: A <b>Move forwards</b> block can be placed inside a <b>Repeat</b> block (to the right of the word 'Do'). <br><br> Don't forget to change the number of times you need to repeat the instruction.
it_it: Un blocchetto <b>Muovi in avanti</b> può essere inserito dentro un blocchetto <b>Ripeti</b> (a destra della parola 'Fai'). <br><br>Non dimenticarti di cambiare il numero di volte che è necessario ripetere il comando.

source: You drove the van down this road on Level 5. This time, use the <b>Repeat</b> block to get the van to the house. <br> This will make your sequence shorter and simpler than last time.
it_it: Hai guidato il furgoncino lungo questa strada nel livello 5. Questa volta, usa il blocchetto <b>Ripeti</b> per portare il furgoncino alla casa. <br>Questo renderà la tua sequenza più breve e più semplice dell'ultima volta.

source: This level can be broken down into three repeated sets of: <b>Turn left</b>, then <b>Turn right</b>. <br><br> These repeated steps make a 'loop'.
it_it: Questo livello può essere suddiviso in tre sequenze ripetute di: <b>Gira a sinistra</b>, poi <b>Gira a destra</b>. <br><br>Queste ripetizioni formano un 'ciclo'.

source: This path looks a bit like a four leaf clover. Can you take the driver through it?
it_it: Questo percorso ricorda un quadrifoglio. Riesci ad aiutare l'autista ad attraversarlo?

source: This level can be broken down into repeated sets of: <b>Move forwards</b>, <b>Turn left</b>, <b>Turn right</b>, <b>Turn left</b>.
it_it: Questo livello può essere suddiviso in sequenze ripetute di: <b>Muovi in avanti</b>, <b>Gira a sinistra</b>, <b>Gira a destra</b>, <b>Gira a sinistra</b>.

source: An algorithm (a set of instructions in a particular order) to get the van to the house might not be very simple, but it can be made shorter by using the <b>Repeat</b> blocks. <br> Are you up for this challenge?
it_it: Un algoritmo (una sequenza di comandi in un certo ordine) per condurre il furgoncino alla casa potrebbe non essere semplicissimo, ma lo si può rendere più breve usando i blocchetti <b>Ripeti</b>. <br>Sei pronto per questa sfida?

source: Look to see where you have used <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> blocks. Are any blocks next to them the same? Put them into one <b>Repeat</b> block. Don't forget to change the number of times you need to repeat the instruction.
it_it: Guarda come vengono usati i blocchetti <b>Muovi in avanti</b>, <b>Gira a sinistra</b> e <b>Gira a destra</b>. Ci sono altri blocchetti che potrebbero essere ripetuti? Inseriscili in un blocchetto <b>Ripeti</b>. Non dimenticarti di cambiare il numero di volte che l'istruzione deve essere ripetuta.

source: This road seems to be winding just like a snake! Can you find a nice and simple route to get the van to the house?
it_it: Questa strada si avvolge come un serpente! Riesci a trovare un percorso semplice per portare il furgoncino alla casa?
