Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid-router-2.5.7.tar.gz/rapid-router-2.5.7/game/locale/*/LC_MESSAGES/django.po
Languages: it_it

source: Like <b>repeat until</b>, <b>repeat while</b> is the opposite. Here, you want the van to repeat your instructions while it is not at the destination.<br>Doing this means you don't have to work out how many times the van should repeat your instructions.
it_it: <b>Ripeti mentre</b> è il contrario di <b>Ripeti finché</b>. In questo caso tu vuoi che il furgoncino ripeta i tuoi comandi mentre non è a destinazione.<br>Fare ciò significa che non dovrai calcolare quante volte il furgoncino dovrà eseguire i tuoi comandi.

source: The blocks should read like a sentence. Repeat while not at destination then add your instructions using the blocks provided.
it_it: Dovresti riuscire a leggere i blocchetti come una frase. Ripeti finché non arrivi a destinazione e poi aggiungi le tue istruzioni usando i blocchetti proposti.

source: Combining what you have just learnt using <b>repeat while</b> with the repeat loop, can you find your way around the snow snake?
it_it: Combinando ciò che hai appena imparato usando <b>ripeti finché</b> con il ciclo ripeti, riesci a farti strada nel serpente di neve?

source: The blocks should read like a sentence: <b>repeat while not at destination</b> then using the <b>repeat</b> add your instructions
it_it: Dovresti riuscire a leggere i blocchetti come una frase: <b>ripeti fino a destinazione</b> e poi, usando <b>ripeti</b>, aggiungi le tue istruzioni

source: Use your blocks carefully not forgetting the <b>turnaround</b>.
it_it: Usa attentamente i tuoi blocchetti senza dimenticarti di <b>torna indietro</b>.

source: Inside the repeat <b>repeat until</b> block, <b>turn left</b>, <b>turn around</b> and <b>turn left</b> again should do it.
it_it: All'interno del ciclo <b>ripeti finché</b>, aggiungere di nuovo <b>gira a sinistra</b>, <b>torna indietro</b> e <b>gira a sinistra</b> dovrebbe bastare.

source: Can you find your way around this puzzle?
it_it: Riesci a risolvere questo rompicapo?

source: The trick to this level is to <b>turn right</b> then <b>turn around</b>.
it_it: Il trucco per questo livello è di usare <b>Gira a sinistra</b> e poi <b>Torna indietro</b>.

source: Procedures are groups of instructions that can be executed multiple times without being rewritten. For example, if you want to instruct the van to follow a repeated pattern in the road, you can create a specific procedure. To create a procedure, simply choose the correct blocks and put them in the right order inside the <b>Define do</b> block. Once you have done that, give it a name eg wiggle.<br>Now you're ready! Attach the <b>Call</b> block where you want your 'wiggle' procedure to be executed. Don't forget to put the name in it!
it_it: Le procedure sono gruppi di comandi che possono essere eseguiti più volte senza doverli riscrivere. Ad esempio, se vuoi far muovere il furgoncino sulla strada secondo un certo schema più volte, puoi creare una procedura apposita. Per creare una procedura, scegli i blocchetti giusti e inseriscili nell'ordine corretto all'interno del blocchetto <b>Definisci</b>. Una volta fatto questo, dagli il nome 'muovi'.<br>Adesso è tutto pronto! Attacca il blocchetto <b>Chiama</b> dove vuoi che la tua procedura 'muovi' venga eseguita. Non dimenticarti del nome!

source: Don't forget to use <b>Define</b>. Name your procedure and attach the blocks in the right order. Start with <b>move forwards</b>, <b>turn left</b>, you can add repeat loops to a procedure and ending with <b>turn left</b>. Call your procedure under your start block and off you go...
it_it: Non dimenticarti di usare il blocchetto <b>Definisci</b>. Dai un nome alla tua procedura e attacca i blocchetti nel giusto ordine. Inizia con <b>muovi in avanti</b>, <b>gira a sinistra</b>, puoi aggiungere dei cicli alla tua procedura e finire con <b>gira a sinistra</b>. Chiama la tua procedura dal blocchetto iniziale ed ecco fatto...

source: Create a procedure which tells the van to wait until the traffic lights are green.
it_it: Crea una procedura che dica al furgoncino di attendere fino a quando il semaforo non diventa verde.

source: Don't forget to name your procedure eg 'lights' and every time you want the van to check the traffic lights you need to '<b>call</b>' it.
it_it: Non dimenticare di dare un nome alla tua procedura (ad esempio, "controlla semaforo") e, ogni volta che vuoi che il furgoncino controlli i semafori dovrai usare il blocchetto <b>chiama</b>.

source: Can you find the repeating pattern here and create a new 'wiggle' procedure? And do the Wiggle Wiggle!
it_it: Riesci a trovare lo schema che si sta ripetendo qui e creare una nuova procedura 'muovi'!

source: Can you see the repeating pattern in the path? The 'wiggle' consisting of a <b>turn left</b>, <b>move forwards</b>, <b>turn right</b>, <b>turn right</b>, <b>turn left</b> can be put in a <b>Define</b> block to create a procedure. Once you have named it, attach the <b>Call</b> block with the procedure's name in the text box to execute it.
it_it: Riesci a scovare lo schema che si ripete nel percorso? Il movimento che consiste in <b>gira a sinistra</b>, <b>muovi in avanti</b>, <b>gira a destra</b>, <b>gira a destra</b>, <b>gira a sinistra</b> può essere collocato in un blocchetto <b>Definisci</b> per creare una procedura. Una volta che gli hai dato un nome, attacca il blocchetto <b>Chiama</b> con il nome della procedura nella casella di testo per eseguirla.

source: Can you spot a pattern here? Create several procedures, it can save time when writing a program. Don't forget to clearly name your procedures and then call them.
it_it: Riesci a scovare degli schemi? Crea diverse procedure, può salvarti del tempo quando scrivi un programma. Non dimenticare di dargli un nome appropriato e poi chiamale.

source: One procedure could be <b>turn left</b>, <b>turn right</b>, <b>move forwards</b>, <b>turn right</b> and <b>turn left</b>. Don't forget you can create a repeat loop in your procedures.
it_it: Una procedura potrebbe essere <b>gira a sinistra</b>, <b>gira a destra</b>, <b>muovi in avanti</b>, <b>gira a destra</b> e <b>gira a sinistra</b>. Non dimenticarti che puoi creare un ciclo nelle tue procedure.

source: This road might be a bit more complicated, but the procedures you could come up with are quite simple. Have a go and find out yourself!
it_it: Questa strada potrebbe essere un po' più complicata, ma le procedure che potresti creare sono abbastanza semplici. Provaci!

source: Your first procedure could be <b>turn left</b> and <b>turn right</b> 'left-right' The second procedure could be <b>turn right</b> <b>turn left</b>, 'right-left'.
it_it: La tua prima procedura potrebbe essere chiamata 'sinistra-destra' e contenere la sequenza <b>gira a sinistra</b> e <b>gira a destra</b>. La tua seconda procedura potrebbe essere chiamata 'destra-sinistra' e contenere la sequenza <b>gira a destra</b> e <b>gira a sinistra</b>.

source: Did you know procedures can call other procedures?
it_it: Sapevi che una procedura può chiamare delle altre procedure?

source: Create 2 procedures. The first one should read <b>move forwards</b>, <b>move forwards</b>, <b>turn right</b>. The second <b>move forwards</b> then <b>call</b> your first procedure
it_it: Crea 2 procedure. La prima dovrebbe essere così: <b>muovi in avanti</b>, <b>muovi in avanti</b>, <b>gira a destra</b>. La seconda dovrebbe iniziare con <b>muovi in avanti</b> e poi <b>chiama</b> la prima procedura

source: This one will really test what you have learnt.
it_it: Questo livello metterà a dura prova ciò che hai imparato.

source: It might be easier to write the program without repeats or procedures then create 3 separate procedures from the patterns that your see.
it_it: Potrebbe essere più semplice scrivere il programma senza cicli o procedure, e successivamente separare le ripetizioni che vedi in 3 procedure distinte.

source: Can you find the shortest route?
it_it: Riesci a trovare il percorso più breve?

source: Can you find the shortest algorithm?
it_it: Riesci a trovare l'algoritmo più breve?

source: What is that? A barn for ANTS!?
it_it: Cos'è questo? Un granaio per FORMICHE!?

source: Can you get the van to the house?
it_it: Riesci ad aiutare il furgoncino ad arrivare alla casa?

source: Heard of recursion?
it_it: Mai sentito parlare di ricorsione?

source: Can you get Phil to the house?
it_it: Riesci a riportare Phil a casa?

source: Repeat while not dead end... turn around...
it_it: Ripeti finché non è un vicolo cieco... gira e gira e gira...

source: As you create your program using Blockly see what it looks like in the Python programming language. Can you tell which Python statement matches which block?
it_it: Man mano che crei i tuoi programmi usando Blockly guarda come sarebbero nel linguaggio Python. Riesci ad associare quali istruzioni in Python corrispondono a quali blocchetti di Blockly?

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> block and watch what happens in Python.
it_it: Man mano che crei i tuoi programmi usando Blockly osserva come sarebbero nel linguaggio Python. Prova ad aggiungere un blocchetto <b>ripeti</b> e guarda cosa succede in Python.

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> until block and watch what happens in Python.
it_it: Man mano che crei i tuoi programmi usando Blockly osserva come sarebbero nel linguaggio Python. Prova ad aggiungere un blocchetto <b>ripeti finché</b> e guarda cosa succede in Python.

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python.
it_it: Man mano che crei i tuoi programmi usando Blockly osserva come sarebbero nel linguaggio Python. Prova ad aggiungere un blocchetto <b>Se</b> e guarda cosa succede in Python.

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python particularly with <b>else if</b> and <b>else</b> statements.
it_it: Man mano che crei i tuoi programmi usando Blockly osserva come sarebbero nel linguaggio Python. Prova ad aggiungere un blocchetto <b>se</b> e guarda cosa succede in Python, specialmente con le istruzioni <b>altrimenti se</b> e <b>altrimenti</b>.

source: As you create your program using Blockly see what it looks like in the Python language. Try adding a procedure and watch what happens in Python.
it_it: Man mano che crei i tuoi programmi usando Blockly osserva come sarebbero nel linguaggio Python. Prova ad aggiungere una procedura e guarda cosa succede in Python.

source: Don't forget to name your procedure and see what happens in Python.
it_it: Non dimenticare di dare un nome alla tua procedura e osserva cosa succede in Python.

source: For the last challenge, the road straight line sections of road start off increasing by 1 after each turn and then switch to dividing by 2 with a twist!
it_it: Per l'ultima sfida, i rettilinei iniziano ad aumentare di uno dopo ogni curva, per poi passare a dividere per due con una curva!

source: To halve the value of a variable you can do something like the following:<br><pre>n /= 2</pre>
it_it: Per dimezzare il valore di una variabile puoi fare così:<br><pre>n /= 2</pre>

source: Levels
it_it: Livelli

source: Create
it_it: Crea

source: Scoreboard
it_it: Classifica

source: Moderate
it_it: Modera

source: Clear
it_it: Reset

source: Fast
it_it: Veloce

source: Step
it_it: Passo

source: Solve
it_it: Risolvi

source: Load
it_it: Carica

source: Save
it_it: Salva

source: Help
it_it: Aiuto

source: Day
it_it: Giorno

source: Night
it_it: Notte

source: Quit
it_it: Esci

source: This is what your program would look like in Python:
it_it: In Python il tuo programma sarebbe così:

source: Python Program
it_it: Programma in Python

source: Convert from Blockly
it_it: Converti da Blockly

source: Use the Python editor below to design your program, and then click play to try it out!
it_it: Usa l'editor Python qui sotto per scrivere il tuo programma, quindi clicca su play per provarlo!

source: Commands
it_it: Comandi

source: Console Output
it_it: Output della console

source: Clear console
it_it: Cancella console

source: Here you can load a program you've previously saved!
it_it: Qui puoi caricare un programma salvato!

source: You don't have any programs to load yet. Try saving one!
it_it: Non c'è nessun programma da caricare. Prova a salvarne uno!

source: Name
it_it: Nome

source: Delete
it_it: Elimina

source: Here you can save your program so you can retrieve it later!
it_it: Qui puoi salvare il tuo programma per caricarlo più tardi!

source: Delete Road
it_it: Cancella strada

source: Play Night
it_it: Gioca di notte

source: Map
it_it: Mappa

source: Scenery
it_it: Scenario

source: Character
it_it: Personaggio

source: Code
it_it: Codice

source: Share
it_it: Condividi

source: Here you can design your level! What sort of road will you make?
it_it: Qui puoi creare il tuo livello! Che tipo di percorso vuoi creare?

source: Max fuel:
it_it: Carburante massimo:

source: Add road
it_it: Aggiungi

source: Delete road
it_it: Cancella

source: Mark start
it_it: Partenza

source: Mark end
it_it: Arrivo

source: Clear all
it_it: Cancella tutto

source: Here you can liven up your level by choosing the theme and adding scenery! Will you create beautiful countryside or a bustling city?
it_it: Qui puoi personalizzare il tuo livello scegliendo un tema e aggiungendo degli elementi di scenario! Vuoi creare una splendida campagna o una città frenetica?

source: Theme:
it_it: Tema:

source: Scenery:
it_it: Scenario:

source: Traffic lights:
it_it: Semafori:

source: Cows:
it_it: Mucche:

source: Advanced
it_it: Avanzato

source: Advanced options
it_it: Opzioni avanzate

source: How many cows should appear for this group?
it_it: Quante mucche dovrebbero apparire per questo gruppo?

source: Character:
it_it: Personaggio:

source: Here you can select the code you can use while playing your new level!
it_it: Qui puoi scegliere il linguaggio da utilizzare nel tuo nuovo livello!

source: Language:
it_it: Linguaggio:

source: Blockly With Python View
it_it: Blockly con Python

source: Both
it_it: Entrambi

source: Select all
it_it: Seleziona tutto

source: Here you can generate a random map. Try changing some of the parameters below and see what you get!
it_it: Qui puoi generare una mappa casuale. Prova a cambiare i parametri qui sotto e vediamo che succede!

source: Size:
it_it: Dimensione:

source: Branchiness:
it_it: Ramificazioni:

source: Loopiness:
it_it: Tortuosità:

source: Curviness:
it_it: Numero di curve:

source: Traffic Lights:
it_it: Semafori:

source: Yes
it_it: Sì

source: Generate
it_it: Genera

source: Here you can load in levels created by you and your friends! Select a level in the table and press load.
it_it: Qui puoi caricare i livelli creati da te e dai tuoi amici! Seleziona un livello nella tabella e premi carica.

source: You don't have any levels to load yet. Try saving one!
it_it: Non hai nessun livello da caricare. Prova a salvarne uno!

source: Load:
it_it: Carica:

source: your own levels
it_it: i tuoi livelli

source: shared levels
it_it: livelli condivisi

source: Owner
it_it: Autore

source: Here you can save your new level. Enter a name below and hit save. Alternatively click on an existing level to update it.
it_it: Qui puoi salvare i tuoi nuovi livelli. Inserisci un nome qui sotto e clicca su Salva. Altrimenti puoi cliccare su un livello esistente per modificarlo.

source: Name:
it_it: Nome:

source: No levels found.
it_it: Nessun livello trovato.

source: Colours explained:&#013;Red: Number of levels which student has started but not submitted a working solution &#013;Orange: Number of levels which student has scored below 50%% &#013;Green: Number of levels which student has scored above 50%%
it_it: Legenda dei colori:&#013;Rosso: Numero di livelli per cui lo studente non ha inviato una soluzione funzionante &#013;Arancione: Numero di livelli per cui lo studente ha un punteggio inferiore al 50%% &#013;Verde: Numero di livelli per cui lo studente ha un punteggio superiore al 50%%

source: Student
it_it: Studente

source: Level name
it_it: Nome del livello

source: Shared with
it_it: Condiviso con

source: Class
it_it: Classe

source: Score
it_it: Punteggio

source: Total Time
it_it: Tempo Totale

source: Start Time
it_it: Inizio

source: Finish Time
it_it: Fine

source: Progress
it_it: Progresso

source: Total Score
it_it: Punteggio Totale

source: Started Levels %
it_it: % livelli iniziati

source: Attempted levels %
it_it: % livelli provati

source: Finished levels %
it_it: % livelli completati

source: %(selected)s of %(total)s selected
it_it: Selezionati %(selected)s di %(total)s

source: Select All
it_it: Seleziona tutto
