Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid-router-2.5.7.tar.gz/rapid-router-2.5.7/game/locale/*/LC_MESSAGES/djangojs.po
Languages: ca_es, tr_tr

source: You win!
ca_es: Has guanyat!
tr_tr: Kazandın!

source: Route score:
ca_es: Puntuació de la ruta:
tr_tr: Rota skoru:

source: Algorithm score:
ca_es: Puntuació de l'algorisme:
tr_tr: Algoritma skoru:

source: Your total score: %(totalScore)s/%(maxScore)s
ca_es: Puntuació total: %(totalScore)s/%(maxScore)s
tr_tr: Toplam skorunuz: %(totalScore)s/%(maxScore)s

source: Looks like you've got a route sorted using Blockly.<br><br>Now go to the Python tab and see if you can do the same in Python!
ca_es: Sembla que has aconseguit construir una ruta amb Blockly.<br><br>Ara vés a la pestanya Python i mira si ets capaç de fer el mateix amb Python!
tr_tr: Blockly kullanılarak sıralanmış bir rotan varmış gibi görünüyor.<br><br>Şimdi Pyhton sekmesine giderek aynısını Pyhton'da yapabilecek misin diye bak!

source: Close
ca_es: Tanca
tr_tr: Kapat

source: Next Level
ca_es: Següent nivell
tr_tr: Sonraki Seviye

source: Well done, you've completed the episode! <br> Are you ready for the next challenge?
ca_es: Ben fet, has acabat el capítol! <br> Estàs preparat per al proper repte?
tr_tr: Tebrikler, bu bölümü tamamladın! <br> Sonraki meydan okumaya hazır mısın?

source: Or try one of this episode's random levels!
ca_es: O prova un dels nivells a l'atzar d'aquest capítol!
tr_tr: Ya da bu bölümlerden birinin rastgele seviyelerini deneyin!

source: Next episode
ca_es: Següent episodi
tr_tr: Sonraki bölüm

source: Random level
ca_es: Nivell a l'atzar
tr_tr: Rastgele seviye

source: Home
ca_es: Inici
tr_tr: Ana Sayfa

source: That's all we've got for you right now. Carry on the fun by creating your own challenges.
ca_es: Això és tot per ara. Segueix divertint-te creant els teus propis reptes.
tr_tr: Şu an sizin için elimizdekiler bu kadar. Kendi meydan okumalarını oluşturarak eğlenceyi devam ettir.

source: Create your own map!
ca_es: Crea el teu propi mapa!
tr_tr: Kendi haritanı oluştur!

source: Do you want to try another random level?
ca_es: Vols provar un altre nivell a l'atzar?
tr_tr: Başka bir rastgele seviye denemek ister misin?

source: Have more fun!
ca_es: Segueix divertint-te!
tr_tr: Daha fazla eğlenin!

source: Oh dear!
ca_es: Oh!
tr_tr: Ah canım!

source: Are you stuck? Do you need help?
ca_es: Estàs bloquejat? Necessites ajuda?
tr_tr: Sıkıştın mı? Yardıma ihtiyacın var mı?

source: Perhaps try looking at your 'define' blocks?
ca_es: Potser pots mirar els blocs 'defineix'?
tr_tr: Belki de 'tanımlama' bloklarına göz atmayı denemelisindir?

source: Perhaps try checking the names of your 'define' blocks?
ca_es: Potser pots comprovar els noms dels blocs 'defineix'?
tr_tr: Belki de 'tanımlama' bloklarının adlarını kontrol etmeyi denemelisindir?

source: Perhaps try looking at your 'event' blocks?
ca_es: Potser pots mirar els blocs 'esdeveniment'?
tr_tr: Belki de 'olay' bloklarına göz atmayı denemelisindir?

source: Perhaps try checking the names in your 'call' blocks?
ca_es: Potser pots comprovar els noms dels blocs 'crida'?
tr_tr: Belki de 'arama' bloklarındaki isimleri kontrol etmeyi denemelisindir?

source: Perhaps try looking at your 'repeat' blocks?
ca_es: Potser pots mirar els blocs 'repeteix'?
tr_tr: Belki de 'tekrar' bloklarına göz atmayı denemelisindir?

source: Perhaps try looking at your 'if' blocks?
ca_es: Potser pots mirar els blocs 'si'?
tr_tr: Belki de 'eğer' bloklarına bakmayı denemelisindir?

source: Your program doesn't look quite right...
ca_es: El teu programa sembla que no està bé del tot...
tr_tr: Uygulamanız tam olarak doğru görünmüyor...

source: Loading workspace
ca_es: Carregant espai de treball
tr_tr: Çalışma alanı yükleniyor

source: Sorry, this workspace has blocks in it that aren't allowed in this level!
ca_es: Disculpa, aquest espai de treball té blocs que no estan permesos en aquest nivell!
tr_tr: Üzgünüm, bu çalışma alanı içerisinde bu seviyede izinli olmayan bloklar bulunuyor!

source: Start
ca_es: Comença
tr_tr: Başlat

source: The beginning of the program
ca_es: Començament del programa
tr_tr: Uygulamanın başlangıcı

source: move forwards
ca_es: mou endavant
tr_tr: ilerlet

source: Move the van forwards
ca_es: Mou endavant la furgoneta
tr_tr: Kamyoneti ilerlet

source: turn left
ca_es: gira a l'esquerra
tr_tr: sola dön

source: Turn the van left
ca_es: Fes girar la furgoneta a l'esquerra
tr_tr: Kamyoneti sola döndür

source: turn right
ca_es: gira a la dreta
tr_tr: sağa dön

source: Turn the van right
ca_es: Fes girar la furgoneta a la dreta
tr_tr: Kamyoneti sağa döndür

source: turn around
ca_es: fes la volta
tr_tr: etrafından dön

source: Turn the van around
ca_es: Fes la volta amb la furgoneta
tr_tr: Kamyoneti etrafından döndür

source: wait
ca_es: espera
tr_tr: bekle

source: Keep the van stationary
ca_es: Deixa la furgoneta parada
tr_tr: Kamyoneti hareketsiz tut

source: deliver
ca_es: entrega
tr_tr: teslim et

source: Deliver the goods from the van
ca_es: Entrega els productes de la furgoneta
tr_tr: Kamyonetteki ürünleri teslim et

source: puff up
ca_es: infla
tr_tr: havalandır

source: Puff up the van to scare away the cows
ca_es: Infla la furgoneta per espantar les vaques
tr_tr: İnekleri korkutup kaçırmak için kamyoneti havalandır

source: sound horn
ca_es: fes sonar el clàxon
tr_tr: korna çal

source: Sound the horn to scare away the cows
ca_es: Fés sonar el clàxon per espantar les vaques
tr_tr: İnekleri korkutup kaçırmak için korna çal

source: road exists forward
ca_es: existeix un camí endavant
tr_tr: ileri yol mevcut

source: road exists left
ca_es: existeix un camí a l'esquerra
tr_tr: sola yol mevcut

source: road exists right
ca_es: existeix un camí a la dreta
tr_tr: sağa yol mevcut

source: traffic light red
ca_es: semàfor vermell
tr_tr: trafik ışığı kırmızı

source: traffic light green
ca_es: semàfor verd
tr_tr: trafik ışığı yeşil

source: is dead end
ca_es: atzucac
tr_tr: çıkmaz sokak

source: at destination
ca_es: a destí
tr_tr: Varış yerinde

source: Call
ca_es: Crida
tr_tr: Çağır

source: Define
ca_es: Defineix
tr_tr: Tanımla

source: Do
ca_es: Fer
tr_tr: Yap

source: Declares the procedure
ca_es: Declara el procediment
tr_tr: Prosedürün tanımlama

source: white
ca_es: blanc
tr_tr: beyaz

source: brown
ca_es: marró
tr_tr: kahverengi

source: On
ca_es: Quan
tr_tr: Açık

source: Declares the event handler
ca_es: Declara el gestor d'events
tr_tr: Işlem yorumlayıcısının tanımlama

source: repeat while
ca_es: repeteix mentre
tr_tr: olduğu sürece tekrarla

source: do
ca_es: fer
tr_tr: yap

source: While a value is true, do some statements
ca_es: Mentre un valor sigui cert, fes algunes instruccions
tr_tr: Bir değer doğru olduğu sürece, bazı ifadeleri yap

source: repeat until
ca_es: repeteix fins
tr_tr: olana kadar tekrarla

source: Until a value is true, do some statements
ca_es: Fins que un valor sigui cert, fes algunes instruccions
tr_tr: Bir değer doğru olana kadar, bazı ifadeleri yap

source: If a value is true, then do some statements.
ca_es: Si un valor és cert, llavors fes algunes instruccions.
tr_tr: Bir değer doğru ise, bazı ifadeleri yap.

source: If a value is true, then do the first block of statements. Otherwise, do the second block of statements.
ca_es: Si un valor és cert, llavors fes el primer bloc d'instruccions. Sinó, fes el segon bloc d'instruccions.
tr_tr: Eğer bir değer doğru ise, birinci blok ifadelerini yap. Değilse, ikinci blok ifadelerini yap.

source: If the first value is true, then do the first block of statements. Otherwise, if the second value is true, do the second block of statements.
ca_es: Si el primer valor és cert, llavors fes el primer bloc d'instruccions. Sinó, si el segon valor és cert, fes el segon bloc d'instruccions.
tr_tr: Eğer birinci değer doğru ise, birinci blok ifadelerini yap. Değilse, eğer ikinci değer doğru ise, ikinci blok ifadelerini yap.

source: If the first value is true, then do the first block of statements. Otherwise, if the second value is true, do the second block of statements. If none of the values are true, do the last block of statements.
ca_es: Si el pimer valor és cert, llavors fes el primer bloc d'instruccions. Sinó, si el segon valor és cert, fes el segon bloc d'instruccions. Si cap dels valors és cert, fes l'últim bloc d'instruccions.
tr_tr: Eğer birinci değer doğru ise, birinci blok ifadelerini yap. Değilse, eğer ikinci değer doğru ise, ikinci blok ifadelerini yap. Eğer değerlerden hiçbiri doğru değilse, sondaki blok ifadelerini yap.

source: if
ca_es: si
tr_tr: eğer

source: else if
ca_es: sino si
tr_tr: ya da eğer

source: else
ca_es: si no
tr_tr: yoksa

source: repeat %(number_of_times)s times
ca_es: repeteix %(number_of_times)s vegades
tr_tr: %(number_of_times)s defa tekrarla

source: Do some statements several times.
ca_es: Fes algunes instruccions diverses vegades.
tr_tr: Bazı ifadeleri bir kaç kez çalıştırın.

source: Try again
ca_es: Torna-ho a provar
tr_tr: Tekrar dene

source: Could not connect to server. Your internet might not be working properly.
ca_es: No es pot conectar amb el servidor. La teva connexió pot no estar funcionant adequadament.
tr_tr: Sunucuya bağlanamıyor. İnternet bağlantınız düzgün çalışmıyor olabilir.

source: You are not logged in. Your progress won't be saved.
ca_es: No has iniciat sessió. El teu progrés no es desarà.
tr_tr: Giriş yapmadınız. İlerlemeniz kaydedilmeyecek.

source: Try solving this one...
ca_es: Intenta resoldre aquest...
tr_tr: Bunu çözmeyi dene...

source: Night Level %(level_name)s
ca_es: Nivell nocturn %(level_name)s
tr_tr: Gece Seviyesi %(level_name)s

source: Level %(level_name)s
ca_es: Nivell %(level_name)s
tr_tr: Seviye %(level_name)s

source: In Night Mode you can only see a very short distance. We've given you more blocks to help you find your way!
ca_es: En el Mode Nocturn només pots veure una distància molt curta. T'hem donat més blocs per ajudar-te a trobar el camí!
tr_tr: Gece modunda sadece çok kısa mesafeleri görebilirsiniz. Size, yolunuzu bulmanızda yardımcı olması için daha çok blok veriyoruz!

source: Play
ca_es: Juga
tr_tr: Oynat

source: Pause
ca_es: Pausa
tr_tr: Duraklat

source: Resume
ca_es: Continua
tr_tr: Devam Et

source: Fast
ca_es: Ràpid
tr_tr: Hızlı

source: Slow
ca_es: Lent
tr_tr: Yavaş

source: Unmute
ca_es: Deixa de silenciar
tr_tr: Sesi Aç

source: Mute
ca_es: Silencia
tr_tr: Sesi Kapat

source: Run the following commands on the van object %(var_name)s, e.g. %(example)s
ca_es: Executa les següents instruccions a l'objecte furgoneta %(var_name)s, ex: %(example)s
tr_tr: Aşağıdaki komutları %(var_name)s kamyonet nesnesi üzerinde kullanın. Örn: %(example)s

source: Movement
ca_es: Moviment
tr_tr: Hareket

source: Position
ca_es: Posició
tr_tr: Pozisyon

source: where %(arg_name)s is '%(red_color)s' or '%(green_color)s'
ca_es: on %(arg_name)s és %(red_color)s o %(green_color)s
tr_tr: %(arg_name)s nerede '%(red_color)s' yada '%(green_color)s' olduğu

source: where %(arg_name)s is '%(forward)s', '%(left)s', or '%(right)s'
ca_es: on %(arg_name)s és '%(forward)s', '%(left)s', o '%(right)s'
tr_tr: %(arg_name)s'nın nerede '%(forward)s' '%(left)s' yada '%(right)s' olduğu

source: Python Commands
ca_es: Instruccions Python
tr_tr: Python Komutları

source: Add road
ca_es: Afegir carretera
tr_tr: Yol Ekle

source: Delete road
ca_es: Esborrar carretera
tr_tr: Yolu Sil

source: Mark end
ca_es: Marca el final
tr_tr: Bitişi işaretle

source: Mark start
ca_es: Marca el començament
tr_tr: Başlangıcı işaretle

source: White
ca_es: Blanc
tr_tr: Beyaz

source: Brown
ca_es: Marró
tr_tr: Kahverengi

source: You used some invalid characters.
ca_es: Has fet servir alguns caràcters invàlids.
tr_tr: Bazı geçersiz karakterler kullandın.

source: Try saving your level again using only letters and numbers.
ca_es: Intenta desar el teu nivell una altra vegada fent servir només lletres i números.
tr_tr: Sadece harfleri ve sayıları kullanarak seviyenizi tekrar kaydetmeyi deneyin.

source: Overwriting
ca_es: Sobreescrivint
tr_tr: Üzerine yazılıyor

source: Warning
ca_es: Advertència
tr_tr: Uyarı

source: Level %(level_name)s already exists. Are you sure you want to overwrite it?
ca_es: El nivell %(level_name)s ja existeix. Estàs segur de voler-lo sobreescriure?
tr_tr: %(level_name)s seviyesi zaten mevcut. Üzerine yazmak istediğinize emin misiniz?

source: Yes
ca_es: Si
tr_tr: Evet

source: Unshare with all
ca_es: Deixa de compartir amb tothom
tr_tr: Tümüyle olan paylaşımları iptal et

source: Share with all
ca_es: Comparteix amb tothom
tr_tr: Tümüyle paylaş

source: To get started, draw a road.
ca_es: Per començar, dibuixa una carretera.
tr_tr: Başlamak için bir yol çizin.

source: Click on the square you want the road to start from. Then, without letting go of the mouse button, drag to the square you’d like the road to end on. Do this as many times as you like to add new sections of road.
ca_es: Fes clic a la casella on vols que comenci la carretera. Llavors, sense deixar anar el botó del ratolí, arrossega el quadrat fins allà on vulguis que acabi la carretera. Fes-ho tantes vegades com seccions vulguis afegir a la carretera.
tr_tr: Yolun başlamasını istediğiniz kareye tıklayın. Sonrasında, fare butonunu bırakmadan, yolun bitmesini istediğiniz çembere sürükleyin. Bunu, yola kaç kere yeni bölüm eklemek isterseniz o kadar tekrarlayın.

source: In %(map_icon)s%(map_label)s menu, click %(mark_start_icon)s%(mark_start_label)s and select a square for your road to start from. The starting point can only be placed on dead ends. You need a road first before adding a starting point. Make sure you use %(mark_end_icon)s%(mark_end_label)s to select a final destination. Setting a fuel level means the route will need to be short enough for the fuel not to run out.
ca_es: Al menú %(map_icon)s%(map_label)s, clica a %(mark_start_icon)s%(mark_start_label)s i selecciona una casella des d'on començar la carretera. El punt inicial només es pot posar en un extrem. Necessites una carretera abans d'afegir un punt inicial. Assegura't de fer servir %(mark_end_icon)s%(mark_end_label)s per triar la destinació final. Definir un nivell de combustible requreix que la carretera sigui prou curta com per que no et quedis sense combustible.
tr_tr: %(map_icon)s%(map_label)s menüsünde, %(mark_start_icon)s%(mark_start_label)s ikonuna tıklayın, sonra yolun başlayacağı kareyi seçin. Başlangıç noktaları sadece çıkmaz sokaklara yerleştirilebilir. Başlangıç noktasını belirlemeden önce bir yola ihtiyacınız var. Yolun bitiş noktasını belirmek için ise %(mark_end_icon)s%(mark_end_label)s ikonunu kullandığınızdan emin olun. Yakıt seviyesini ayarlamak, yolun yakıtın yeteceği kadar uzunlukta olması gerektiği anlamına gelir.

source: Map
ca_es: Mapa
tr_tr: Harita

source: To remove road, click the %(delete_road_icon)s%(delete_road_label)s button and select a section to get rid of.
ca_es: Per a eliminar carretera, clica el botó %(delete_road_icon)s%(delete_road_label)s i selecciona una secció per a ser eliminada.
tr_tr: Yolu kaldırmak için %(delete_road_icon)s%(delete_road_label)s butonuna tıklayın ve kurtulmak için bir bölüm seçin.

source: Click %(random_icon)s%(random_label)s if you want the computer to create a random route for you.
ca_es: Clica %(random_icon)s%(random_label)s si vols que l'ordinador et crei una ruta aleatoria.
tr_tr: Bilgisayarın size rastgele bir rota oluşturmasını istiyorsanız %(random_icon)s%(random_label)s butonuna tıklayın.

source: Random
ca_es: Aleatori
tr_tr: Rastgele

source: Select %(scenery_icon)s%(scenery_label)s and choose trees, bushes and more to place around your road. These will show in the top left corner - drag them into place. Delete items by dragging them into the bin in the bottom right. To rotate a traffic light, simply double click on it. Remember, using the traffic lights is not covered until level 44.
ca_es: Selecciona %(scenery_icon)s%(scenery_label)s i escull arbres, arbusts i més per a colocar-los al voltant de la carretera. Els elements apareixeran a la cantonada superior esquerra - arrosegal's on vulguis. Esborra elements arrosegant-los al cubell a la part inferior dreta. Per a rotar un semàfor, fes-hi doble click. Recorda, l'ús de semàfors no es cobreix fins al nivell 44.
tr_tr: %(scenery_icon)s%(scenery_label)s seçin ve yolunuzun etrafına eklemek için ağaçlar, çalılar ve daha fazlasını seçin. Seçtikleriniz sol üst köşede belirecektir - sürükleyip yerine bırakın. Silmek için ise sağ altta bulunan çöp kutusuna sürükleyin. Trafik lambasını döndürmek için sadece üzerine çift tıklayın. Unutmayın ki trafik ışıkları 44. seviyeye kadar kullanılamaz.

source: Scenery
ca_es: Paisatge
tr_tr: Sahne

source: Choose a character to play with from the %(character_icon)s%(character_label)s menu.
ca_es: Escull un personatge per jugar des del menú %(character_icon)s%(character_label)s.
tr_tr: %(character_icon)s%(character_label)s menüsünden oynamak istediğiniz bir karakter seçin.

source: Character
ca_es: Personatge
tr_tr: Karakter

source: Select which blocks of code you want to be used to create a route for your character from the %(blocks_icon)s%(blocks_label)s menu.
ca_es: Selecciona quins blocs de codi vols emprar per crear la teva ruta per al teu personatge des del menú %(blocks_icon)s%(blocks_label)s.
tr_tr: %(blocks_icon)s%(blocks_label)s menüsünden karakteriniz için oluşturmak istediğiniz rotaya uygun kod bloklarını seçin.

source: Blocks
ca_es: Blocs
tr_tr: Bloklar

source: When you're ready click %(play_icon)s%(play_label)s, or %(save_icon)s%(save_label)s your road or %(share_icon)s%(share_label)s it with a friend. Don't forget to choose a good name for it!
ca_es: Quan estiguis a punt, clica %(play_icon)s%(play_label)s, o %(save_icon)s%(save_label)s la teva carretera o %(share_icon)s%(share_label)s amb un amic. No t'oblidis de posar-li un bon nom!
tr_tr: Hazır olduğunuzda oynamak için %(play_icon)s%(play_label)s, yolu kaydetmek için %(save_icon)s%(save_label)s veya bir arkadaşınızla paylaşmak için %(share_icon)s%(share_label)s ikonlarına tıklayın. Ama güzel bir isim vermeyi de unutmayın!

source: Save
ca_es: Desa
tr_tr: Kaydet

source: Share
ca_es: Compartir
tr_tr: Paylaş

source: %(quit_icon)s%(quit_label)s will take you back to the Rapid Router homepage.
ca_es: %(quit_icon)s%(quit_label)s et portarà altre cop a la pàgina de Rapid Router.
tr_tr: %(quit_icon)s%(quit_label)s ikonu seni Hızlı Rotacı ana sayfasına götürecek.

source: Quit
ca_es: Surt
tr_tr: Çıkış

source: Group %(cow_group)s
ca_es: Agrupa %(cow_group)s
tr_tr: %(cow_group)s grupla

source: In %(map_icon)s%(map_label)s menu, click on %(add_road_icon)s%(add_road_label)s. Draw a road by clicking on a square then dragging to another square.
ca_es: Al menú %(map_icon)s%(map_label)s, fes clic a %(add_road_icon)s%(add_road_label)s. Dibuixa una carretera fent clic a una casella i arrossegant fins a una altra.
tr_tr: %(map_icon)s%(map_label)s menüsünden %(add_road_icon)s%(add_road_label)s ikonuna tıklayın. Kareden kareye tıklayıp sürükleyerek bir yol çizin.

source: You forgot to create a road.
ca_es: T'has oblidat de crear una carretera.
tr_tr: Bir yol oluşturmayı unuttun.

source: In %(map_icon)s %(map_label)s menu, click on %(mark_start_icon)%(mark_start_label) or %(mark_end_icon)s%(mark_end_label)s then select the square where you want the road to start or end.
ca_es: Al menú %(map_icon)s %(map_label)s, fes clic a %(mark_start_icon)%(mark_start_label) o %(mark_end_icon)s%(mark_end_label)s i selecciona la casella on vols que la carretera comenci o acabi.
tr_tr: %(map_icon)s%(map_label)s menüsünde %(mark_start_icon)%(mark_start_label) veya %(mark_end_icon)s%(mark_end_label)s ikonlarından birine tıklayın, daha sonra yolun başlangıç veya bitiş noktalarını işaretleyin.

source: You forgot to mark the start and end points.
ca_es: T'has oblidat de marcar els punts d'inici i final.
tr_tr: Başlangıç ve bitiş noktalarını işaretlemeyi unuttunuz.

source: Something is wrong...
ca_es: Alguna cosa està malament...
tr_tr: Birşeyler yanlış...

source: There is no way to get from the start to the destination.
ca_es: No hi ha manera d'arribar des de l'inici a la destinació.
tr_tr: Başlangıçtan bitişe kadar bir yol bulunmuyor.

source: Edit your level to allow the driver to get to the end.
ca_es: Edita el teu nivell per permetre al conductor arribar al final.
tr_tr: Sürücünün bitişe varmasını sağlamak için seviyeni düzenle.

source: Go to %(code_icon)s%(code_label)s and select some to use. Remember to include the move and turn commands!
ca_es: Ves a %(code_icon)s%(code_label)s i selecciona'n uns quants. Recorda incloure les instruccions de moure i girar!
tr_tr: %(code_icon)s%(code_label)s'e git ve kullanmak için birşeyler seçin. İlerle ve dön komutlarını ilave etmeyi unutmayın!

source: Code
ca_es: Codi
tr_tr: Kod

source: You haven't selected any blocks to use in your level
ca_es: No has seleccionat cap bloc per fer servir en el teu nivell
tr_tr: Seviyenizde kullanmak için hiçbir blok seçmediniz

source: Sharing
ca_es: Comparteix
tr_tr: Paylaşılıyor

source: Please save your level before continuing!
ca_es: Desa el teu nivell abans de continuar!
tr_tr: Devam etmeden önce lütfen seviyenizi kaydedin!

source: Please save your latest changes!
ca_es: Si us plau, desa els teus últims canvis!
tr_tr: Lütfen son değişikliklerinizi kaydedin!

source: You do not own this level. If you would like to share it you will first have to save your own copy!
ca_es: Aquest nivell no és teu. Si el vols compartir primer has de desar-ne una còpia!
tr_tr: Bu seviyenin sahibi değilsiniz. Bunu paylaşmak istiyorsanız ilk önce kendinize bir kopya kaydetmelisiniz!

source: Unfortunately you need to be logged in to save levels.
ca_es: Necessites estar connectat per poder desar nivells.
tr_tr: Ne yazık ki seviyeleri kaydetmek için oturum açmalısınız.

source: Unfortunately you need to be logged in to load levels.
ca_es: Necessites estar connectat per poder carregar nivells.
tr_tr: Ne yazık ki seviyeleri yüklemek için oturum açmalısınız.

source: Unfortunately you need to be logged in to share levels.
ca_es: Necessites estar connectat per poder compartir nivells.
tr_tr: Ne yazık ki seviyeleri paylaşmak için oturum açmalısınız.

source: You can log in as a %(student_login_url)s, %(teacher_login_url)s or %(independent_login_url)s.
ca_es: Pots entrar com a %(student_login_url)s, %(teacher_login_url)s o %(independent_login_url)s.

# login_url
source: student
ca_es: alumne

# login_url
source: teacher
ca_es: professor

# login_url
source: independent student
ca_es: alumne independent

source: Not logged in
ca_es: No has iniciat sessió
tr_tr: Oturum açılmadı

source: Sharing as an independent student
ca_es: Compartir com un estudiant independent
tr_tr: Bağımsız bir öğrenci olarak paylaşılıyor

source: Sorry but as an independent student you'll need to join a school or club to share your levels with others.
ca_es: Com a estudiant independent, per poder compartir els teus nivells amb altres hauries d'unir-te a una escola o a un club.
tr_tr: Üzgünüz, fakat seviyelerinizi diğerleri ile paylaşmak için bir okul veya kulübe kayıtlı bir öğrenci olmalısınız.

source: Click %(help_icon)s%(help_label)s for clues on getting started.
ca_es: Fes clic a %(help_icon)s%(help_label)s per obtenir suggeriments per començar.
tr_tr: Başlarken ipuçları için %(help_icon)s%(help_label)s'e tıklayın.

source: Help
ca_es: Ajuda
tr_tr: Yardım

source: Welcome to the Level editor!
ca_es: Benvinguts a l'editor de nivells!
tr_tr: Seviye editörüne hoş geldiniz!

source: Delete level
ca_es: Eliminar nivell
tr_tr: Seviyeyi sil

source: This student's level will be permanently deleted. Are you sure?
ca_es: Aquest nivell de l'estudiant s'esborrarà de manera permanent. N'esteu segur?
tr_tr: Öğrencinin seviyesi kalıcı olarak silinecek. Onaylıyor musunuz?
