Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: Levels %(first_level)s-%(last_level)s
ca_es: Nivells %(first_level)s-%(last_level)s
tr_tr: %(first_level)s-%(last_level)s arası seviyeler

source: Random: Try your hand at a random level.
ca_es: Aleatori: Intenta passar-te un nivell aleatori.
tr_tr: Rastgele: Rastgele bir seviyde şansını dene.

source: Levels created by you
ca_es: Nivells creats per tu
tr_tr: Tarafınızdan oluşturulmuş seviyeler

source: No levels have been created by you yet.
ca_es: No has creat nivells encara.
tr_tr: Tarafınızdan henüz bir seviye oluşturulmadı.

source: Levels shared with you
ca_es: Nivells compartits amb tu
tr_tr: Sizinle paylaşılan seviyeler

source: No levels have been shared with you yet.
ca_es: No s'han compartit encara nivells amb tu.
tr_tr: Henüz sizinle paylaşılan bir seviye bulunmuyor.

source: No data available in table
ca_es: No hi ha dades disponibles a la taula
tr_tr: Tabloda veri bulunmuyor

source: Showing %(start)s to %(end)s of %(total)s entries
ca_es: Mostrant de %(start)s a %(end)s de %(total)s entrades
tr_tr: Toplam %(total)s içerikten %(start)s ve %(end)s arasındakiler gösteriliyor

source: (filtered from %(max)s total entries)
ca_es: (filtrat d'un total de %(max)s entrades)
tr_tr: (toplam %(max)s girişten filtrelendi)

source: Loading...
ca_es: Carregant...
tr_tr: Yükleniyor...

source: Processing...
ca_es: Processant...
tr_tr: İşleniyor...

source: Search:
ca_es: Cerca:
tr_tr: Ara:

source: No matching records found
ca_es: No s'han trobat coincidències
tr_tr: Eşleşen kayıt bulunamadı

source: Select Classes
ca_es: Selecciona les Classes

source: Select all Classes
ca_es: Selecciona totes les Classes

source: Select Levels
ca_es: Selecciona els nivells

source: Select all Levels
ca_es: Selecciona tots els nivells

source: Export results
ca_es: Exportar resultats

source: View results
ca_es: Mostrar resultats

source: Colours explained:&#013;Red: Number of levels which student has started but not submitted a working solution &#013;Orange: Number of levels which student has scored below 50%% &#013;Green: Number of levels which student has scored above 50%%
ca_es: Explicació dels colors:&#013;Vermell: Nombre de nivells que l'alumne ha començat però per als que no ha enviat una solució vàlida &#013;Taronja: Nombre de nivells en què l'alumne ha fet menys del 50%% de punts &#013;Verd: Nombre de nivells en què l'alumne ha fet més del 50%% de punts
tr_tr: Renk açıklaması:&#013;Kırmızı: Öğrencinin başladığı ancak tamamlamadığı seviyelerin sayısını göstermektedir. &#013;Turuncu: Öğrencinin %%50'den az puan aldığı seviyelerin sayısını göstermektedir. &#013;Yeşil: Öğrencinin %%50'den fazla puan aldığı seviyelerin sayısını göstermektedir.

source: Grass
ca_es: Herba

source: Snow
ca_es: Neu

source: Farm
ca_es: Granja

source: City
ca_es: Ciutat

source: Student
ca_es: Estudiant
tr_tr: Öğrenci

source: Level name
ca_es: Nom del nivell
tr_tr: Seviye adı

source: Shared with
ca_es: Compartit amb
tr_tr: ile paylaşıldı

source: Class
ca_es: Classe
tr_tr: Sınıf

source: Score
ca_es: Puntuació
tr_tr: Puan

source: Total Time
ca_es: Temps Total
tr_tr: Toplam Zaman

source: Start Time
ca_es: Hora d'inici
tr_tr: Başlangıç Zamanı

source: Finish Time
ca_es: Hora de finalització
tr_tr: Bitiş Zamanı

source: Progress
ca_es: Progrés
tr_tr: İlerleme

source: Total Score
ca_es: Puntuació total
tr_tr: Toplam Puan

source: Started Levels %
ca_es: Nivells començats %
tr_tr: Başlanmış Seviyeler %

source: Attempted levels %
ca_es: Nivells intentats %
tr_tr: Denenmiş seviyeler %

source: Finished levels %
ca_es: Nivells acabats %
tr_tr: Tamamlanan seviyeler %

source: %(selected)s of %(total)s selected
ca_es: %(selected)s de %(total)s seleccionats
tr_tr: %(total)s adetten %(selected)s adet seçildi

source: Select All
ca_es: Selecciona-ho tot
tr_tr: Tümünü Seç

source: Python
tr_tr: Pyhton

source: No
tr_tr: Hayır

source: Classes
tr_tr: Sınıflar
