Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: To repeat within a repeats a set number of times you can use something like the following: <pre>for i in range(3): for j in range(5): v.turn left print count</pre> The print statement will output the value of count to the console.
ca_es: Per a fer una repetició dins d'una altra repetició, podries fer-ho així: <pre>for i in range(3): for j in range(5): v.turn left print count</pre> La instrucció 'print' mostrarà per consola el valor de 'count'.
tr_tr: Döngüleri belirlenen sayıda tekrarlamak için şöyle bir şey kullanabilirsiniz: <pre>for i in range(3): for j in range(5): v.turn left print count</pre> Yazdırma komutu sayım değerini konsolda gösterecektir.

source: Repeat and check
ca_es: Repeteix i comprova

source: Try to solve this level by repeatedly moving until the van is at the destination. Also, check whether the van can move forward or else must turn left. Now try and write the Python code. Look back at level 86 to give you an idea of what this could look like.
ca_es: Prova de resoldre aquest nivell fent moure la furgoneta diverses vegades fins que arribi a la destinació. Verifica si la furgoneta es pot moure endavant, o si ha de girar a l'esquerra. Ara prova d'escriure el codi en Python. Torna a mirar el nivell 86 per fer-te una idea com es podria fer en Python.
tr_tr: Bu seviyeyi, kamyonet hedefine varana kadar tekrarlayan hareketlerle çözmeye çalışın. Ayrıca, kamyonetin ileri hareket edip edemeyeceğini yoksa sola dönmesi gerektiğini kontrol edin. Şimdi Python kodunu yazmayı deneyin. Seviye 86'ya bunun nasıl görüneceğiyle ilgili göz atın.

source: To repeat while a condition is met you can use something like the following: <pre>while not v.at_destination(): v.move_forwards()</pre> To check whether a condition is met you can use something like the following: <pre>if v.is_road_forward(): v.move_forwards()</pre> You may also need to use the <b>else</b> statement.
ca_es: Per repetir mentre es compleixi una condició, pots fer servir alguna cosa com: <pre>while not v.at_destination(): v.move_forwards()</pre> Per comprovar si una condició es compleix, pots fer servir alguna cosa com: <pre>if v.is_road_forward(): v.move_forwards()</pre> També pot ser que necessitis fer servir una instrucció <b>else</b>.
tr_tr: Bir şartın geçerli olduğu sürece tekrarlanan durumlarda şunun gibi bir şey kullanabilirsiniz: <pre>while not v.at_destination(): v.move_forwards()</pre> Bir şartın gerçekleşip gerçekleşmediğini kontrol etmek için şunun gibi bir şey kullanabilirsiniz: <pre>if v.is_road_forward(): v.move_forwards()</pre> Ayrıca <b>yoksa</b> durumunu kullanmanız gerekebilir.

source: Find a general solution
ca_es: Troba una solució general

source: Now try using what you have just learnt to solve this level. You could also try using the <b>if</b>, <b>elif</b> and <b>else</b> statements. Look back at level 86 to give you an idea of what this could look like.
ca_es: Ara prova de fer servir tot el que has après fins ara per resoldre aquest nivell. També pots provar de fer servir les instruccions <b>if</b>, <b>elif</b> i <b>else</b>. Torna a mirar el nivel 86 per veure com es podria fer.
tr_tr: Şimdi, bu seviyeyi çözmek için öğrendiklerinizi kullanmaya çalışın. Ayrıca <b>eğer</b>, <b>yoksa eğer</b> ve <b>yoksa</b> komutlarını kullanmayı deneyin. Seviye 86'ya bunun nasıl görüneceğiyle ilgili göz atın.

source: To repeat while a condition is met you can use something like the following: <pre>while not v.at_destination(): v.move_forwards()</pre> To check whether a condition is met you can use something like the following: <pre>if v.is_road_forward(): v.move_forwards()</pre> You may also need to use the <b>elif</b> and <b>else</b> statements.
ca_es: Per repetir mentre es compleixi una condició, pots fer servir alguna cosa com: <pre>while not v.at_destination(): v.move_forwards()</pre> Per comprovar si una condició es compleix, pots fer servir alguna cosa com: <pre>if v.is_road_forward(): v.move_forwards()</pre> També pot ser que necessitis fer servir les instruccions <b>elif</b> i <b>else</b>.
tr_tr: Bir şartın geçerli olduğu sürece tekrarlanan durumlarda şunun gibi bir şey kullanabilirsiniz: <pre>while not v.at_destination(): v.move_forwards()</pre> Bir şartın gerçekleşip gerçekleşmediğini kontrol etmek için şunun gibi bir şey kullanabilirsiniz: <pre>if v.is_road_forward(): v.move_forwards()</pre> Ayrıca <b>yoksa eğer</b> ve <b>yoksa</b> durumularını kullanmanız gerekebilir.

source: Watch out for the dead end!
ca_es: Vigila amb el cul de sac!

source: Practice your new Python skills on this road to get the van to the destination. Look back at level 88 for a dead end check.
ca_es: Posa en pràctica les teves noves habilitats en Python per fer arribar la furgoneta fins a la seva destinació. Torna a mirar el nivell 88 per veure com comprovar els culs de sac.
tr_tr: Yeni Python yeteneklerinizi bu yol üzerinde kamyoneti hedefine götürmek için kullanın. Çıkmaz yol kontrolü için seviye 88'e tekrar göz atın.

source: Try using<br><pre>if v.at_dead_end():</pre><br>to check if the van is at a dead end.
ca_es: Fes servir<br><pre>if v.at_dead_end():</pre><br> per comprovar si la furgoneta es troba en un cul de sac.
tr_tr: Karavanın bir çıkmaz sokakta olup olmadığını kontrol etmek için <br><pre>if v.at_dead_end():</pre><br> kullanmayı deneyin.

source: Function or Junction?
ca_es: Funció o encreuament?

source: Try defining your own procedure to solve this level. In Python procedures are generally called functions. Look back at level 90 for an example of how to define a function in Python.
ca_es: Prova a definir el teu propi procediment per resoldre aquest nivell. En Python, el procediments s’anomenen habitualment funcions. Revisa el nivell 90 per veure un exemple de com definir una funció en Python.
tr_tr: Bu seviyeyi çözmek için kendi işleminizi tanımlamayı deneyin. Python işlemleri genellikle fonksiyon olarak adlandırılır. Phython'da bir fonksiyonun nasıl tanımlandığını görmek için seviye 90'daki örneğe tekrar göz atın.

source: To define a function in Python you could do something like: <pre>def my_function(): print 'test'</pre> To call a defined function you could do something like: <pre>my_function()</pre> Remember, you must define a function before you call it.
ca_es: Per definir una funció en Python pots fer servir alguna cosa com: <pre>def la_meva_funcio(): print 'prova'</pre> Per cridar una funció pots fer alguna cosa com: <pre>la_meva_funcio()</pre> Recorda, has de definir una funció abans de cridar-la.
tr_tr: Python'da bir fonksiyon tanımlamak için yapmanız gereken: <pre>def my_function(): print 'test'</pre> Tanımlanmış bir fonksiyonu çağırmak için yapmanız gereken: <pre>my_function()</pre> Unutmayın ki fonksiyonu çağırmadan önce tanımlanmış olması gerekir.

source: Watch for the patterns
ca_es: Detecta els patrons

source: For this level try defining more than one function. Try to look for a repeating pattern to simplify your program.
ca_es: Per a aquest nivell et caldrà definir més d'una funció. Intenta trobar un patró que es repeteixi per simplificar el teu programa.
tr_tr: Bu seviye için birden fazla fonksiyon tanımlamayı deneyin. Programınızı basitleştirmek için tekrarlanan deseni buldunuz mu?

source: To define a function in Python you could do something like: <pre>def my_function(): print 'test'</pre> To call a defined function you could do something like: <pre>my_function()</pre>
ca_es: Per definir una funció en Python, pots fer servir quelcom com: <pre>def my_function(): print 'test'</pre> Per cridar una funció que ja hagis definit, pots fer -ho així: <pre>my_function()</pre>
tr_tr: Python'da bir fonksiyon tanımlamak için yapmanız gereken: <pre>def my_function(): print 'test'</pre> Tanımlanmış bir fonksiyonu çağırmak için yapmanız gereken: <pre>my_function()</pre>

source: Patterns within patterns
ca_es: Patrons dins de patrons

source: For this level try to define 2 or more functions where inside one function you call another function.
ca_es: En aquest nivell, prova de definir 2 o més funcions on dins una funció cridis l'altra.
tr_tr: Bu seviye için bir fonksiyonun içine başka bir fonksiyon çağırdığınız 2 ya da daha fazla fonksiyon tanımlamayı deneyiniz.

source: To define a function that calls another function you could do something like: <pre>def my_function(): print 'test' def my_other_function(): for i in range(3): my_function() my_other_function()</pre>
ca_es: Per definir una funció que crida una altra funció, pots fer servir quelcom com: <pre>def my_function(): print 'test' def my_other_function(): for i in range(3): my_function() my_other_function()</pre>
tr_tr: Bir fonksiyonu çağıran başka bir fonksiyon tanımlamak için şöyle bir şey kullanabilirsiniz: <pre>def my_function(): print 'test' def my_other_function(): for i in range(3): my_function() my_other_function()</pre>

source: Can you see the repeating pattern?
ca_es: Pots veure el patró que es repeteix?

source: Find the shortest route
ca_es: Troba la ruta més curta

source: For this level try to implement a general algorithm. Keep the van going until it arrives at the destination, checking for traffic lights and junctions.
ca_es: En aquest nivell prova d'implementar un algorisme general. Fes que la furgoneta es mogui fins que arribi a la destinació, comprovant els semàfors i les interseccions.
tr_tr: Bu seviye için genel algoritma uygulamaya çalışın. Kamyoneti, trafik ışıklarını ve kavşakları kontrol ederek hedefine varana kadar ilerletin.

source: For this you will have to use a combination of the <b>while</b> and <b>if</b> statements.
ca_es: Per això hauràs de fer servir una combinació de les expressions <b>mentre</b> i <b>si</b>.
tr_tr: Bunun için, <b>olduğu sürece</b> ve <b>eğer</b> durumlarının bir kombinasyonunu kullanmanız gerekecek.

source: Spiral and add
ca_es: Recorre l'espiral i afegeix

source: For this level the van needs to travel in a spiral. The number of grid squares the van has to move keeps increasing by 1 on each turn. To do this you can have a loop that makes use of a variable to track the length of the road you need to travel after each turn.
ca_es: En aquest nivell la furgoneta ha de moure’s en espiral. El número de caselles que la furgoneta s’ha de moure s’incrementa en 1 cada torn. Per aconseguir-ho pots fer un bucle que empra una variable per registrar la longitud de la carretera que has de recórrer cada torn.
tr_tr: Bu seviye için kamyonet spiral bir yolda seyahat etmeli. Kamyonetin hareket etmesi gereken bölümlenmiş karelerin sayısı her dönüşte 1 artarak devam ediyor. Bunu yapmak için, her turdan sonra seyahat etmeniz gereken yolun uzunluğunu belirlemek için değişken kullanan bir döngü oluşturabilirsiniz.

source: To use a variable to store the number of grid squares the van has to move you can do something like the following: <pre>n = 1 while not v.at_destination(): print n n += 1</pre> Variables can be used in place of constants when calling functions. For example to repeat something n times you can do something like the following: <pre>for count in range(n):</pre>
ca_es: Per fer servir una variable per guardar el número de caselles que la furgoneta s’ha de moure pots fer el següent: <pre>n = 1 while not v.at_destination(): print n n += 1</pre> Les variables es poden fer servir en comptes de constants per cridar a funcions. Per exemple, per repetir una cosa n cops pots fer el següent: <pre>for count in range(n):</pre>
tr_tr: Minibüsün ilerlemesi gereken bölünmüş karelerin sayısını depolamaya yarayan bir değişken kullanmak için, takip eden gibi bir şey yapabilirsiniz: <pre>n = 1 while not v.at_destination(): print n n += 1</pre> Değişkenler fonksiyonlar çağrılırken sabit değerlerin yerine kullanılabilir. Örneğin, bir şeyi n kere tekrarlamak için takip eden gibi bir şey yapabilirsiniz: <pre>for count in range(n):</pre>

source: Spiral and double
ca_es: Recorre l'espiral i duplica

source: For this level try something similar to what you have just learnt. This time the straight sections of road are doubling in length after each turn.
ca_es: Per a aquest nivell, prova alguna cosa com el que acabes d'aprendre. Aquesta vegada, les seccions rectes són el doble de llargues després de cada gir.
tr_tr: Bu seviye için, yeni öğrendiyseniz yönteme benzer şeyler deneyin. Bu sefer, her turdan sonra, yolun düz bölümlerinin uzunluğu ikiye katlanıyor.

source: To double the value of a variable you can do something like the following:<br><pre>n *= 2</pre>
ca_es: Per doblar el valor d'una variable pots fer el següent:<br><pre>n *= 2</pre>
tr_tr: Bir değişkenin değerini ikiye katlamak için şöyle bir şey yapabilirsiniz: <br><pre>n *= 2</pre>

source: Think less
ca_es: Pensa menys

source: This time the straight sections of road decrease in length by 2 after each turn.
ca_es: Aquest cop la longitud dels segments rectes de la carretera es redueix en 2 a cada gir.
tr_tr: Bu sefer, her turdan sonra yolun düz bölümlerinin uzunluğu 2 birim kadar kısalacaktır.

source: To decrease the value of a variable by an amount you can do something like the following:<br><pre>n -= 5</pre>
ca_es: Per disminuir el valor d'una variable una quantitat concreta pots fer el següent:<br><pre>n -= 5</pre>
tr_tr: Bir değişkenin değerini belirli bir oranda azaltmak için yapmanız gereken: <br><pre>n -= 5</pre>

source: Final challenge!
ca_es: Repte final!

source: For the last challenge, the road straight line sections of road start off increasing by 1 after each turn and then switch to dividing by 2 with a twist!
ca_es: Per a aquest últim repte, les seccions rectes de la carretera s'incrementen en 1 després de cada gir i després passen a la meitat!
tr_tr: Son mücadele için, yolun düz kısımları her bir turdan sonra 1 birim artarak başlar ve her bir bükülme ile 2'ye bölünür!

source: To halve the value of a variable you can do something like the following:<br><pre>n /= 2</pre>
ca_es: Per dividir per 2 una variable pots fer el següent:<br><pre>n /= 2</pre>
tr_tr: Bir değişkenin değerini yarıya indirmek için şöyle bir şey yapabilirsiniz:<br><pre> n/= 2</pre>

source: Getting Started
ca_es: Primers passos

source: Shortest Route
ca_es: La ruta més curta

source: Loops and Repetitions
ca_es: Bucles i repeticions

source: Loops with Conditions
ca_es: Bucles amb condicions

source: If... Only
ca_es: Si... només

source: Traffic Lights
ca_es: Semàfors

source: Limited Blocks
ca_es: Blocs limitats

source: Procedures
ca_es: Procediments

source: Blockly Brain Teasers
ca_es: Trencaclosques Blockly

source: Introduction to Python
ca_es: Introducció a Python

source: Levels
ca_es: Nivells
tr_tr: Seviyeler

source: Create
ca_es: Crea
tr_tr: Oluştur

source: Scoreboard
ca_es: Puntuacions
tr_tr: Puan Tablosu

source: Moderate
ca_es: Modera
tr_tr: Yönet

source: Clear
ca_es: Esborra
tr_tr: Temizle

source: Play
ca_es: Inici
tr_tr: Oynat

source: Fast
ca_es: Ràpid
tr_tr: Hızlı

source: Stop
ca_es: Atura
tr_tr: Durdur

source: Step
ca_es: Pas
tr_tr: Adım

source: Solve
ca_es: Resol
tr_tr: Çöz

source: Load
ca_es: Carrega
tr_tr: Yükle

source: Save
ca_es: Desa
tr_tr: Kaydet

source: Help
ca_es: Ajuda
tr_tr: Yardım

source: Mute
ca_es: Silencia
tr_tr: Sesi kapat

source: Day
ca_es: Dia
tr_tr: Gündüz

source: Night
ca_es: Nit
tr_tr: Gece

source: Quit
ca_es: Surt
tr_tr: Çıkış

source: This is what your program would look like in Python:
ca_es: Així es com es veuria el teu programa en Python:
tr_tr: Bu, programınızın Python'da nasıl görüneceği:

source: Python Program
ca_es: Programa en Python
tr_tr: Python Programı

source: Convert from Blockly
ca_es: Convertir de Blockly
tr_tr: Blockly'den dönüştür

source: Use the Python editor below to design your program, and then click play to try it out!
ca_es: Fes servir l'editor de Python que hi ha a sota per dissenyar el teu programa, i clica Inici per posar a prova el resultat!
tr_tr: Python editörünü kullanarak programınızı tasarlayın ve test etmek için oynata tıklayın!

source: Commands
ca_es: Ordres
tr_tr: Komutlar

source: Console Output
ca_es: Sortida de la consola
tr_tr: Konsol Çıktısı

source: Clear console
ca_es: Neteja la consola
tr_tr: Konsolu temizle

source: Here you can load a program you've previously saved!
ca_es: Aquí pots carregar un programa prèviament guardat!
tr_tr: Daha önce kaydettiğiniz programı buradan yükleyebilirsiniz!

source: You don't have any programs to load yet. Try saving one!
ca_es: Encara no tens cap programa per carregar. Prova de desar-ne un!
tr_tr: Henüz yükleyebileceğiniz kayıtlı program bulunmuyor. Bir tane kaydetmeyi deneyin!

source: Name
ca_es: Nom
tr_tr: İsim

source: Delete
ca_es: Esborra
tr_tr: Sil

source: Here you can save your program so you can retrieve it later!
ca_es: Pots desar el teu programa per a recuperar-lo més tard!
tr_tr: Programınızı buradan kaydedebilir, böylece daha sonra yeniden erişebilirsiniz!

source: Delete Road
ca_es: Esborrar carretera
tr_tr: Yolu Sil

source: Play Night
ca_es: Juga de nit
tr_tr: Gece Oynat

source: Map
ca_es: Mapa
tr_tr: Harita

source: Scenery
ca_es: Paisatge
tr_tr: Sahne

source: Character
ca_es: Personatge
tr_tr: Karakter

source: Code
ca_es: Codi
tr_tr: Kod

source: Random
ca_es: Aleatori
tr_tr: Rastgele

source: Share
ca_es: Comparteix
tr_tr: Paylaş

source: Here you can design your level! What sort of road will you make?
ca_es: Ara pots dissenyar el teu propi nivell! Quin tipus de carretera faràs?
tr_tr: Buradan seviyeni tasarlayabilirsin! Ne tür bir yol yapacaksın?

source: Max fuel:
ca_es: Combustible màxim:
tr_tr: Azami yakıt:

source: Add road
ca_es: Afegeix carretera
tr_tr: Yol ekle

source: Delete road
ca_es: Elimina carretera
tr_tr: Yolu sil

source: Mark start
ca_es: Marca el començament
tr_tr: Başlangıcı işaretle

source: Mark end
ca_es: Marca el final
tr_tr: Bitişi işaretle

source: Clear all
ca_es: Esborra-ho tot
tr_tr: Tümünü temizle

source: Here you can liven up your level by choosing the theme and adding scenery! Will you create beautiful countryside or a bustling city?
ca_es: Ara pots animar el teu nivell canviant el tema i afegint decorats! Faràs una ciutat bulliciosa o preciosos camps?
tr_tr: Buradan seviyeni canlandırmak için tema seçebilir ve sahne ekleyebilirsin! Güzel bir kırsal bölge mi yoksa hareketli bir şehir mi oluşturacaksın?

source: Theme:
ca_es: Tema:
tr_tr: Tema:

source: Scenery:
ca_es: Paisatge:
tr_tr: Sahne:

source: Traffic lights:
ca_es: Semàfors:
tr_tr: Trafik ışıkları:

source: Cows:
ca_es: Vaques:
tr_tr: İnekler:

source: Advanced
ca_es: Avançat
tr_tr: Gelişmiş

source: Advanced options
ca_es: Opcions avançades
tr_tr: Gelişmiş seçenekler

source: How many cows should appear for this group?
ca_es: Quantes vaques haurien d’aparèixer per a aquest grup?
tr_tr: Kaç tane inek bu grupta ortaya çıkacak?

source: Min:
ca_es: Mínim:
tr_tr: Asgari:

source: Max:
ca_es: Màxim:
tr_tr: Azami:

source: Here you can choose your character. Who will you play as?
ca_es: Aquí pots escollir el teu personatge. Qui seràs?
tr_tr: Burada bir karakter seçebilirsin. Kim olarak oynamak istersin?

source: Character:
ca_es: Personatge:
tr_tr: Karakter:

source: Here you can select the code you can use while playing your new level!
ca_es: Aquí pots seleccionar el codi que podràs fer servir mentre juguis el teu nou nivell!
tr_tr: Burada yeni seviyende oynarken kullanabileceğin kodları seçebilirsin!

source: Language:
ca_es: Llenguatge de programació:
tr_tr: Dil:

source: Blockly With Python View
ca_es: Blockly amb vista de Python
tr_tr: Pyhton Görüntüsü ile Blockly

source: Both
ca_es: Ambdós
tr_tr: İkisi de

source: Select all
ca_es: Selecciona-ho tot
tr_tr: Tümünü seç

source: Here you can generate a random map. Try changing some of the parameters below and see what you get!
ca_es: Aquí pots generar un mapa aleatori. Prova de canviar alguns dels paràmetres de sota i observa els resultats!
tr_tr: Burada rastgele bir harita oluşturabilirsin. Aşağıdaki bazı parametreleri değiştirerek neler elde edebileceğini dene!

source: Size:
ca_es: Mida:
tr_tr: Boyut:

source: Branchiness:
ca_es: Ramificacions:
tr_tr: Kollar:

source: Loopiness:
ca_es: Bucles:
tr_tr: Döngüler:

source: Curviness:
ca_es: Curves:
tr_tr: Dönüşler:

source: Traffic Lights:
ca_es: Semàfors:
tr_tr: Trafik Işıkları:

source: Yes
ca_es: Si
tr_tr: Evet

source: Generate
ca_es: Genera
tr_tr: Üret

source: Here you can load in levels created by you and your friends! Select a level in the table and press load.
ca_es: Aquí pots carregar els nivells creats per tu i els teus amics! Selecciona un nivell a la taula i prem Carrega.
tr_tr: Buradan tarafınızdan ve arkadaşlarınız tarafından oluşturulmuş seviyeleri yükleyebilirsiniz! Tablodan bir seviye seçin ve yükleye basın.

source: You don't have any levels to load yet. Try saving one!
ca_es: No tens cap nivell per carregar. Prova de desar-ne un!
tr_tr: Henüz yükleyebileceğiniz bir seviye bulunmuyor. Bir tane kaydetmeyi deneyin!

source: Load:
ca_es: Carrega:
tr_tr: Yükle:

source: your own levels
ca_es: els teus nivells
tr_tr: sahibi olduğunuz seviyeler

source: shared levels
ca_es: nivells compartits
tr_tr: paylaşılan seviyeler

source: Owner
ca_es: Propietari
tr_tr: Sahip

source: Here you can save your new level. Enter a name below and hit save. Alternatively click on an existing level to update it.
ca_es: Aquí pots desar el teu nou nivell. Introdueix un nom a sota i prem "desa". Alternativament, fes clic en un nivell existent per a actualitzar-lo.
tr_tr: Burada yeni seviyenizi kaydedebilirsiniz. Aşağıda bir isim verin ve kaydete basın. Alternatif olarak mevcut bir seviyeye tıklayarak onu güncelleyebilirsiniz.

source: To play your level and be tracked, first <b>Quit</b> the Level Editor and select your level from the 'Levels created by you' section.
ca_es: Per jugar el teu nivell i ser enregistrat, <b>Surt</b> de l'Editor de Nivells i selecciona el teu nivell de la secció "Nivells creats per tu".
tr_tr: Seviyenizi oynamak ve izlenmesini sağlamak için öncelikle Seviye Editörü'nden <b>Çıkış</b> yapın ve sonra 'Tarafınızdan Oluşturulmuş Seviyeler' alanından seviyenizi seçin.

source: Name:
ca_es: Nom:
tr_tr: İsim:

source: Here you can share your level with your classes or your fellow teachers.
ca_es: Aquí pots compartir el teu nivell amb les teves classes o els altres professors.
tr_tr: Burada seviyenizi sınıfınızla veya öğretmeninizle paylaşabilirsiniz.

source: Here you can share your level with your classmates. Try clicking in the Shared column!
ca_es: Aquí pots compartir el teu nivell els teus companys de classe. Prova de clicar a la columna Compartit!
tr_tr: Burada seviyenizi sınıf arkadaşlarınızla paylaşabilirsiniz. Paylaşılan sütununda tıklamayı deneyin!

source: Share with:
ca_es: Comparteix amb:
tr_tr: Şununla paylaş:

source: Teachers
ca_es: Professors
tr_tr: Öğretmenler

source: Class:
ca_es: Classe:
tr_tr: Sınıf:

source: Shared
ca_es: Compartit
tr_tr: Paylaşıldı

source: Share with all
ca_es: Compartit amb tothom
tr_tr: Tümüyle paylaş

source: Level moderation
ca_es: Moderar nivells
tr_tr: Seviye yönetimi

source: Filter levels
ca_es: Filtra nivells
tr_tr: Seviyeleri filtrele

source: Filter the levels by class and student, and click 'Submit' to see the student's levels.
ca_es: Filtra els nivells per classe i estudiant i clica a 'Enviar' per veure els nivells dels estudiants.
tr_tr: Seviyeleri sınıfa ve öğrenciye göre filtrele, ve öğrencinin seviyelerini görmek için 'Gönder' butonuna basın.

source: Student:
ca_es: Estudiant:
tr_tr: Öğrenci:

source: Submit
ca_es: Enviar
tr_tr: Gönder

source: No levels found.
ca_es: No s'han trobat nivells.
tr_tr: Seviye bulunamadı.

source: Select a class and student to view their created levels.
ca_es: Selecciona una classe i un estudiant per veure els nivells que ha creat.
tr_tr: Oluşturdukları seviyeleri görmek için bir sınıf veya öğrenci seçin.
