Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Wonky Fish.
ca_es: Fes servir <b>repetir fins</b> i l'estructura <b>if</b> per trobar el camí pel peix ondulat.
tr_tr: <b>olana kadar tekrarla</b> ve <b>eğer</b> ifadelerini kullanarak balık iskeleti şeklindeki yolu tamamlayın.

source: Think back to earlier levels - what did you learn.
ca_es: Recorda els nivells anteriors i què hi has après.
tr_tr: Önceki seviyeleri düşünün - neler öğrendiniz.

source: Concrete Wasteland
ca_es: Desert de ciment

source: Use <b>repeat until</b> and the <b>if</b> statement to find your way around the Concrete Wasteland
ca_es: Fes servir <b>repeteix fins</b> i l'estructura <b>si</b> per trobar el camí pel desert de ciment
tr_tr: <b>olana kadar tekrarla</b> ve <b>eğer</b> ifadelerini kullanarak Moloz Yığını'na giden yolu bulun

source: This is <b>not...</b> the same
ca_es: Això... <b>no</b> és el mateix

source: Like <b>repeat until</b>, <b>repeat while</b> is the opposite. Here, you want the van to repeat your instructions while it is not at the destination.<br>Doing this means you don't have to work out how many times the van should repeat your instructions.
ca_es: <b>Repeteix fins</b> és com <b>repeteix mentre</b>, però al revés. Aquí, el que es vol és que la furgoneta repeteixi la instrucció mentre no hagi arribat al destí.<br>Fent això no cal que comptis quantes vegades hauria de repetir la furgoneta les teves instruccions.
tr_tr: <b>olana kadar tekrarla</b> ile <b>olduğu sürece tekrarla</b> birbirinin tersidir. Burada, kamyonetin komutlarınızı hedef noktasına varmadığı sürece tekrarlamasını istiyorsunuz.<br>Bunu yapmak, kamyonetin, komutlarınızı kaç kez tekrarlaması gerektiği konusunda düşünmenize gerek olmayacağı anlamına gelir.

source: The blocks should read like a sentence. Repeat while not at destination then add your instructions using the blocks provided.
ca_es: Els blocs s'haurien de poder llegir com una frase. Repeteix fins que no siguis al destí, després afegeix les teves instruccions fent servir els blocs proporcionats.
tr_tr: Bloklar bir cümle gibi okunmalı. Hedefte değilken tekrarlayın sonrasında size sağlanan blokları kullanarak komutunuzu ekleyin.

source: Snow snake
ca_es: Serp de neu

source: Combining what you have just learnt using <b>repeat while</b> with the repeat loop, can you find your way around the snow snake?
ca_es: Combinant el que acabes d'aprendre fent servir el bloc <b>repeteix mentre</b> amb el bucle de repetició, pots trobar el camí per la serp de neu?
tr_tr: Az önce öğrendiğin <b>olduğu sürece tekrarla</b> ifadesi ile tekrar döngüsünü birleştirip kar yılanı etrafında yolunu bulabilir misin?

source: The blocks should read like a sentence: <b>repeat while not at destination</b> then using the <b>repeat</b> add your instructions
ca_es: Els blocs s'han de poder llegir com una frase: <b>repeteix mentre no siguis al destí</b> llavors fent servir <b>repeteix</b> afegeix les teves instruccions
tr_tr: Bloklar cümle gibi okunmalı: <b>hedefte olmadığınız sürece</b> deyiminden sonra <b>tekrarla</b> ifadesini kullanarak komutu ekleyin

source: Tricky turnaround
ca_es: Tornada complicada

source: Use your blocks carefully not forgetting the <b>turnaround</b>.
ca_es: Empra els blocs curosament sense oblidar <b>gira enrere</b>.
tr_tr: <b>Etrafında dön</b> ifadesini unutmayarak, blokları dikkatli bir şekilde kullanın.

source: Inside the repeat <b>repeat until</b> block, <b>turn left</b>, <b>turn around</b> and <b>turn left</b> again should do it.
ca_es: Dins del bloc <b>repeteix fins</b>, <b>gira a l'esquerra</b>, <b>gira enrere</b> i <b>gira a l'esquerra</b> una altra vegada hauria de funcionar.
tr_tr: Tekrar döngüsü içinde <b>olana kadar tekrarla</b>, <b>sola dön</b>, <b>etrafında dön</b> ve tekrar <b>sola dön</b> bloklarını kullanabilirsin.

source: Right around the block
ca_es: Just a la cantonada

source: Can you find your way around this puzzle?
ca_es: Pots trobar el camí a través del trencaclosques?
tr_tr: Bu bulmaca etrafında yolunuzu bulabilir misiniz?

source: The trick to this level is to <b>turn right</b> then <b>turn around</b>.
ca_es: El truc per a aquest nivell és <b>gira a la dreta</b> i llavors <b>gira enrere</b>.
tr_tr: Bu seviyenin hilesi önce <b>sağa dön</b> sonra <b>etrafında dön</b>'dür.

source: Can you create the 'Wiggle' procedure?
ca_es: Pots crear el procediment "Gira"?

source: Procedures are groups of instructions that can be executed multiple times without being rewritten. For example, if you want to instruct the van to follow a repeated pattern in the road, you can create a specific procedure. To create a procedure, simply choose the correct blocks and put them in the right order inside the <b>Define do</b> block. Once you have done that, give it a name eg wiggle.<br>Now you're ready! Attach the <b>Call</b> block where you want your 'wiggle' procedure to be executed. Don't forget to put the name in it!
ca_es: Els procediments són grups d'instruccions que es poden executar múltiples vegades sense haver de ser reescrits. Per exemple, si vols donar instruccions a la furgoneta per a que segueixi un patró repetit a la carretera, simplement escull els blocs correctes i posa'ls en l'ordre apropiat dins del bloc <b>Defineix</b>. Un cop ho hagis fet, posa-li un nom, per exemple "gira". <br>Ara estàs a punt! Afegeix el bloc <b>Crida</b> on vulguis que s'executi el teu procediment "gira". No t'oblidis de posar-hi el nom!
tr_tr: İşlemler, yeniden yazılmadan çok kere tekrarlanarak çalıştırılabilen komutlar grubudur. Örneğin, kamyonetin yolda tekrarlanmış bir şablonu izlemesi talimatını vermek istiyorsanız, özel bir işlem oluşturabilirsiniz. Bir işlem oluşturmak için, basitçe, doğru blokları seçerek onları doğru sıralamada <b>Tanımla</b> bloğuna ekleyiniz. Bunu tamamladığınız zaman, ona bir isim verin, örneğin; kıvrılma.<br>Şimdi hazırsınız! <b>Çağır</b> bloğunuzu 'kıvrılma' işleminizin nerede başlamasını istiyorsanız oraya iliştirin. İçerisine isim koymayı unutmayın!

source: Don't forget to use <b>Define</b>. Name your procedure and attach the blocks in the right order. Start with <b>move forwards</b>, <b>turn left</b>, you can add repeat loops to a procedure and ending with <b>turn left</b>. Call your procedure under your start block and off you go...
ca_es: No t'oblidis d'utilitzar el bloc <b>Defineix</b>. Posa un nom al teu procediment i afegeix els blocs en l'ordre correcte. Comença amb <b>endavant</b>, <b>gira a l'esquerra</b>, pots afegir bucles a un procediment i acabar amb un <b>gira a l'esquerra</b>. Crida el teu procediment dins el bloc d'inici i som-hi...
tr_tr: <b>Tanımla</b> bloğunu kullanmayı unutmayın. İşleminizi isimlendirin ve blokları doğru sıralamayla yerleştirin. <b>İlerlet</b> ve <b>sola dön</b> ile işe başlayın, tekrar döngülerini işleminize ekleyebilir ve <b>sola dön</b> ile bitirebilirsiniz. Başlangıç bloğunuzun altına işleminizi çağırın ve devam etmeye hazırsınız...

source: Lots of Traffic Lights!
ca_es: Un munt de semàfors!

source: Create a procedure which tells the van to wait until the traffic lights are green.
ca_es: Crea un procediment que li digui a la furgoneta que esperi fins que el semàfor sigui verd.
tr_tr: Kamyonete trafik ışıkları yeşil olana kadar beklemesini söyleyen bir işlem oluşturun.

source: Don't forget to name your procedure eg 'lights' and every time you want the van to check the traffic lights you need to '<b>call</b>' it.
ca_es: No t'oblidis de posar nom al teu procediment, per exemple 'semafors', i cada vegada que vulguis que la furgoneta comprovi els semàfors l'has de cridar ('<b>crida</b>').
tr_tr: Mesela 'ışıklar' gibi prosedürünüzü isimlendirmeyi unutmayın ki kamyonetin ışıkları her seferinde kontrol etmesini istediğinizde işleminizi <b>çağır</b> bloğu ile çağırabilesiniz.

source: Wiggle Wiggle
ca_es: Gira-gira

source: Can you find the repeating pattern here and create a new 'wiggle' procedure? And do the Wiggle Wiggle!
ca_es: Pots trobar què s'està repetint aquí i crear un nou procediment que es digui "remenar"? I remena nena!
tr_tr: Buradaki tekrarlayan deseni bulup yeni bir 'kıvrım' işlemi oluşturabilir misiniz? Sonra tabi ki Kıvır Kıvır!

source: Can you see the repeating pattern in the path? The 'wiggle' consisting of a <b>turn left</b>, <b>move forwards</b>, <b>turn right</b>, <b>turn right</b>, <b>turn left</b> can be put in a <b>Define</b> block to create a procedure. Once you have named it, attach the <b>Call</b> block with the procedure's name in the text box to execute it.
ca_es: Pots veure el patró de repetició en el camí? El "tirabuixó" consistent en <b>gira a l'esquerra</b>, <b>mou endavant</b>, <b>gira a la dreta</b>, <b>gira a la dreta</b>, <b>gira a l'esquerra</b> es pot posar en un bloc <b>Defineix</b> per crear un procediment. Una vegada li hagis posat un nom, afegeix el bloc <b>Crida</b> amb el nom del procediment al quadre de text per executar-lo.
tr_tr: Bu yolda tekrarlayan deseni görebildin mi? <b>Sola dönüş</b>, <b>ilerle</b>, <b>sağa dönüş</b>, <b>sağa dönüş</b>, <b>sola dönüş</b> içeren komutları <b>Tanımla</b> bloğuna ekleyerek bir 'kıvrılma' işlemi oluşturun. Bir kez bu işlemi isimlendirdikten sonra çalıştırmak için <b>Çağır</b> bloğunu metin kutusu içinde işlem ismi ile birlikte ekleyin.

source: Muddy Patterns with Phil
ca_es: Passejant pel fang amb en Phil

source: Can you spot a pattern here? Create several procedures, it can save time when writing a program. Don't forget to clearly name your procedures and then call them.
ca_es: Hi veus cap patró aquí? Crea diversos procediments, t'estalviarà temps quan escriguis un programa. No oblidis de posar un nom clar als teus procediments i després cridar-los.
tr_tr: Buradaki deseni çözebildin mi? Program yazarken zaman kazandıracak birkaç işlem oluşturun. Bunlara ayırt edilebilecek anlaşılır bir isim vermeyi ve bunları çağırmayı unutmayın.

source: One procedure could be <b>turn left</b>, <b>turn right</b>, <b>move forwards</b>, <b>turn right</b> and <b>turn left</b>. Don't forget you can create a repeat loop in your procedures.
ca_es: Un possible procediment podria ser <b>gira a l'esquerra</b>, <b>gira a la dreta</b>, <b>endavant</b>, <b>gira a la dreta</b> i <b>gira a l'esquerra</b>. Recorda que pots crear bucles de repetició en els teus procediments.
tr_tr: Bir işlem <b>sola dön</b>, <b>sağa dön</b>, <b>ilerle</b>, <b>sağa dön</b> ve <b>sola dön</b> olabilir. İşlemler içinde de tekrar döngüsü oluşturabileceğini unutma.

source: Complicated roads
ca_es: Carreteres complicades

source: This road might be a bit more complicated, but the procedures you could come up with are quite simple. Have a go and find out yourself!
ca_es: Aquesta carretera pot semblar complicada, però els procediments que se't poden ocórrer són ben senzills. Prova-ho i descobreix-los!
tr_tr: Bu yol biraz daha karmaşık olabilir fakat oluşturabileceğiniz işlemler oldukça basittir. İlerleyin ve kendinizi bulun!

source: Your first procedure could be <b>turn left</b> and <b>turn right</b> 'left-right' The second procedure could be <b>turn right</b> <b>turn left</b>, 'right-left'.
ca_es: El primer procediment podria ser <b>gira a l'esquerra</b> i <b>gira a la dreta</b> 'esquerra-dreta'. El segon procediment podria ser <b>gira a la dreta</b> <b>gira a l'esquerra</b>, 'dreta-esquerra'.
tr_tr: İlk işleminiz, 'sol-sağ' şeklinde <b>sola dön</b> ve <b>sağa dön</b> olabilir. İkinci işleminiz ise 'sağ-sol' şeklinde <b>sağa dön</b> ve <b>sola dön</b> olabilir.

source: Dee's snowy walk
ca_es: Passejant per la neu amb la Dee

source: Did you know procedures can call other procedures?
ca_es: Sabies que els procediments poden cridar altres procediments?
tr_tr: İşlemlerin diğer işlemleri çağırabildiğini biliyor muydunuz?

source: Create 2 procedures. The first one should read <b>move forwards</b>, <b>move forwards</b>, <b>turn right</b>. The second <b>move forwards</b> then <b>call</b> your first procedure
ca_es: Crea 2 procediments. El primer hauria de llegir <b>endavant</b>, <b>endavant</b>, <b>gira a la dreta</b>. El segon <b>endavant</b> i després <b>crida</b> el primer procediment.
tr_tr: 2 işlem oluşturun. Birinci işlem <b>İlerle</b>, <b>İlerle</b>, <b>Sağa Dön</b> şeklinde olmalıdır. İkinci işlem ise <b>İlerle</b> işleminden sonra birinci prosedürü <b>Çağır</b> şeklinde olmalı.

source: Crazy Farm
ca_es: Granja boja

source: This one will really test what you have learnt.
ca_es: Això posarà a prova tot el que has après.
tr_tr: Bu seviye şimdiye kadar öğrendiklerinizi gerçekten sınayacak.

source: It might be easier to write the program without repeats or procedures then create 3 separate procedures from the patterns that your see.
ca_es: Potser seria més fàcil escriure el programa sense repeticions o procediments i després crear 3 procediments separats pels patrons que puguis veure.
tr_tr: Tekrarlar veya işlemler olmadan program yazmak daha kolay olabilir. Öyleyse gördüğünüz desenlerden 3 bağımsız işlem oluşturun.

source: T - time
ca_es: L'hora de la T

source: Can you find the shortest route?
ca_es: Ets capaç de trobar la ruta més curta?
tr_tr: En kısa yolu bulabildin mi?

source: Duck pond dodge
ca_es: Esquiva l'estany de l'ànec

source: Winter wonderland
ca_es: Paisatge nevat

source: Frozen challenge
ca_es: Repte congelat

source: Can Wes Find his lunch?
ca_es: Trobarà en Wes el seu dinar?

source: Traffic light freeze up!
ca_es: Semàfor congelat!

source: Can you find the shortest algorithm?
ca_es: Ets capaç de trobar l'algorisme més curt?
tr_tr: En kısa algoritmayı bulabilir misin?

source: Pandemonium
ca_es: Pandemònium

source: Kirsty's maze time
ca_es: El laberint de la Kirsty

source: Cannot turn left!
ca_es: Sense girar a l'esquerra!

source: What is that? A barn for ANTS!?
ca_es: Què és això? Un graner per a FORMIGUES!?
tr_tr: Bu da nedir? Karıncalar için bir ahır mı!?

source: G Force
ca_es: Força G

source: Can you get the van to the house?
ca_es: Pots fer arribar la furgoneta a la casa?
tr_tr: Kamyoneti eve götürebilir misin?

source: Heard of recursion?
ca_es: Et sona la recursivitat?
tr_tr: Tekrarlama duydun mu?

source: Wandering Phil
ca_es: En Phil el rodamon

source: Can you get Phil to the house?
ca_es: Pots fer arribar el Phil a la casa?
tr_tr: Phil'i eve götürebilir misin?

source: Repeat while not dead end... turn around...
ca_es: Repeteix mentre no trobis un cul de sac... mitja volta...
tr_tr: Çıkmaz sokak olmadığı sürece tekrar et... etrafında dön...

source: Muddy Mayhem
ca_es: Infern enfangat

source: Here's Python!
ca_es: Aquí hi ha Python!

source: As you create your program using Blockly see what it looks like in the Python programming language. Can you tell which Python statement matches which block?
ca_es: A mesura que crees el teu programa fent servir Blockly pots veure com és en el llenguatge de programació Python. Pots endevinar quina expressió en Python correspon a cada bloc?
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. Hangi Pyhton komutu ile hangi bloğun eşleştiğini söyleyebilir misin?

source: Matching Blockly
ca_es: Equivalències en Blockly

source: Don't forget to find the shortest route
ca_es: No t'oblidis de trobar la ruta més curta

source: Repeating yourself in Python looks different
ca_es: Repetir-se en Python és diferent

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> block and watch what happens in Python.
ca_es: Mentre crees el teu programa en Blockly mira com seria en el llenguatge de programació Python. Prova d'afegir un bloc <b>repetició</b> i mira què passa en Python.
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. <b>Tekrarla</b> bloğunu eklemeyi deneyin ve Pyhton'da neler olduğunu görün.

source: Repeat and watch
ca_es: Repeteix i observa

source: Looks easy but use repeat until and see what happens?
ca_es: Sembla fàcil, però fes servir el "Repeteix fins" i observa què passa

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding a <b>repeat</b> until block and watch what happens in Python.
ca_es: Mentre crees el teu programa en Blockly mira com és en el llenguatge de programació Python. Prova d'afegir un bloc <b>Repeteix fins</b> i mira què passa en Python.
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. <b>olana kadar tekrarla</b> bloğunu kullanmayı deneyin ve Pyhton'da neler olacak görün.

source: See what the if blocks looks like in Python
ca_es: Mira com es veu el bloc "si" en Python

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python.
ca_es: Mentre crees el teu programa en Blockly mira com és en el llenguatge de programació Python. Prova d'afegir un bloc <b>Si</b> i mira què passa en Python.
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. <b>Eğer</b> bloğunu eklemeyi deneyin ve Pyhton'da neler olacak görün.

source: Don't forget to use else if
ca_es: No t'oblidis de fer servir el "sinó si"

source: As you create your program using Blockly see what it looks like in the Python programming language. Try adding an <b>if</b> block and watch what happens in Python particularly with <b>else if</b> and <b>else</b> statements.
ca_es: Mentre crees el teu programa en Blockly mira com és en el llenguatge de programació Python. Prova d'afegir un bloc <b>Si</b> i mira què passa en Python, especialment amb les expressions <b>Sinó si</b> i <b>Sinó</b>.
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. <b>Eğer</b> bloğunu eklemeyi deneyin ve özellikle <b>yoksa eğer</b> ve <b>yoksa</b> ifadeleri ile birlikte Pyhton'da neler olacağını görün.

source: See what happens when you add Traffic lights
ca_es: Observa què passa quan hi afegeixes semàfors

source: Watch carefully as you have another go
ca_es: Observa atentament mentre ho tornes a provar

source: Have a go at procedures - what do they look like in Python?
ca_es: Prova els procediments. Quin aspecte tenen en Python?

source: As you create your program using Blockly see what it looks like in the Python language. Try adding a procedure and watch what happens in Python.
ca_es: Mentre crees el teu programa en Blockly mira com és en el llenguatge de programació Python. Prova d'afegir un procediment i mira què passa en Python.
tr_tr: Programınızı Blockly kullanarak oluştururken Pyhton programlama dilinde neye benzediğini görün. Bir işlem eklemeyi deneyin ve Pyhton'da neler olacağını görün.

source: Don't forget to name your procedure and see what happens in Python.
ca_es: No t'oblidis de posar un nom al teu procediment i mira què passa a Python.
tr_tr: İşleminizi isimlendirmeyi unutmayın ve Pyhton'da neler olacağını görün.

source: Put it all together
ca_es: Posa-ho tot junt

source: Start with the basics, <b>forward</b>, <b>left</b> and <b>right</b>
ca_es: Comença amb el més bàsic, <b>Endavant</b>, <b>esquerra</b> i <b>dreta</b>

source: Now you are coding in Python! This is what real developers do!! To start you off, the van object has been created for you already. Under this you need to add the correct Python statements to instruct the van to drive to the destination.
ca_es: Ara programes en Python! Això és el que fan els programadors de veritat! Per a ajudar-te a començar ja tens l'objecte de la furgoneta creat. A sota cal que hi afegeixis el codi adequat en Python per a fer que la furgoneta vagi fins al destí.

source: Try using the following commands:<br><pre>v.move_forwards()<br>v.turn_left()<br>v.turn_right()</pre>
ca_es: Prova de fer servir aquestes instruccions:<br><pre>v.move_forwards()<br>v.turn_left()<br>v.turn_right()</pre>
tr_tr: Aşağıdaki komutları kullanmayı deneyin: <br><pre>v.move_forwards()<br>v.turn_left()<br>v.turn_right()</pre>

source: Keep it simple
ca_es: Fes-ho fàcil

source: Try this road. Under the van object you need to add the correct Python statements to instruct the van to drive to the destination.
ca_es: Prova aquesta carretera. Sota l'objecte furgoneta has d'afegir les instruccions en Python correctes per a dirigir la furgoneta cap a la seva destinació.
tr_tr: Bu yolu deneyin. Kamyonet objesi altına doğru Pyhton komutları ekleyerek kamyonetin hedefine ulaşmasını sağlayın.

source: Try using the following commands: <pre>v.move_forwards() v.turn_left() v.turn_right()</pre>
ca_es: Prova de fer servir aquestes instruccions: <pre>v.move_forwards() v.turn_left() v.turn_right()</pre>
tr_tr: Aşağıdaki komutları kullanmayı deneyin: <pre>v.move_forwards() v.turn_left() v.turn_right()</pre>

source: Take the shortest route
ca_es: Tria el camí més curt

source: You're getting good at this! Can you drive the van along this road using the correct Python statements.
ca_es: Cada cop ho fas millor! Pots conduir la furgoneta al llarg de de la carretera fent servir les instruccions en Python correctes.
tr_tr: Gittikçe iyiye gidiyorsun! Kamyoneti bu yol boyunca doğru Python komutları kullanarak sürebilir misiniz.

source: Count and repeat
ca_es: Compta i repeteix

source: Now try to use a <b>repeat</b> loop to solve this level. Look back at level 83 to see what this could look like in Python.
ca_es: Ara prova de fer servir un bucle <b>Repeteix</b> per a solucionar el nivell. Repasa el nivell 83 per veure com es podria fer en Python.
tr_tr: Bu seviyeyi çözmek için şimdi bir <b>tekrar</b> döngüsü kullanın. Bunun Python'da nasıl görüneceğini görmek için seviye 83'e göz atın.

source: To repeat some statements a set number of times you can use something like the following: <pre>for count in range(3): v.turn left print count</pre> The print statement will output the value of count to the console.
ca_es: Per repetir algunes instruccions un cert nombre de vegades, pots fer servir quelcom com: <pre>for count in range(3): v.turn left print count</pre> La instrucció print escriurà el valor de count a la consola.
tr_tr: Bazı durumları belirli sayıda tekrar etmek için şuna benzer bir şey kullanabilirsiniz: <pre>for count in range(3): v.turn left print count</pre> Yazdırma komutu sayım değerini konsolda gösterecektir.

source: Count and repeat is easy
ca_es: Comptar i repetir és senzill

source: Now try to use a <b>repeat loop</b> to solve this level. Look back at level 83 to see what this could look like in Python. This time you could use 2 loops, 1 for each straight piece of road.
ca_es: Ara prova de fer servir el <b>bloc repeteix</b> per a resoldre aquest nivell. Fes un cop d'ull al nivell 83 per veure com es podria fer en Python. Aquest cop podries fer servir dos bucles, un per a cada segment recte de la carretera.
tr_tr: Şimdi bu seviyeyi çözmek için bir <b>tekrar döngüsü</b> kullanın. Bunun Python'da neye benzeyeceğini görmek için seviye 83'e tekrar göz atın. Bu kez her 1 tanesi ayrı düz yol parçası için olmak üzere 2 döngü kullanılabilir.

source: Loop the loop
ca_es: Fes un bucle

source: Now try to use a loop within a loop, known as a 'nested loop'. Look back at level 84 to see what this could look like in Python.
ca_es: Prova de fer servir un bucle dins un altre bucle, el que s'anomena "bucle anidat". Torna a mirar el nivell 84 per veure com es podria fer en Python.
tr_tr: Şimdi bir döngü içine başka bir döngü ekleyip 'içiçe döngü' kullanın. Bunun Python'da neye benzediğini görmek için seviye 84'e tekrar göz atın.
