Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: At each bend the van can either <b>Move forwards</b> or <b>Turn left</b>. Create a loop so it can make the correct choice. <br><br> We say that the road 'exists' in a direction. For example, if the road goes forwards we say that it 'exists forwards'.
ca_es: A cada revolt la furgoneta pot fer <b>Endavant</b> o <b>Gira a l'esquerra</b>. Crea un bucle per tal que pugui escollir correctament. <br><br> Diem que la carretera "existeix" en una direcció. Per exemple, si la carretera va endavant diem que "existeix endavant".
tr_tr: Her virajda kamyonet ya <b>İlerle</b> ya da <b>Sola Dön</b> yapabilir. Döngü oluşturulsa böylece doğru seçeneği kendi bulabilir. <br><br>Bir yönde yolun 'mevcut olduğunu' düşünelim. Örneğin, eğer yol düz ilerliyorsa 'ileri yol mevcut' diyebiliriz.

source: Let's put it all together!
ca_es: Posem-ho tot junt!

source: You have discovered the magic of 'if statements'. Can you make a program that uses <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> to get the van to the house.
ca_es: Has descobert la màgia de les "expressions condicionals". Pots fer un programa que faci servir <b>Endavant</b>, <b>Gira a l'esquerra</b> i <b>Gira a la dreta</b> per fer arribar la furgoneta a la casa.
tr_tr: 'Eğer ifadesi'nin sihrini keşfetmiş bulunmaktasın. Kamyoneti eve ulaştırmak için <b>İlerle</b>, <b>Sola Dön</b> ve <b>Sağa Dön</b> kullanarak bir program yazabilir misin?

source: What else? If-else, that's what!
ca_es: Què sinó? Si-sinó, això és el què!
tr_tr: Başka ne var? Eğer-başka, bu da nedir!

source: You can change the <b>If</b> block to make more choices. Click on the star in the <b>If</b> block and add <b>Else if</b>. <br> This will tell the van what to do if the first <b>If</b> direction can't be done. <br> For example, tell the van to <b>Turn left</b> <b>If</b> the <b>road exists left</b>. Add <b>Else if</b> the <b>road exists right</b>, <b>Turn right</b>. <br> This uses fewer blocks and makes sure that only one step is taken in each loop. <br> This type of algorithm is called a 'general algorithm' as it can be used with most simple routes.
ca_es: Pots canviar el bloc <b>Si</b> per a tenir més opcions. Fes clic a la creu del bloc <b>Si</b> per afegir un bloc <b>Sinó si</b>. <br> Això li dirà a la furgoneta què cal fer si la primera condició <b>Si</b> no es compleix. <br> Per exemple, digues-li a la furgoneta que faci un <b>Gira a l'esquerra</b> <b>si</b> <b>existeix carretera l'esquerra</b>. Afegeix un <b>Sinó si</b> <b>existeix carretera a la dreta</b> que faci un <b>Gira a la dreta</b>. <br> Això fa servir menys blocs i assegura que a cada bucle només es faci un dels passos. <br> Aquest tipus d'algorisme s'anomena un "algorisme general" perquè es pot fer servir a la majoria de rutes simples.
tr_tr: <b>Eğer</b> bloğunu biraz değiştirerek farklı seçenekler sunabilirsin. <b>Eğer</b> bloğu içindeki yıldıza tıklayın ve <b>Yoksa eğer</b> ekleyin. <br>Bu kamyonete eğer ilk <b>Eğer</b> tamamlanamazsa ne yapacağını söyleyecektir. <br>Örneğin, kamyonete <b>Eğer</b> <b>sola dönüş varsa</b> <b>Sola Dön</b> diyelim. <b>Eğer yoksa</b> <b>sağa dönüş varsa</b> <b>Sağa Dön</b> ibaresini ekleyelim.<br>Bu daha az blok kullanmanızı ve her döngüyü tek adımda tamamlamanızı sağlayacaktır. <br>Bu algoritma türüne 'genel algoritma' denmektedir ve birçok basit rota için kullanılabilir.

source: The program should be a simple set of: <b>If road exists forwards do</b> <b>Move forwards</b>, <b>Else if road exists left do Turn left</b>, <b>Else if road exists right do Turn right</b>. <br><br> You can find <b>Else if</b> by clicking the star on the <b>If</b> block and adding the <b>Else if</b>.<br><br> If the first 'condition' is true (this means if the road exists in the direction you put first) the van will follow the blocks after <b>If</b>. <br><br> If not, the van will check to see if it can follow the direction you put after <b>Else if</b>. It will keep checking until it has a direction it can take.
ca_es: El programa hauria de ser un conjunt senzill de: <b>Si existeix carretera endavant</b> fes <b>Endavant</b>, <b>Sinó si Existeix carretera a l'esquerra fes un Gira a l'esquerra</b>, <b>Sinó si existeix carretera a la dreta fes un Gira a la dreta</b>. <br><br> Pots trobar el <b>Sinó si</b> fent clic a la creu del bloc <b>Si</b> i afegint el <b>Sinó si</b>. <br><br> Si la primera "condició" és certa (és a dir si la carretera existeix en la direcció que hagis posat primer) la furgoneta seguirà els blocs dins del <b>Si</b>. <br><br> Sinó, la furgoneta comprovarà si pot seguir la direcció que hi hagi en el <b>Sinó si</b>. Seguirà comprovant-ho fins que trobi una direcció que pugui seguir.
tr_tr: Program basit bir set olarak şöyle olmalı: <b>Eğer ileri yol varsa</b> <b>İlerle</b>, <b>Yoksa eğer sola yol varsa Sola Dön</b>, <b>Yoksa eğer sağa yol varsa Sağa Dön</b>.<br><br><b>Yoksa eğer</b> ibaresini bulmak için <b>Eğer</b> bloğu içindeki yıldıza tıklayın ve <b>Yoksa eğer</b> ekleyin. <br><br>Eğer ilk 'koşul' doğru ise (yani ilk belirttiğiniz yolda ilerleme varsa) kamyonet <b>Eğer</b> bloğundan sonra gelen komutu uygulayacaktır.<br><br>Eğer değilse, kamyonet yolunu bulmak için <b>Yoksa eğer</b> den sonra gelen komutları deneyecektir. Doğru bir koşul denk gelene kadar denemeye devam edecektir.

source: A bit longer
ca_es: Una mica més llarg

source: Let's see if we can go further - this road is longer. Notice that the length of the road does not change the length of your program!
ca_es: A veure si podem anar una mica més enllà. Aquesta carretera és més llarga. Fixa't que la llargada de la carretera no canvia la mida del programa!
tr_tr: Biraz daha ileri gidelim - bu sefer yol daha uzun olsun. Unutmayın! Yolun uzun olması programınızın uzunluğuna etki etmez!

source: Think back to the solutions you produced using 'if statements' before.
ca_es: Recorda les solucions que has fet servir abans fent servir "expressions condicionals".
tr_tr: Daha önce 'eğer ifadesi' kullanarak oluşturduğunuz çözümleri hatırlayın.

source: Third time lucky!
ca_es: A la tercera va la vençuda!
tr_tr: Üçüncü deneme şansı!

source: Well done! You've got so far. <br> Can you apply the knowledge you gained going through this part of the game to this level?
ca_es: Ben fet! Has arribat fins aquí. <br> Pots aplicar el coneixement que has aconseguit per arribar fins a aquest nivell?
tr_tr: Tebrikler! Şimdiye kadar güzel ilerledin. <br>Oyunun bu bölümüne kadar edindiğin bilgiyi bu seviyeye uygulayabilir misin?

source: Dead ends!
ca_es: Culs de sac!
tr_tr: Çıkmaz sokaklar!

source: Can you use the 'general algorithm' here so that the van takes a shorter route? Or maybe there's a more efficient way? <br><br>Keep an eye on the fuel level - try to use as little as possible.
ca_es: Pots fer servir l'algorisme general aquí per fer que la furgoneta faci una ruta més curta? O potser hi ha una manera més eficient? <br><br>Ves amb compte amb el nivell de combustible: fes-ne servir tan poc com puguis.

source: Uh oh, moving around the blocks in your 'general algorithm' might not be the most efficient solution. How about creating a simple solution without 'if statements' that will help the van reach the house?
ca_es: Uhmm, moure els blocs de lloc en el teu algorisme general potser no és la solució més eficient. I si proves de crear una solució senzilla sense "expressions si" que faci que la furgoneta arribi a la casa?

source: Adjust your previous solution
ca_es: Arregla la solució anterior

source: Can you think of a way you could change the 'general algorithm' you have implemented earlier to make sure the van driver reaches the house having travelled the shortest route?
ca_es: Pots pensar com canviar l'"algorisme general" que has implementat abans per a assegurar-te que el conductor de la furgoneta arriba a la casa havent fet la ruta més curta?
tr_tr: Daha önce uyguladığın 'genel algoritmayı', kamyonetin eve en kısa yoldan seyahat edeceğine emin olacak şekilde değiştirebilir misin?

source: The 'general algorithm' will work here. <br><br> Make sure you change the order the van checks for directions to take the shortest route to the destination.
ca_es: L'"algorisme general" funciona aquí. <br><br> Assegura't de canviar l'ordre en que la furgoneta comprova les direccions per tal que faci la ruta més curta fins al destí.
tr_tr: 'Genel algoritma' burada çalışacak. <br><br> Kamyonetin en kısa rotadan hedefine ulaşması için kontrol ettiği yönlerin sıralamasını değiştirdiğinden emin ol.

source: Decision time
ca_es: Hora de decidir

source: Do you think changes to the 'general algorithm' will help the van find the shortest route? <br> Or do you have to come up with a different solution? <br> Time to make a decision...
ca_es: Creus que algun canvi a l'"algorisme general" ajudaria a la furgoneta a trobar la ruta més curta? <br> O has de pensar una solució diferent? <br> Hora de prendre una decisió...
tr_tr: Sence 'genel algoritma'daki değişiklikler kamyonetin en kısa rotayı bulmasına yardım edecek mi? <br> Ya da farklı bir çözümle mi gelmen gerekiyor? <br> Karar verme zamanı...

source: Psst! You can simply make a change to the 'general algorithm'. <br><br> If you make the van check for turns before it checks the road exists forwards, you will come up with the perfect solution. <br><br>Notice that here it doesn't matter which turn you check for first - it will change the route but provide you with the same score.
ca_es: Psst! Només cal que facis un petit canvi a l'"algorisme general". <br><br> Si fas que la furgoneta comprovi els girs abans de comprovar si existeix carretera endavant, trobaràs la solució perfecta. <br><br> Fixa't que és igual quin gir comproves primer, la ruta serà diferent però la puntuació serà la mateixa.
tr_tr: Hişt! Basitçe 'genel algoritmada' değişiklik yapabilirsin. <br><br> Kamyonetin ileri yol bulunup bulunmadığını kontrol etmesinden önce dönüşleri kontrol etmesini sağlarsan, kusursuz çözüme ulaşmış olacaksın. <br><br>İlk olarak hangi dönüşü kontrol edeceğinin burada bir önemli olmadığının farkında ol - bu, rotayı değiştirecek ancak sana aynı skorda kalmanı sağlayacak.

source: What do you think this time?
ca_es: Què en penses aquesta vegada?
tr_tr: Şimdi ne düşünüyorsun?

source: Can you use the 'general algorithm' here? <br> Can it be changed so that it finds a shorter route, or will you need a new solution?
ca_es: Pots fer servir l'"algorisme general" aquí?<br> El pots canviar per trobar una ruta més curta o necessites una solució nova?
tr_tr: 'Genel algoritmayı' burada kullanabilir misin? <br> Daha kısa bir rota bulabilmesi için değiştirilebilir mi yoksa yeni bir çözüme mi ihtiyaç var?

source: Uh oh, moving around the blocks in your 'general algorithm' won't help. <br> How about creating a simple solution without 'if statements' that will help the van reach the house?
ca_es: Oh oh, moure els blocs de l'"algorisme general" no serveix. <br> I si crees una solució senzilla sense "expressions condicionals" que ajudi a la furgoneta a arribar a la casa?
tr_tr: Hay aksi, 'genel algoritma'da blokların etrafında hareket etmek yardımcı olmayacak. <br> Peki kamyonetin eve ulaşmasına yardımcı olmak için, içerisinde 'eğer durumu' olmayan basit bir çözüm oluşturmak nasıl olur?

source: Good work! What else can you do?
ca_es: Ben fet! Què més pots fer?
tr_tr: Güzel! Başka ne yapabilirsin?

source: You should be really good at this by now. Can you manage this complicated road?
ca_es: Ja hauries de ser molt bo. Pots sortir-te'n en aquesta carretera tan complicada?
tr_tr: Artık bunda oldukça iyisin. Daha karmaşık olan bu yolla da baş edebilir misin?

source: This road cannot be solved by a 'general algorithm'. Can you solve it without 'if statements'? <br><br> Remember to choose the shortest route and an algorithm which is as short as possible.
ca_es: Aquesta carretera no es pot resoldre amb un "algorisme general". Pots solucionar-ho sense "expressions condicionals"? <br><br> Recorda fer la ruta més curta possible i l'algorisme més curt també.
tr_tr: Bu yol 'genel algoritma' ile çözülemez. Bunu 'eğer ifadesi' kullanmadan çözebilir misin?<br><br>En kısa rotayı seçtiğin gibi algoritmanın da mümkün olan en kısasını kullanmayı unutma.

source: Oh no! Traffic lights!
ca_es: Oh, no! Semàfors!
tr_tr: Hayır! Trafik lambaları!

source: The light varies from red to green. <br>The van must check which colour the traffic light is when it reaches them - if it goes past a red light it will break the Highway Code.<br> Here, you want the van to repeat the wait instruction while the traffic light is red. Drag a block inside a <b>Repeat while</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to repeat the instruction.
ca_es: El semàfor va canviant de vermell a verd. <br> La furgoneta haurà de comprovar de quin color està el semàfor quan hi arribi. Si passa en vermell estarà trencant les normes de circulació.<br> En aquest cas, vols que la furgoneta repeteixi la instrucció d'espera mentre el semàfor estigui vermell. Arrossega un bloc dins el bloc <b>Repeteix mentre</b> per fer que la furgoneta repeteixi una instrucció. <br> Afegeix-hi una "condició" per tal que la furgoneta sàpiga quan repetir la instrucció.
tr_tr: Işık kırmızıdan yeşile değişir. <br>Kamyonet, ışığa vardığında ışığın hangi renkte olduğunu kontrol etmeli - kırmızı ışıkta geçerse Karayolu Kurallarını ihlal etmiş olur.<br> Burada, kamyonetten, trafik lambaları kırmızıyken bekleme komutunu tekrarlamasını istiyorsunuz. Kamyonetin bir komutu tekrarlaması için <b>Olduğu sürece tekrarla</b> bloğunun içerisine bir blok sürükleyin.<br> Bir 'durum şart'ı eklendiğinde kamyonet, komutu ne zaman tekrarlayacağını bilecektir.

source: Don't worry about the 'general algorithm' here. Just go forwards. <br><br>Once the van is right under the traffic light, make it wait for a green light by adding a <b>Wait</b> block.
ca_es: No et preocupis per l'"algorisme general" aquí. Segueix endavant. <br><br> Quan la furgoneta sigui just sota un semàfor, fes que esperi el verd afegint un bloc <b>Espera</b>.
tr_tr: Burada 'genel algoritma' hakkında endişelenme. Sadece ilerle. <br><br>Kamyonet trafik lambasına geldiğinde yeşil ışığı beklemesi için <b>Bekle</b> bloğunu kullanarak kamyoneti beklet.

source: Green for go, red for wait
ca_es: En verd, endavant; en vermell, espera

source: Can you write a program so the van moves forwards on a green light but waits at a red light?
ca_es: Pots fer un programa que faci que la furgoneta tiri endavant als semàfors en verd però s'esperi en vermell?
tr_tr: Kamyonetin kırmızı ışıkta beklemesini ve yeşil ışıkta geçmesini sağlayacak bir program yazabilir misin?

source: Use an 'if statement' to tell the van <b>If traffic light is red, Wait, Else Move forwards</b>. <br><br> Remember to repeat that until you get to the destination.
ca_es: Fes servir una "expressió condicional" per dir-li a la furgoneta <b>si el semàfor està en vermell, espera; sinó, endavant</b>. <br><br> No t'oblidis de repetir-ho fins que arribis al destí.
tr_tr: 'Eğer deyimi'ni kullanarak kamyonete <b>Trafik ışığı kırmızı ise bekle, değilse ilerle</b> demelisin.<br><br>Hedefine ulaşana kadar bunun tekrarlanması gerektiğini unutma.

source: Well done - you've made it really far!
ca_es: Ben fet, has avançat molt!
tr_tr: Aferin - gerçekten çok ilerledin!

source: Let's practise what you've learnt so far. <br> Don't forget to add a turn and to make the van wait at a traffic light.
ca_es: Practiquem el que has après fins ara. <br> No t'oblidis de girar i de fer que la furgoneta s'esperi als semàfors.
tr_tr: Buraya kadar neler öğrendiğini tekrar edelim.<br>Dönüş eklemeyi ve kamyonetin trafik ışığında beklemesini sağlamayı unutma.

source: Be careful about the order you put your <b>If</b> blocks in. <br><br>If you make the van check the road exists forwards before checking for a light, it might break the Highway Code.
ca_es: Compte amb l'ordre dels blocs <b>Si</b>. <br><br> Si fas que la furgoneta comprovi si la carretera existeix endavant abans de comprovar un semàfor, pot saltar-se les normes de circulació.
tr_tr: <b>Eğer</b> bloklarını sıralarken dikkatli olmalısın. <br><br>Eğer ışığı kontrol etmeden önce yolda ilerleme olup olmadığını kontrol ettirirsen trafik kuralını ihlal edebilirsin.

source: What a mess! But can you spot a route?
ca_es: Quin embolic! Pots trobar-hi una ruta?
tr_tr: Bu ne dağınıklık böyle! Fakat sen rotayı bulabilir misin?

source: Put your knowledge to test. Create an algorithm to lead the van to the house. <br> Don't forget to add a turn and to make the van wait at a traffic light.
ca_es: Posa els teus coneixements a prova. Crea un algorisme per a fer arribar la furgoneta a la casa. <br> No t'oblidis de girar i de fer que la furgoneta s'esperi als semàfors.
tr_tr: Bilginizi sınayın. Kamyoneti eve götürecek bir algoritma yazın.<br>Bir dönüş eklemeyi ve minibüsün trafik lambasında beklemesini sağlamayı unutmayın.

source: Use an 'if statement' and check if the light is red. <br><br> <b>If traffic light is red, wait, Else if road exists forwards, Move forwards, Else Turn left</b>. <br><br> Remember to repeat that until you get to the destination!
ca_es: Fes servir una "expressió condicional" i comprova si el semàfor està vermell. <br><br> <b>Si el semàfor està en vermell, espera, sinó si existeix carretera endavant, ves Endavant, sinó Gira a l'esquerra</b>. <br><br> No t'oblidis de repetir-ho fins que arribis al destí!
tr_tr: Lambanın kırmızı olup olmadığını kontrol etmek için 'eğer deyimi'ni kullanın. <br><br><b>Eğer trafik lambası kırmızı ise bekle, yoksa eğer ilerleme varsa ilerle, yoksa sola dön</b>.<br><br>Hedefe ulaşana kadar bunu tekrarlamayı unutmayın!

source: Put all that hard work to the test
ca_es: Posa tota aquesta feinada a prova

source: Congratulations - you've made it really far! <br> Can you create a 'general algorithm' that will help the van reach the destination in the shortest way but stop at a traffic light?
ca_es: Felicitats! Has arribat molt lluny! <br> Pots crear un "algorisme general" que ajudi a la furgoneta a arribar al destí pel camí més curt però parant al semàfor?
tr_tr: Tebrikler - gerçekten çok iyiydin!<br>Kamyonetin en kısa rotadan hedefine ulaşmasını ama kırmızı ışık varsa da durmasını sağlayacak bir 'genel algoritma' oluşturabilir misin?

source: You need to check: <ul><li> if the lights are red </li><li> if the road exists right </li><li> if the road exists forwards </li> <li> if the road exists left </li><li> if it is a dead end </li></ul>Make sure you put the checks in the right order.
ca_es: Has de comprovar: <ul><li>Si el semàfor està en vermell </li><li> Si la carretera existeix a la dreta </li><li> Si la carretera existeix endavant </li> <li> Si la carretera existeix a l'esquerra </li><li> si és un cul de sac </li></ul>No t'oblidis de posar les comprovacions en l'ordre correcte.
tr_tr: Şunu kontrol etmelisiniz: <ul><li>Işıkların kırmızı olup olmadığını </li> <li>Sağa dönüş olup olmadığını</li> <li>İleriye yol olup olmadığını</li> <li>Sola dönüş olup olmadığını</li> <li>Çıkmaz sokak olup olmadığını</li> </ul> Kontrolleri doğru sıraya koyduğunuzdan emin olun.

source: Amazing! Have another go!
ca_es: Fantàstic! Torna-ho a provar!
tr_tr: İnanılmaz! Başka bir tane daha deneyin!

source: Can you change the 'general algorithm' you created before to make the van take the shortest route to the destination?
ca_es: Pots canviar l'"algorisme general" que has creat abans per tal que faci arribar la furgoneta al destí per la ruta més curta?
tr_tr: Daha önce oluşturduğun 'genel algoritma'yı, kamyoneti hedefine en kısa rotadan götürecek şekilde değiştirebilir misin?

source: You need to check: <ul><li> if the light is red </li><li> if the road exists left </li><li> if the road exists forwards </li><li> or if the road exists right </li></ul>Do you think you need to check for a dead end? <br> Make sure you put the checks in the right order.
ca_es: Has de comprovar: <ul><li> Si el semàfor està vermell </li><li> Si la carretera existeix a l'esquerra </li><li> Si la carretera existeix endavant </li><li> o si la carretera existeix a la dreta </li></ul>Creus que cal comprovar si hi ha un cul de sac? <br>No t'oblidis de posar les comprovacions en l'ordre correcte.
tr_tr: Şunu kontrol etmelisiniz: <ul><li>Işıkların kırmızı olup olmadığını </li> <li>Sola dönüş olup olmadığını</li> <li>İleri yol olup olmadığını</li> <li>veya sağa dönüş olup olmadığını</li></ul>Çıkmaz sokağı kontrol etmenize gerek var mı? <br> Kontrolleri doğru sıraya koyduğunuzdan emin olun.

source: Light maze
ca_es: Laberint de semàfors

source: Well this is tricky. Look at all those lights! <br> Can you find the shortest route to the destination? It would be good if the van doesn't have to wait at too many lights.
ca_es: Bé, aquest és complicat. Mira quants semàfors! <br> Pots trobar la ruta més curta fins al destí? Estaria bé que la furgoneta no hagi d'esperar a gaires semàfors.
tr_tr: Bu biraz zor. Tüm şu ışıklara bakın! <br> Hedefe giden en kısa rotayı bulabilir misin? Kamyonet ışıklarda fazla beklemezse iyi olur.

source: Don't worry about the algorithm you've already come up with. Take the first turn left which has fewer traffic lights. <br><br> Once your van is right under the traffic lights, make sure it waits for a green light.
ca_es: No et preocupis per l'algorisme que ja tenies. Gira a la primera a l'esquerra, que té menys semàfors. <br><br> Quan la furgoneta estigui just sota els semàfors, no t'oblidis d'esperar que estiguin verds.
tr_tr: Hazırladığınız algoritma hakkında endişelenmeyin. İlk dönüşü en az trafik lambasına sahip olan sola doğru yapın.<br><br>Kamyonet trafik ışıklarına geldiğinde, yeşil için beklediğinden emin olun.

source: Back to basics with a twist
ca_es: Tornar a començar amb un canvi

source: Can you come up with a solution to this level using the limited number of blocks we provide at the start?
ca_es: Pots trobar una solució per aquest nivell amb només els pocs blocs que et donem d'entrada?
tr_tr: Başlangıçta verdiğimiz sınırlı sayıdaki blokları kullanarak bu seviye için çözüm oluşturabilir misin?

source: Think back to earlier levels - what did you learn?
ca_es: Recorda els nivells anteriors. Què hi has après?
tr_tr: Önceki seviyeleri düşün - neler öğrendin?

source: A Bit more Tricky
ca_es: Una mica més complicat

source: Well done so far! Can you find a solution to this road? You have to move forward, but you have no forward block to use. Do you know how to help the van get to the destination?
ca_es: Ben fet fins ara! Pots trobar una solució per a aquesta carretera? Has d'anar endavant, però no tens cap bloc Endavant disponible. Saps com ajudar a la furgoneta a arribar al destí?
tr_tr: Buraya kadar çok iyiydin! Bu yol için bir çözüm bulabilir misin? İleri gitmek zorundasın fakat ilerleme bloğun yok. Kamyoneti hedefe nasıl ulaştırabileceğini biliyor musun?

source: Don't forget to use the repeat loop.
ca_es: No t'oblidis de fer servir el bucle Repeteix.
tr_tr: Tekrarlama döngüsünü kullanmayı unutmayın.

source: Choose your blocks wisely
ca_es: Tria bé els blocs

source: Can you find the shortest route? Use your blocks carefully and don't forget the <b>repeat</b> loop.
ca_es: Pots trobar la ruta més curta? Fes servir els blocs amb compte i t'oblidis del bucle <b>Repeteix</b>.
tr_tr: En kısa rotayı bulabilir misin? Blokları dikkatli kullanın ve <b>Tekrarla</b> döngüsünü unutmayın.

source: Think back to earlier levels - what did you learn
ca_es: Recorda els nivells anteriors. Què hi has après
tr_tr: Önceki seviyeleri düşünün - neler öğrendiniz

source: Round and Round
ca_es: Voltes i més voltes

source: Wonky Fish!
ca_es: Peix ondulat!
