Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: Code For Life : Custom level to moderate
ca_es: Code For Life: Nivell personalitzat per moderar
tr_tr: Yaşam İçin Kodla: Yönetmek için özel seviye

source: Your student {student_name} from your class {class_name} has created this level: {level_url}. If you want to moderate it, you can do it on the moderation board: {moderate_url}. Thanks, The Code for Life team. {home_url}
ca_es: L'alumne {student_name} de la classe {class_name} ha creat aquest nivell: {level_url}. Si vols moderar-lo, ho pots fer al panell de moderació: {moderate_url}. Gràcies, l'equip de Code For Life. {home_url}
tr_tr: {class_name} sınıfınızdaki öğrenciniz {student_name} şu seviyeyi oluşturdu: {level_url}. Bu seviyeyi yönetmek istiyorsanız, bunu yönetim panelinden yapabilirsiniz: {moderate_url}. Teşekkürler, Yaşam için Kodla ekibi. {home_url}

source: Play button
ca_es: Botó d'inici
tr_tr: Oynat butonu

source: You have no permission to see this.
ca_es: No tens permís per veure això.
tr_tr: Bunu görmek için izniniz yok.

source: This level is private. You can only see the public levels and the ones created by other users only if they share them with you.
ca_es: Aquest nivell és privat. Només pots veure els nivells públics i els creats per altres usuaris si els han compartit amb tu.
tr_tr: Bu seviye gizli. Sadece genel seviyeleri ve diğer kullanıcılar tarafından oluşturulup sizinle paylaştıkları seviyeleri görebilirsiniz.

source: No permission
ca_es: Sense permís
tr_tr: İzin yok

source: Scoreboard is only visible to school students and teachers. Log in if you think you should be able to see it.
ca_es: La puntuació només és visible per a alumnes i professors. Inicia sessió si creus que l'hauries de poder veure.
tr_tr: Puan tablosu sadece okul öğrencilerine ve öğretmenlere görünür. Görebilecek durumda olduğunuzu düşünüyorsanız giriş yapınız.

source: There is no data to show. Please contact your administrator if this is unexpected.
ca_es: No hi ha dades per mostrar. Contacta amb l'administrador si aquesta situació és inesperada.
tr_tr: Gösterilecek veri bulunmuyor. Eğer bu beklenmeyen bir durum ise yöneticiniz ile irtibata geçiniz.

source: Level moderation is only visible to teachers. Log in if you think you should be able to see it.
ca_es: La moderació de nivells només és visible per a professors. Inicia sessió si creus que l'hauries de poder veure.
tr_tr: Seviye yönetimi sadece öğretmenlere açıktır. Görebilecek durumda olduğunuzu düşünüyorsanız giriş yapınız.

source: You do not teach this class. Please contact your administrator if this is unexpected.
ca_es: No ets el professor d'aquesta classe. Contacta amb l'administrador si aquesta situació és inesperada.
tr_tr: Bu sınıfa ders veremezsiniz. Eğer bu beklenmeyen bir durumsa sistem yöneticinizle irtibata geçiniz.

source: You do not teach this student. Please contact your administrator if this is unexpected.
ca_es: No ets el professor d'aquest alumne. Contacta amb l'administrador si aquesta situació és inesperada.
tr_tr: Bu öğrenciye ders veremezsiniz. Eğer bu beklenmeyen bir durumsa sistem yöneticinizle irtibata geçiniz.

source: You have not created any classes and therefore is no data to show. Please contact your administrator if this is unexpected.
ca_es: No has creat cap classe i, per tant, no hi ha dades per mostrar. Contacta amb l'administrador si aquesta situació és inesperada.
tr_tr: Henüz bir sınıf oluşturmadınız. Bu nedenle gösterilecek bir veri bulunmuyor. Eğer bu beklenmeyen bir durumsa lütfen sistem yöneticinizle irtibata geçin.

source: Level Share
ca_es: Compartir nivell
tr_tr: Seviye Paylaşımı

source: You shared your level with {0} {1} successfully!
ca_es: S'ha compartit el teu nivell amb {0} {1}!
tr_tr: Seviyenizi {0} {1} ile başarıyla paylaştınız!

source: You shared your level with class {0} successfully!
ca_es: S'ha compartit el teu nivell amb la classe {0}!
tr_tr: Seviyenizi {0} sınıfı ile başarıyla paylaştınız!

source: We were unable to find %(name)s %(surname)s.
ca_es: No s'ha pogut trobar a %(name)s %(surname)s.
tr_tr: Biz %(name)s %(surname)s bulamadık.

source: We were unable to find class %(class)s. Are you sure you got it right?
ca_es: No s'ha pogut trobar la classe %(class)s. Estàs segur que ho has escrit bé?
tr_tr: Biz %(class)s sınıfını bulamadık. Doğru olduğundan emin misiniz?

source: It seems that you have not created any levels. How about creating one now?
ca_es: Sembla que no has creat cap nivell. I si en crees un?
tr_tr: Henüz bir düzey oluşturmadığınız görünüyor. Yeni bir tane oluşturmak ister misiniz?

source: All the levels you have created so far. Click on them to play them or share them with your friends.
ca_es: Tots els nivells que has creat fins ara. Fes clic per a jugar-hi o compartir-los amb els teus amics.
tr_tr: Şuana kadar oluşturduğunuz tüm düzeyler. Oynatmak veya arkadaşlarınızla paylaşmak için onlara tıklayın.

source: All the levels created by others that were shared with you. Click on them to play them
ca_es: Tots els nivells creats per altres i compartits amb tu. Fes clic per a jugar-hi
tr_tr: Başkaları tarafından oluşturulmuş ve sizinle paylaşılmış düzeyler. Oynatmak için tıklayın

source: No one shared a level with you yet.
ca_es: Ningú ha compartit cap nivell amb tu encara.
tr_tr: Henüz hiç kimse sizinle bir düzey paylaşmadı.

source: Choose a class you want to see.
ca_es: Tria quina classe vols veure.
tr_tr: Görmek istediğiniz sınıfı seçin.

source: You don't have permissions to see this.
ca_es: No tens permís per veure-ho.
tr_tr: Bunu görüntülemek için izniniz yok.

source: Can you find the shortest route?
ca_es: Ets capaç de trobar la ruta més curta?
tr_tr: En kısa yolu bulabilir misin?

source: Think back to earlier levels. What did you learn?
ca_es: Recorda els nivells anteriors. Què hi has après?
tr_tr: Önceki seviyeleri düşünün. Neler öğrendiniz?

source: Can you help the van get to the house?
ca_es: Pots fer arribar la furgoneta a la casa?
tr_tr: Kamyonetin eve gitmesine yardım edebilir misin?

source: Choose the right blocks to tell the van where to go. <br> Drag the blocks under the <b>Start</b> block to attach them. <br> To remove a block, drag it into the bin in the bottom right of the screen. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Escull els blocs correctes per indicar a la furgoneta on ha d'anar. <br> Arrossega els blocs sota el bloc d'<b>Inici</b> per a enganxar-los-hi. <br> Per a eliminar un bloc, arrossega'l a la paperera de la cantonada inferior dreta de la pantalla. <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Kamyonete nereye gitmesi gerektiğini söylemek için doğru blokları seçin. <br>Blokları sürükleyin ve <b>Başlangıç</b> bloğunun altında birbirine tutturun. <br>Bloğu kaldırmak için ekranın sağ alt tarafında yer alan çöp kutusuna sürükleyin. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: Drag the <b>Move forwards</b> block so that it is under the <b>Start</b> block - close enough to be touching. <br><br>Clicking on the arrows next to the %(play_button)s button will also drag the blocks into a sequence for you. <br><br>Don't forget to press %(play_button)s when you are done.
ca_es: Arrosega el bloc <b>Endavant</b> just tocant per sota el bloc <b>Inici</b>. <br><br> Fer clic a les fletxes del costat del botó %(play_button)s també posa els blocs en ordre. <br><br>No t'oblidis de prémer %(play_button)s quan hagis acabat.
tr_tr: <b>İlerle</b> bloğunu sürükleyip <b>Başlangıç</b> bloğuna değecek kadar yaklaştırın. <br><br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir. <br><br>Hazır olduğunuzda %(play_button)s butonuna basmayı unutmayın.

source: This time the house is further away
ca_es: Aquest cop la casa és més lluny.

source: A block can be placed next to or under another, like a jigsaw. A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br> To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Un bloc es pot col·locar sota d'un altre, com un puzzle. Un segon bloc <b>Endavant</b> es pot col·locar sota el primer bloc <b>Endavant</b>. <br> Per a eliminar un bloc, arrossega'l a l'esquerra de la pantalla o a la paperera. <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Bloklar, diğer blokların yanına veya altına yapboz gibi yerleştirilebilir. İkinci <b>İlerle</b> bloğu ilk <b>İlerle</b> bloğunun altına yerleştirilebilir. <br>Bloğu kaldırmak için ya sol tarafa ya da çöp kutusuna sürükleyip bırakın. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: A second <b>Move forwards</b> block can be placed under the first <b>Move forwards</b> block. <br><br>The arrows next to the <b>%(play_button)s</b> button will drag the blocks into a sequence for you.
ca_es: Un segon bloc <b>Endavant</b> es pot col·locar sota el primer bloc <b>Endavant</b>. <br><br>Les fletxes del costat del botó <b>%(play_button)s</b> posaran els blocs en ordre.
tr_tr: İkinci <b>İlerle</b> bloğu ilk <b>İlerle</b> bloğunun altına yerleştirilebilir. <br><br><b>%(play_button)s</b> butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: Can you make the van turn right?
ca_es: Pots fer que la furgoneta giri a la dreta?
tr_tr: Kamyoneti sağa döndürebilir misin?

source: This time, the van has to turn right to reach the house. Make sure you use the <b>Turn right</b> block in your sequence. <br> Drag the blocks and attach them under the <b>Start</b> block like before. To remove a block, drag it back to the left of the screen or drop it in the bin. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Aquesta vegada, la furgoneta ha de girar a la dreta per arribar a la casa. No oblidis fer servir el bloc <b>Gira a la dreta</b> en la seqüència. <br> Arrossega els blocs i enganxa'ls sota el bloc <b>Inici</b> com abans. Per eliminar un bloc, torna'l a arrossegar a l'esquerra de la pantalla o a la paperera. <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Bu sefer kamyonet, eve gitmek için sağa dönmek zorunda. Sıralamanızda <b>Sağa Dön</b> bloğu kullandığınızdan emin olun. <br> Daha öncesinde olduğu gibi blokları <b>Başlangıç</b> bloğunun altına sürükleyerek birbirine tutturun. Bloku kaldırmak için ekranın soluna veya çöp kutusuna sürükleyin. <br> Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: A <b>Turn right</b> block can be placed under the first <b>Move forwards</b> block. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Pots col·locar un bloc <b>Gira a la dreta</b> sota el primer bloc <b>Endavant</b>. <br><br> Les fletxes del costat del botó %(play_button)s posaran els blocs en ordre.
tr_tr: <b>Sağa Dön</b> bloğu, ilk <b>İlerle</b> bloğunun altına yerleştirilebilir. <br><br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: You are getting good at this! Let's try turning left
ca_es: Cada vegada ho fas millor! Provem de girar a l'esquerra.

source: This time the van has to go left. Make sure you use the <b>Turn left</b> block in your sequence. <br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Aquesta vegada la furgoneta ha de girar a l'esquerra. No oblidis fer servir el bloc <b>Gira a l'esquerra</b> en la seqüència. <br> Arrossega i enganxa els blocs com abans. <br> Quan estiguis content amb la seqüència, prem %(play_button)s!
tr_tr: Bu sefer kamyonet sola dönmek zorunda. Sıralamada <b>Sola Dön</b> bloğunu kullandığınızdan emin olun. <br>Daha öncekiler gibi blokları sürükleyip birbirine tutturun. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: A <b>Turn left</b> block can be placed under a series of <b>Move forwards</b> blocks. <br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Pots col·locar un bloc <b>Gira a l'esquerra</b> sota uns quants blocs <b>Endavant</b>. <br> Les fletxes del costat del botó %(play_button)s posaran els blocs en ordre.
tr_tr: <b>Sola Dön</b> bloğu, <b>İlerle</b> bloklarının altına yerleştirilebilir. <br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: Good work! You are ready for something harder
ca_es: Ben fet! Ja estàs preparat per a alguna cosa més difícil.

source: You already know how to make the van turn left or right. This time the van has to make lots of turns to reach the house. <br> Drag and attach the blocks to make your sequence.<br> When you are happy with your sequence, press %(play_button)s!
ca_es: Ja saps com fer girar la furgoneta a l'esquerra o a la dreta. Aquesta vegada al furgoneta ha de fer moltes voltes per a arribar a la casa. <br> Arrossega i enganxa els blocs per construir la seqüència. <br> Quan estiguis content amb la seqüència, prem %(play_button)s!
tr_tr: Artık kamyoneti nasıl sağa veya sola döndüreceğini biliyorsun. Bundan sonra kamyonet birkaç dönüş yaparak eve ulaşacak. <br>Sıralamayı oluşturmak için blokları sürükleyip birbirine tutturun. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: This road starts by curving to the <b>left</b>. Then it curves to the <b>right</b>. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Aquesta carretera comença amb un revolt a l'<b>esquerra</b>. Després fa un revolt a la <b>dreta</b>.<br><br> Les fletxes del costat del botó %(play_button)s posaran la seqüència en ordre.
tr_tr: Bu yol <b>sola</b> dönüş ile başlamaktadır. Daha sonra <b>sağa</b> dönmektedir. <br><br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: Well done! Let's use all three blocks
ca_es: Ben fet! Ara fem servir els tres blocs.

source: This time the van has to <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b>. <br><br> Drag and attach the blocks like before. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Aquesta vegada la furgoneta ha de fer els següents moviments: <b>Endavant</b>, <b>Gira a la dreta</b>. i <b>Gira a l'esquerra</b> <br><br> Arrossega i enganxa els blocs com abans. <br> Quan estiguis content amb la seqüència, prem %(play_button)s!
tr_tr: Bu sefer kamyonet <b>İlermek</b>, <b>Sola Dönmek</b> ve <b>Sağa Dönmek</b> zorunda. <br><br>Daha öncekiler gibi blokları sürükleyip birbirine tutturun. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: Follow the road around. How many <b>Move forwards</b> do you need? <br><br>The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Segueix la carretera. Quants blocs <b>Endavant</b> necessites? <br><br> Les fletxes del costat del botó %(play_button)s posaran els blocs en ordre.
tr_tr: Yolu takip edin. Kaç adet <b>İlerle</b> bloğuna ihtiyacınız var? <br><br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: This road is more complicated
ca_es: Aquesta carretera és més complicada.

source: Practise your new skills on this road by helping the driver to arrive at the house. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Practica les teves habilitats en aquesta carretera ajudant al conductor a arribar a la casa. <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Sürücüyü evine ulaştırmak için yeni yeteneklerinizi kullanın. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: Follow the road around. Don't forget to <b>Turn left</b> first. <br><br>The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Segueix la carretera. No t'oblidis de posar primer un bloc <b>Gira a l'esquerra</b>. <br><br> Les fletxes del costat del botó %(play_button)s posaran els blocs en ordre.
tr_tr: Yolu takip edin. İlk önce <b>Sola Dön</b> bloğunu kullanmayı unutmayın. <br><br>%(play_button)s butonunun hemen yanındaki oklara tıkladığınızda bloklar sıraya otomatik olarak sürüklenecektir.

source: The warehouse is not always in the same place
ca_es: El magatzem no és sempre al mateix lloc.

source: This time the warehouse is somewhere else on the screen but you still need to use the <b>Move forwards</b> block. <br> Can you use the <b>Move forwards</b> block correctly even when it looks like the van goes in a different direction? <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Aquesta vegada el magatzem és en un altre lloc de la pantalla, però encara has de fer servir el bloc <b>Endavant</b>. <br> Saps fer servir el bloc <b>Endavant</b> correctament encara que la furgoneta vagi en una altra direcció? <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Bu sefer depo ekranın farklı bir yerinde bulunuyor fakat siz hala <b>İlerle</b> bloğunu kullanmalısınız. <br>Kamyonet farklı bir yöne giderken bile <b>İlerle</b> bloğunu doğru kullanabilir misiniz? <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: On screen, the van looks like it follows the road down. If you were in the van, it would look like you should <b>Move forwards</b>, then <b>Turn right</b>.
ca_es: A la pantalla, la furgoneta sembla que vagi avall per la carretera. Si fossis dins la furgoneta, semblaria que t'has de moure <b>Endavant</b>, i després fer un <b>Gira a la dreta</b>.
tr_tr: Ekranda, kamyonet yolu aşağıya doğru takip ediyor gibi görünüyor. Eğer kamyonette sen olsaydın, önce <b>İlerle</b> daha sonra <b>Sağa Dön</b> yapmalıymışsın gibi duruyor.

source: Can you go from right to left?
ca_es: Pots anar de dreta a esquerra?
tr_tr: Sağdan sola gidebilir misin?

source: How many times do you have to <b>Move forwards</b> before you <b>Turn left</b>?
ca_es: Quantes vegades has d'anar <b>Endavant</b> abans del <b>Gira a l'esquerra</b>?
tr_tr: <b>Sola Dön</b> yapmadan önce kaç defa <b>İlerle</b> yapılmalı?

source: Well done! How about another go?
ca_es: Ben fet! Ho vols tornar a provar?
tr_tr: Aferin! Başka birtaneye ne dersin?

source: You've done really well so far. Try to get the van to the house. <br> When you are happy with your sequence, press %(play_button)s!
ca_es: De moment ho estàs fent molt bé. Prova de fer arribar la furgoneta a la casa. <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Şimdiye kadar çok iyiydi. Şimdi kamyoneti eve ulaştırmayı deneyelim. <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: This map is not so hard. Notice that to you it looks like the road goes up, but if you were in the in the van, you would see the road goes right. <br><br> Do you know which turn the van will take next? <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Aquest mapa no és tan difícil. Fixa't que per tu sembla que la carretera vagi amunt, però si fossis dins la furgoneta, veuries que la carretera gira a la dreta. <br><br> Saps quin és el següent gir que farà la furgoneta? <br><br> Les fletxes del costat del botó %(play_button)s posaran els blocs en ordre.
tr_tr: Bu harita çok zor değil. Haritaya göre kamyonet yukarıya doğru çıkıyor gibi görünebilir, ama kamyonetin içinde olsaydın, kamyonetin sağa doğru gittiğini görebilirdin. <br><br>Kamyonetin bir sonraki dönüşünün nereye olacağını biliyor musun?<br><br>%(play_button)s butonunun yanındaki oklar blokları sıraya otomatik sürükler.

source: Snail maze!
ca_es: Recargola't!
tr_tr: Salyangoz labirent!

source: Uh oh, a tricky snail maze! Can you take the van through it? <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Ai, ai, un laberint de cargol ben difícil! Pots fer-hi passar la furgoneta? <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Ah ah, zor bir salyangoz labirenti! Kamyoneti buradan geçirebilir misin? <br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: The maze looks a bit like a snail, doesn't it? That means that for most of the time the van should only <b>Move forwards</b> and <b>Turn right</b>. <br><br> The arrows next to the %(play_button)s button will drag the blocks into a sequence for you.
ca_es: Aquest laberint s'assembla una mica a un cargol, oi? Això vol dir que, bàsicament, la furgoneta només ha de fer: <b>Endavant</b> i <b>Gira a la dreta</b>. <br><br> Les fletxes del costat del botó %(play_button)s posaran la seqüència en ordre.
tr_tr: Labirent bir salyangozu andırıyor, değil mi? Yani bu kamyonetin çoğunlukla sadece <b>Ilerle</b> ve <b>Sağa Dön</b> yapacağı anlamına geliyor. <br><br>%(play_button)s butonunun yanındaki oklar blokları sıraya otomatik sürükler.

source: Good work, by now you are able to solve quite complicated levels. Prove your skills! <br> When you are happy with your sequence, press %(play_button)s!
ca_es: Bona feina, ja ets capaç de resoldre nivells força complicats. Demostra les teves habilitats! <br> Quan estiguis satisfet amb la seqüència, prem %(play_button)s!
tr_tr: Güzel! Artık daha karmaşık seviyeleri çözebilirsin. Yeteneklerini ispatla!<br>Sıralamadan memnun olunca %(play_button)s butonuna basın!

source: This road might look much longer and more complicated, but it's not that hard. <br> Start by using <b>Move forwards</b> a few steps and <b>Move left</b>.
ca_es: Aquesta carretera pot semblar molt més llarga i complicada, però no ho és tant. <br> Comença fent servir uns quants blocs <b>Endavant</b> i després <b>Gira a l'esquerra</b>.
tr_tr: Bu yol daha uzun ve daha karmaşık görünüyor, fakat o kadar zor değil. <br><b>İlerle</b> bloğu ile başlayıp, birkaç adım ilerledikten sonra <b>Sola Dön</b> bloğunu kullanmalısın.

source: Multiple routes
ca_es: Múltiples rutes

source: Often there is more than one way to get to the house. The route that needs the fewest directions is usually best. <br> Help the van find the shortest route to the house. <br> You can press the %(play_button)s or <b>Play</b> buttons to start the van.
ca_es: Sovint hi ha més d'una manera d'arribar a la casa. La ruta que necessita menys instruccions normalment és millor. <br>Ajuda a la furgoneta a trobar la ruta més curta fins a la casa. <br>Pots prémer els botons %(play_button)s o <b>Començar</b> per engegar la furgoneta.
tr_tr: Genellikle eve giden birden fazla yol vardır. En iyi rota en az yöne sahip rotadır. <br>Kamyonete, eve giden en kısa rotayı bulması için yardım etmelisin. <br>Kamyoneti hareket ettirmek için %(play_button)s veya <b>Oynat</b> butonuna tıklayın.

source: Try taking the route that starts by turning left then turns right. Do you know what follows next?
ca_es: Prova d'agafar la ruta que comença girant a l'esquerra i després a la dreta. Saps què ve després?
tr_tr: Önce sola sonra sağa dönen bir rota deneyin. Sonrakinin ne olacağını biliyor musun?

source: Can you spot the shortest route?
ca_es: Ets capaç de trobar la ruta més curta?
tr_tr: En kısa yolu tespit edebilir misin?

source: So many options to choose from! <br> Do you know which is the shortest route to get the van to house?
ca_es: Tantes opcions per triar! <br> Saps trobar la ruta més curta per fer arribar la furgoneta a la casa?
tr_tr: Aralarından seçim yapabileceğin çok seçenek var!<br>Kamyoneti eve götürecek en kısa yolun hangisi olduğunu biliyor musun?
