Repository: pypi-data/pypi-mirror-99
Catalog: packages/rapid-router/rapid_router-2.5.7-py2.py3-none-any.whl/game/locale/*/LC_MESSAGES/django.po
Languages: ca_es, tr_tr

source: The middle route seems to be shortest. Do you know what sequence of instructions will make the van follow it?
ca_es: La ruta del mig sembla la més curta. Saps quina seqüència d'instruccions farà que la furgoneta hi passi?
tr_tr: Ortadaki rota en kısaya benziyor. Kamyonetin bu rotayı takip etmesi için gerekli olan komut sırasını biliyor musun?

source: What if there is more than one delivery?
ca_es: Què passa si hi ha més d'un lliurament?
tr_tr: Ya birden fazla teslimat varsa?

source: Our vans often need to go to more than one house. To make the van deliver to a house use the <b>Deliver</b> block. <br> Make sure your sequence gets the van to travel the shortest route!
ca_es: Sovint les nostres furgonetes han d'anar a més d'una casa. Per fer que la furgoneta faci un lliurament a una casa fes servir el bloc <b>Lliura</b>. <br> Assegura't que la seqüència fa anar la furgoneta per la ruta més curta!
tr_tr: Kamyonetlerimizin genellikle birden fazla eve gitmesi gerekiyor. Kamyonetin eve teslimat yapması için <b>teslim et</b> bloğunu kullanın. <br>Sıralamanızın kamyoneti en kısa rotada ilerlettiğinden emin olun!

source: Make the van turn left and go directly to the closest house first. This is the shortest route. <br><br> The <b>Deliver</b> block is not needed when the van is only going to one house, but you need it when the van is going to two or more houses. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
ca_es: Fes girar primer la furgoneta a l'esquerra i anar directament a la casa de més a prop primer. Aquesta és la ruta més curta. <br><br> No cal fer servir el bloc <b>Lliura</b> quan la furgoneta només ha d'anar a una casa, però l'has de fer servir quan la furgoneta hagi d'anar a dues o més cases. <br><br> Fes servir el bloc <b>Lliura</b> cada cop que la furgoneta arribi a una casa.
tr_tr: Kamyonetin, sola döndükten sonra doğruca en yakın eve gittiğinden emin olun. Bu en kısa rotadır. <br><br>Kamyonet sadece bir eve gidiyorsa <b>teslim et</b> bloğu kullanmanıza gerek yok; ancak birden fazla eve teslimat yapılacaksa kullanılması gerekir. <br><br><b>teslim et</b> bloğunu kamyonetin gittiği her evde kullanın.

source: This time there are even more houses
ca_es: Aquesta vegada hi ha encara més cases.

source: Well done! You have done really well to get so far - let's take it to the next level and add another house. <br> Can you work out the shortest, most efficient route to each house?
ca_es: Ben fet! Ho has fet molt bé per arribar tan lluny, ara ho farem encara més difícil i afegirem una altra casa. <br> Pots trobar la ruta més curta i més eficient fins a la casa?
tr_tr: Aferin! Buraya kadar gerçekten iyi bir şekilde gelmeyi başardın - hadi yeni bir ev ekleyelim ve bunu bir sonraki seviyeye taşıyalım. <br> Her ev için en kısa ve en verimli rotayı oluşturabilir misin?

source: Although the <b>Deliver</b> block is not needed when there is only one house, you need it when there are more houses, like now. <br><br>Once the van is at a house, make sure you use the <b>Deliver</b> block. Do that for each house.
ca_es: Tot i que no cal fer servir el bloc <b>Lliura</b> quan només hi ha una casa, el necessites quan hi ha més cases, com ara. <br><br>Quan la furgoneta sigui a la casa, assegura't de fer servir el boc <b>Lliura</b>. Fes-ho per cada casa.
tr_tr: Her ne kadar, <b>teslim et</b> bloğuna sadece bir tane ev varken ihtiyaç duyulmasa da, şimdiki gibi daha çok ev varken buna ihtiyaç duyarsınız.<br><br>Kamyonet eve vardığında, <b>teslim et</b> bloğunu kullandığınızdan emin olun. Her ev için bunu yapın.

source: House overload!
ca_es: Sobrecàrrega de cases!
tr_tr: Ev yüklemesi!

source: Well done, you're getting a hang of it! Can you do the same for even more houses?<br> Don't forget to use the <b>Deliver</b> block at each house.
ca_es: Ben fet, ho estàs agafant! Pots fer el mateix per encara més cases?<br> No oblidis fer servir el bloc <b>Lliura</b> a casa casa.
tr_tr: Aferin, bunun nasıl yapılacağını kavrıyorsun! Bunu daha fazla ev için de yapabilir misin?<br> Her ev için <b>teslim et</b> bloğunu kullanmayı unutma.

source: Test your sequence to make sure that the van takes the shortest route to visit all the houses on the way. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
ca_es: Prova la seqüència per assegurar-te que la furgoneta va per la ruta més curta passant per totes les cases. <br><br> Fes servir el bloc <b>Lliura</b> cada cop que la furgoneta arribi a una casa.
tr_tr: Sıralamanızı, kamyonetin yoldaki tüm evleri en kısa rotadan ziyaret ettiğinden emin olmak için test edin.<br> <br> Kamyonetin bir eve vardığı her seferde <b>teslim et</b> bloğunu kullanın.

source: This one is quite a tangle
ca_es: Aquest és un bon embolic.

source: Practise your new skills on this road by getting the van to <b>Deliver</b> to each of the houses.
ca_es: Practica les teves habilitats en aquesta carretera fent arribar la furgoneta a totes les cases i fent servir el bloc <b>Lliura</b>.
tr_tr: Yeni becerileri kamyoneti bu yoldaki evlerin her birine götürüp <b>Teslimat</b> yaptırarak uygulayın.

source: To make sure the van takes the shortest route, first turn left. <br><br> Use the <b>Deliver</b> block every time the van gets to a house.
ca_es: Per a assegurar-te que la furgoneta va per la ruta més curta, gira primer a la dreta. <br><br> Fes servir el bloc <b>Lliura</b> cada cop que la furgoneta arribi a una casa.
tr_tr: İlk önce sola dönün ve kamyonetin en kısa yolu takip ettiğinden emin olun.<br><br> Kamyonet her seferinde bir eve vardığında <b>teslim et</b> bloğunu kullanın.

source: Repeating yourself is boring
ca_es: Repetir-se és avorrit.

source: Attach a block inside the <b>Repeat</b> block to make the van repeat that instruction. <br> This means you can use one block instead of lots of blocks to do the same thing over and over again. <br> How many times do you want the instruction repeated? Type the number into the <b>Repeat</b> block. <br> The repeated sets of blocks make a 'loop'. <br><br> When you are ready, press <b>Play</b>!
ca_es: Afegeix un bloc dins el bloc <b>Repeteix</b> per a fer que la furgoneta repeteixi la instrucció. <br> Això vol dir que pots fer servir un sol bloc en lloc de molts per fer la mateixa cosa una vegada i una altra. <br> Quantes vegades vols repetir la instrucció? Escriu el número al bloc <b>Repeteix</b>.<br> El conjunt de blocs repetits fan un "bucle". <br><br> Quan estiguis preparat, prem <b>Reprodueix</b>!
tr_tr: Kamyonetin talimatları tekrarlaması için <b>Tekrarla</b> bloğunun içerisine bir blok ekleyin. <br> Bunun anlamı, bir şeyi yapmak için aynı bloğu tekrar tekrar kullanmak yerine, bir tane blok kullanılabileceğidir. <br> Talimatın kaç defa tekrarlanmasını istiyorsun? Sayıyı <b>Tekrarla</b> bloğunun içine yazın. <br> Blokların tekrarlanan setleri bir 'döngü' oluşturacaktır. <br><br> Hazır olduğunuzda, <b>Oynat</b> butonuna basın!

source: A <b>Move forwards</b> block can be placed inside a <b>Repeat</b> block (to the right of the word 'Do'). <br><br> Don't forget to change the number of times you need to repeat the instruction.
ca_es: Es pot posar un bloc <b>Endavant</b> dins un bloc <b>Repeteix</b> (a la dreta de la paraula "Fes"). <br><br> No oblidis canviar el número de vegades que cal repetir la instrucció.
tr_tr: Bir <b>İlerlet</b> bloğu <b>Tekrarla</b> bloğunun içerisine yerleştirilebilir ('Yap' kelimesinin sağ tarafına). <br><br> Komutu kaç kere tekrarlatacağınıza göre sayıyı değiştirmeyi unutmayın.

source: Use the <b>Repeat</b> block to make your sequence shorter and simpler
ca_es: Fes servir el bloc <b>Repeteix</b> per a escurçar i simplificar la seqüència.

source: You drove the van down this road on Level 5. This time, use the <b>Repeat</b> block to get the van to the house. <br> This will make your sequence shorter and simpler than last time.
ca_es: Ja has fet anar la furgoneta per aquesta carretera al Nivell 5. Aquesta vegada, fes servir el bloc <b>Repeteix</b> per a fer-la arribar a la casa. <br> Això farà la seqüència més curta i senzilla que abans.
tr_tr: Seviye 5'te kamyoneti bu yolda sürmüştün. Bu sefer, kamyoneti eve ulaştırmak için <b>Tekrarla</b> bloğunu kullanın. <br> Bu sıralamayı geçen sefere göre daha kısa ve daha basit yapacaktır.

source: This level can be broken down into three repeated sets of: <b>Turn left</b>, then <b>Turn right</b>. <br><br> These repeated steps make a 'loop'.
ca_es: Aquest nivell es pot dividir en tres grups repetits de: <b>Gira a l'esquerra</b>, i després <b>Gira a la dreta</b>. <br><br> Aquests passos repetits fan un 'bucle'.
tr_tr: Bu seviye, üç kez tekrarlanan <b>Sola dön</b>, sonra <b>Sağa dön</b> adımlarına indirgenebilir. <br> <br> Tekrarlanan bu adımlar 'döngü' oluşturacaktır.

source: Four leaf clover
ca_es: Trèvol de quatre fulles.

source: This path looks a bit like a four leaf clover. Can you take the driver through it?
ca_es: Aquest camí sembla una mica un trèvol de quatre fulles. Pots fer-hi passar el conductor?
tr_tr: Bu yol biraz dört yapraklı yoncaya benziyor. Sürücüyü buradan geçirebilir misin?

source: This level can be broken down into repeated sets of: <b>Move forwards</b>, <b>Turn left</b>, <b>Turn right</b>, <b>Turn left</b>.
ca_es: Aquest nivell es pot dividir en grups repetits de: <b>Endavant</b>, <b>Gira a l'esquerra</b>, <b>Gira a la dreta</b>, <b>Gira a l'esquerra</b>.
tr_tr: Bu seviye, tekrarlanan <b>İlerle</b>, <b>Sola dön</b>, <b>Sağa dön</b>, <b>Sola dön</b> adımlarına indirgenebilir.

source: Now things are getting quite long and complicated
ca_es: Es comença a complicar la cosa.

source: An algorithm (a set of instructions in a particular order) to get the van to the house might not be very simple, but it can be made shorter by using the <b>Repeat</b> blocks. <br> Are you up for this challenge?
ca_es: Un algorisme (un conjunt d'instruccions en un cert ordre) per a fer arribar la furgoneta a la casa pot ser complicat, però es pot escurçar fent servir els blocs <b>Repeteix</b>. <br> Preparat per a aquest repte?
tr_tr: Kamyoneti eve götürmek için kullanılan bir algoritma (belirli bir sıradaki talimat seti) çok basit olmayabilir, fakat <b>Tekrarla</b> bloğu kullanarak daha kısa hale gelebilir. <br> Bu meydan okumaya hazır mısın?

source: Look to see where you have used <b>Move forwards</b>, <b>Turn left</b> and <b>Turn right</b> blocks. Are any blocks next to them the same? Put them into one <b>Repeat</b> block. Don't forget to change the number of times you need to repeat the instruction.
ca_es: Mira on has fet servir els blocs <b>Endavant</b>, <b>Gira a l'esquerra</b> i <b>Gira a la dreta</b>. Hi ha blocs al seu voltant que siguin iguals? Posa'ls en un bloc <b>Repeteix</b>. No t'oblidis de canviar el número de vegades que cal repetir les instruccions.
tr_tr: <b>İlerlet</b>, <b>Sola dön</b> ve <b>Sağa dön</b> bloklarını nerede kullandığınızı görmek için göz atın. Bunların yanındaki her hangi bir blok benzerlik gösteriyor mu? Bunları bir <b>Tekrarla</b> bloğuna yerleştirin. Talimatların tekrarlanmasına kaç kere ihtiyaç duyacağınıza göre sayıyı değiştirmeyi unutmayın.

source: Sssssssssnake!
ca_es: Ssssssssserp!

source: This road seems to be winding just like a snake! Can you find a nice and simple route to get the van to the house?
ca_es: Aquesta carretera sembla una serp! Ets capaç de trobar una ruta senzilla per fer arribar la furgoneta a la casa?
tr_tr: Bu yol tıpkı bir yılan gibi kıvrımlı gözüküyor. Kamyoneti eve götürmek için güzel ve basit bir rota bulabilir misin?

source: How about using <b>Repeat</b> inside another <b>Repeat</b>? <br><br> This level can be broken down into sets of: <ul><li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn left</b>s, </li> <li> a set (nested loop) of <b>Move forwards</b>, </li> <li> two <b>Turn right</b>s. </li></ul>
ca_es: I si fas servir el bloc <b>Repeteix</b> dins un altre bloc <b>Repeteix</b>? <br><br> Aquest nivell es pot dividir en conjunts de: <ul><li> un conjunt (bucle anidat) de blocs <b>Endavant</b>, </li> <li> dos blocs <b>Gira a l'esquerra</b>, </li> <li>un conjunt (bucle anidat) de blocs <b>Endavant</b>, </li> <li> dos blocs <b>Gira a la dreta</b>. </li></ul>p
tr_tr: Bir <b>Tekrarla</b> içinde başka bir <b>Tekrarla</b> kullanmaya ne dersin? <br><br>Bu seviye şu setlere indirgenebilir: <ul><li> bir set (iç içe döngülü) <b>İlerlet</b>, </li> <li> iki <b>Sola dön</b>, </li> <li> bir set (iç içe döngülü) <b>İlerlet</b>, </li> <li> iki <b>Sağa dön</b>. </li></ul>

source: The road is very long and very bendy
ca_es: La carretera és molt llarga i plena de revolts

source: Wow! Look at that! It won't get more complicated than this, we promise.
ca_es: Caram! Déu n'hi do! Ara ja no es complica més, de debò.
tr_tr: Vay! Şuna bak! Bundan daha karmaşık hale gelmeyecek, söz veriyoruz.

source: With all these twists and turns, you will have to think hard about what sets of repeated instructions to use. <br><br>
ca_es: Amb tots aquests revolts, has de pensar bé quins conjunts d'instruccions has de repetir. <br><br>
tr_tr: Tüm bu kıvrılmalar ve dönüşlerle, tekrarlanan talimat setlerinden hangilerini kullanacağın hakkında sıkı düşünmelisin. <br><br>

source: Waterfall level
ca_es: Nivell de la cascada

source: Since you did so well with the repeat loops, have a go at this level.
ca_es: Ja que ho has fet tan bé amb les repeticions, prova aquest nivell.
tr_tr: Tekrar döngüleriyle çok iyi iş çıkardığına göre, artık bu seviyeyi geçebilirsin.

source: Most of the program will consist of repeated sets of <b>Move forwards</b> and a set of <b>Turn right</b> and <b>Turn left</b>.
ca_es: La majoria del programa consisteix en conjunts repetits de blocs <b>Endavant</b> i un conjunt de blocs <b>Gira a la dreta</b> i <b>Gira a l'esquerra</b>.
tr_tr: Programın çoğunluğu tekrarlanan <b>İlerlet</b> setlerinden ve bir <b>Sağa dön</b> ile <b>Sola dön</b> setinden ibarettir.

source: Winter wonderland!
ca_es: Paisatge nevat!

source: Notice the snow! You can create new levels with different 'themes' of backgrounds and decorations in the Level Editor. But first, try getting the van to the house!
ca_es: Fixa't en la neu! Pots crear nous nivells amb diferents "temes" de fons i decoracions a l'editor de nivells. Però primer, intenta aconseguir que la furgoneta arribi a la casa!
tr_tr: Karın farkına var! Farklı arka plan ve dekorasyon 'temalarıyla' Seviye Editör'ünde yeni seviyeler oluşturabilirsin. Ama öncelikle, kamyoneti eve getirmeyi dene!

source: Break the program into two <b>Repeat</b>s with a <b>Turn left</b> in between them.
ca_es: Separa el programa en dos blocs <b>Repeteix</b> amb un bloc <b>Gira a l'esquerra</b> entremig.
tr_tr: Programı iki <b>Tekrarla</b> arasında bir <b>Sola Dön</b> bloğuna indirgeyin.

source: Farmyard
ca_es: Masia

source: What a muddy road! Can you help Dee find her way from the barn to the house?
ca_es: Quina carretera més enfangada! Pots ajudar a la Dee a trobar el camí del graner a la casa?
tr_tr: Ne kadar çamurlu bir yol! Dee'nin ahırdan eve kadar yolunu bulmasına yardımcı olur musun?

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
ca_es: Assegura't que arrossegues els girs correctes al teu bloc <b>Repeteix</b>.
tr_tr: <b>Tekrarla</b> bloğuna doğru dönüş bloklarını sürüklediğinizden emin olun.

source: The big city
ca_es: La gran ciutat

source: Can you get the van from the warehouse to the house? Don't stop at any shops on the way!
ca_es: Pots fer anar la furgoneta des del magatzem fins a la casa? No et paris a cap botiga de camí!
tr_tr: Kamyoneti depodan eve götürebilir misin? Yol üzerinde hiçbir dükkanda durma!

source: Make sure you drag the correct turns into your <b>Repeat</b> block.
ca_es: Assegura't que arrossegues els girs correctes al bloc <b>Repeteix</b>.
tr_tr: <b>Tekrarla</b> blokuna doğru dönüş bloklarını sürüklediğinizden emin olun.

source: No need for numbers
ca_es: No calen números

source: Drag a block inside a <b>Repeat until</b> block to make the van repeat an instruction. <br> Attach a 'condition' so the van knows when to stop repeating the instruction. <br> Here, you want the van to repeat your instruction until it is at the destination. <br> Doing this means you don't have to work out how many times the van should repeat your instruction.
ca_es: Arrossega un bloc a dins del bloc <b>Repeteix fins que</b> per fer que la furgoneta repeteixi una instrucció. <br> Afegeix-hi una "condició" per tal que la furgoneta sàpiga quan cal parar de repetir la instrucció. <br> En aquest cas, vols que la furgoneta la repeteixi fins que arribi a la destinació. <br> Fent-ho així no cal que et preocupis de quantes vegades ha de repetir la instrucció.
tr_tr: Bir bloğu <b>-Olana Kadar Tekrarla</b> bloğunun içine sürüklerseniz kamyonet bir komutu tekrar edecektir. <br>Bir 'koşul' eklerseniz kamyonet komutu tekrar etmeyi ne zaman bırakacağını bilecektir. <br>Burada, kamyonetin hedefine ulaşana kadar komutu tekrar etmesini istiyorsunuz. <br>Böylece blokları aynı iş için tekrar tekrar eklemenize gerek kalmadan hedefe varana kadar komutunuz tekrar edilecektir.

source: The blocks should read like a sentence: '<b>Repeat until at destination do</b>: <b>Move forwards</b>'.
ca_es: Els blocs s'han de poder llegir com una frase: "<b>Repeteix fins al destí</b>: <b>Endavant</b>".
tr_tr: Bloklar cümle olarak şöyle okunabilir: '<b>Hedefe varana kadar sürekli</b>: <b>İlerle</b>'.

source: Can you do that again?
ca_es: Pots repetir-ho?
tr_tr: Bunu tekrar yapabilir misin?

source: Well done, you did it! Now have a go at using the <b>Repeat until</b> block on a road with lots of turns.
ca_es: Ben fet, ho has aconseguit! Ara intenta-ho fent servir el bloc <b>Repeteix fins</b> en una carretera amb molts revolts.
tr_tr: Tebrikler, yaptın! Şimdi <b>Olana Kadar Tekrarla</b> bloğunu kullanarak çok dönüşlü bir yol yapmalısın.

source: The blocks should read like a sentence: '<b>Repeat until at destination do</b>: <b>Turn left</b>, <b>Turn right</b>'.
ca_es: Els blocs s'han de poder llegir com una frase: "<b>Repeteix fins al destí</b>: <b>Gira a l'esquerra</b>, <b>Gira a la dreta</b>.
tr_tr: Bloklar cümle olarak şöyle okunabilir: '<b>Hedefe varana kadar tekrarla</b>: <b>Sola Dön</b>, <b>Sağa Dön</b>'.

source: Practice makes perfect
ca_es: La pràctica fa la perfecció

source: Have another go to make sure you have got the hang of it.
ca_es: Torna a provar-ho per assegurar-te que ho has agafat.
tr_tr: Tamamen anladığından emin olmak için tekrar yapabilirsin.

source: This program can be broken into repeated sets of <b>Turn left</b>, <b>Turn right</b> and two <b>Move forwards</b>.
ca_es: Aquest programa es pot dividir en conjunts repetits d'un bloc <b>Gira a l'esquerra</b>, un <b>Gira a la dreta</b> i dos <b>Endavant</b>.
tr_tr: Bu program, tekrarlanan <b>Sola dön</b>, <b>Sağa dön</b> ve iki <b>İlerlet</b> setlerine indirgenebilir.

source: Uh oh, it's <b>Until</b> fever!
ca_es: Vaja, toca la febre dels <b>Fins</b>!
tr_tr: Bir saniye, buralar <b>fazla</b> virajlı!

source: Good job! Can you help the driver reach the destination again?
ca_es: Bona feina! Pots ajudar al conductor a arribar al destí una altra vegada?
tr_tr: Harika! Sürücüye hedefine tekrar ulaşması için yardım eder misin?

source: This program is quite similar to the one you just solved. Do you remember the solution you came up with back then?
ca_es: Aquest programa és força semblant al que acabes de resoldre. Recordes la solució que has fet servir abans?
tr_tr: Bu program, an önce çözdüğüne çok benziyor. O zaman bulduğun çözümü hatırlıyor musun?

source: Now it's time to try the <b>If</b> block
ca_es: És l'hora de provar el bloc <b>Si</b>

source: Another way of telling the van what to do is to use the <b>If</b> block. For example, <b>If</b> the <b>road exists forwards do</b> <b>Move forwards</b>. <br> This is called an 'if statement'. <br> Try using the <b>If</b> block and the <b>Repeat</b> block together. <br> The <b>Repeat</b> block will stretch if you attach the <b>If</b> block inside it.
ca_es: Una altra manera de dir a la furgoneta el que cal fer és fer servir el bloc <b>Si</b>. Per exemple, <b>Si</b> <b>hi ha carretera endavant</b> vés <b>Endavant</b> <br> Això s'anomena una "expressió si". <br> Prova de fer servir el bloc <b>Si</b> i el bloc <b>Repeteix</b> alhora.<br> El bloc <b>Repeteix</b> s'eixamplarà si hi afegeixes un bloc <b>Si</b> a dins.
tr_tr: Kamyonete ne yapacağını söylemenin bir diğer yolu da <b>Eğer</b> bloğudur. Örneğin, <b>Eğer</b> <b>ileriye yol mevcutsa</b> <b>İlerle</b>. <br>Buna 'eğer şartı' denir. <br><b>Eğer</b> ve <b>Tekrarla</b> bloklarını birlikte kullanmayı deneyin. <br><b>Tekrarla</b> bloğu, içinde <b>Eğer</b> bloğu kullanılması halinde esneyecektir.

source: We say that the road 'exists' in a direction. For example, if the road goes forwards we say that it 'exists forwards'. <br><br> <b>If</b> a <b>road exists forwards</b> then <b>do Move forwards</b>.<br><br>Repeat this set to get the van to the house.
ca_es: Diem que la carretera "existeix" en una direcció. Per exemple, si la carretera va endavant diem que "existeix endavant". <br><br> <b>Si</b> la <b>carretera existeix endavant</b> llavors fes <b>Endavant</b>. <br><br> Repeteix aquest conjunt fins que la furgoneta arribi a la casa.
tr_tr: Bir yönde yolun 'mevcut olduğunu' düşünelim. Örneğin, eğer yol düz ilerliyorsa 'ileri yol mevcut' diyebiliriz. <br><br><b>Eğer</b> <b>ileri yol mevcut</b> ise <b>İlerle</b>.<br><br>Bunu kamyoneti eve ulaştırana kadar tekrarlayın.

source: Multiple <b>If</b>s
ca_es: Diversos <b>Si</b>

source: It can be handy to use <b>If</b> to give your van choices, so you don't have to give the van new instructions at every step. <br> For example: Tell the van <b>If</b> the <b>road exists forwards do Move forwards,</b> but <b>If</b> the <b>road exists left do Turn left</b>. <br> The van will choose correctly from the <b>Move forwards</b> and <b>Turn left</b> instructions depending on the road. <br> Use an 'if statement' in a 'loop' to drive the van down this bendy road.
ca_es: Pot ser útil fer servir el bloc <b>Si</b> per donar opcions a la furgoneta, per no haver de donar noves instruccions a la furgoneta a cada pas. <br> Per exemple: Digues a la furgoneta que <b>Si</b> <b>existeix carretera endavant</b> fes <b>Endavant</b>, però <b>Si</b> existeix carretera a l'esquerra</b> llavors <b>Gira a l'esquerra</b>. <br> La furgoneta escollirà correctament entre les instruccions <b>Endavant</b> i <b>Gira a l'esquerra</b> depenent de la carretera. <br> Fes servir una "expressió condicional" en un "bucle" per a guiar la furgoneta en aquesta carretera.
tr_tr: <b>Eğer</b> blokları kamyonete seçenekler sunmak için çok kullanışlıdır, böylece her adımda kamyonete yeni komutlar vermek zorunda kalmazsınız. <br>Örneğin: kamyonete, <b>Eğer</b> <b>ileri yol varsa İlerle</b>, fakat <b>Eğer</b> <b>sola yol varsa Sola Dön</b> diyebilirsiniz. <br>Kamyonet yolun durumuna bağlı olarak <b>İlerle</b> ve <b>Sola Dön</b> komutlarını otomatik olarak seçecektir.
