Repository: pypi-data/pypi-mirror-99
Catalog: packages/appy/appy-1.0.6.tar.gz/appy-1.0.6/py3/appy/*/po/*.po
Languages: fr

# workflow_comment
source: Optional comment
fr: Commentaire

# role_Manager
source: Manager
fr: Administrateur

# role_Anonymous
source: Anonymous
fr: Anonyme

# role_Authenticated
source: Authenticated
fr: Authentifié

# role_Owner
source: Owner
fr: Propriétaire

# appy_title
source: Title
fr: Titre

# event_Change
source: Data change
fr: Changement de données

# event_Deletion
source: Deletion
fr: Suppression

# event_Link
source: Link
fr: Liaison

# event_Unlink
source: Unlink
fr: Suppression

source: Modified field
fr: Champ modifié

# previous_value
source: Previous value or modification
fr: Valeur précédente ou modification

# choose_a_value
source: [ choose ]
fr: [ choisissez ]

source: Everything
fr: Tout

# no_object
source: None
fr: Aucun

# min_ref_violated
source: You must choose more elements here.
fr: Vous devez choisir plus d'éléments ici.

# max_ref_violated
source: Too much elements are selected here.
fr: Trop d'éléments sont sélectionnés ici.

# selectable_objects
source: Selectable elements
fr: Éléments sélectionnables

# selected_objects
source: Inserted elements
fr: Éléments insérés

source: Move up
fr: Déplacer vers le haut

source: Move down
fr: Déplacer vers le bas

# move_top
source: Move to top
fr: Déplacer en première position

# move_bottom
source: Move to bottom
fr: Déplacer en dernière position

# move_number
source: Update the hereabove number and click here to move this element to a new position.
fr: Modifiez le numéro ci-dessus et cliquez ici pour déplacer l'élément à une nouvelle position.

# query_no_result
source: Nothing to see for the moment.
fr: Pas de résultat.

# query_no_filtered_result
source: No result with the currently applied filter∙s.
fr: Pas de résultat, avec application du ou des filtre∙s choisi∙s.

# query_consult_all
source: consult all
fr: Tout consulter

# search_title
source: Advanced search
fr: Recherche avancée

# search_button
source: Search
fr: Rechercher

# search_clean
source: Clean
fr: Effacer

source: Search results
fr: Résultats

# search_results_all
source: All results
fr: Tous les résultats

# search_new
source: New search
fr: Nouvelle recherche

# search_from
source: From
fr: De

# search_to
source: to
fr: à

# search_or
source: or
fr: ou

# search_and
source: and
fr: et

# search_broken
source: Search results are not available anymore. Please launch a new search.
fr: Cette recherche n'est plus disponible. Veuillez en effectuer une nouvelle.

# ref_invalid_index
source: No move occurred: please specify a valid number.
fr: Aucun déplacement n'a eu lieu: veuillez spécifier un nombre valide.

# bad_int
source: An integer value is expected; do not enter any space.
fr: Une valeur entière est attendue.

# bad_float
source: A floating-point number is expected; use the dot as decimal separator, not a comma; do not enter any space.
fr: Une valeur réelle est attendue.

# bad_date
source: Please specify a valid date.
fr: Veuillez spécifier une date valide.

# bad_select_value
source: The value is not among possible values for this field.
fr: Cette valeur n'est pas permise pour ce champ.

# bad_xml
source: The field content is not well-formed XML. ${error}
fr: Le contenu du champ n'est pas du XML valide. ${error}

# range_ko
source: Choose a value between ${min} and ${max}.
fr: Choisissez une valeur entre ${min} and ${max}.

# select_delesect
source: (Un)select all
fr: Tout (dé)sélectionner

# select_auto
source: Automatic (de)selection
fr: (dé)sélection automatique

source: Unselect all
fr: Tout désélectionner

# no_elem_selected
source: You must select at least one element.
fr: Vous devez choisir au moins un élément.

# object_add
source: Add
fr: Ajouter

# object_add_from
source: Add from...
fr: Ajouter depuis...

# object_add_above
source: Add above
fr: Ajouter au-dessus

# object_add_above_from
source: Add above from...
fr: Ajouter au-dessus depuis...

# object_add_below
source: Add below
fr: Ajouter en-dessous

# object_edit
source: Edit
fr: Modifier

# object_delete
source: Delete
fr: Supprimer

# object_delete_many
source: Delete selection
fr: Supprimer la sélection

# object_unlink
source: Unlink
fr: Retirer

# object_unlink_many
source: Remove selection
fr: Retirer la sélection

# object_link
source: Insert
fr: Insérer

# object_link_many
source: Insert selection
fr: Insérer la sélection

# check_uncheck
source: (Un)check everything
fr: Tout (dé)sélectionner

# page_unlock
source: Unlock
fr: Cliquez pour déverrouiller.

source: No page.
fr: Pas de page.

# no_default_page
source: No page is currently defined as being the defaut page.
fr: Il n'y a actuellement aucune page définie comme page par défaut.

# keep_file
source: Keep the file unchanged
fr: Conserver le fichier

# delete_file
source: Delete the file
fr: Supprimer le fichier

# replace_file
source: Replace it with a new file
fr: Le remplacer par un autre

# action_confirm
source: Are you sure?
fr: Êtes-vous sûr?

# action_done
source: The action has been performed.
fr: L'action a été réalisée.

# action_ko
source: A problem occurred while executing the action.
fr: Un problème est survenu.

# action_partial
source: Action could not be performed on ${nb} element(s).
fr: L'action n'a pu être réalisée pour ${nb} élément(s).

# action_null
source: Action had no effect.
fr: L'action n'a eu aucun effet.

# action_unexecutable
source: This action can't currently be executed.
fr: Cette action ne peut actuellement pas être exécutée.

# save_confirm
source: Are you sure you want to apply this change?
fr: Êtes-vous sûr de vouloir appliquer ce changement?

# sort_confirm
source: Are you sure? You are going to permanently change the order of these elements, for all users.
fr: Êtes-vous sûr? Vous allez changer l'ordre de ces éléments de manière permanente, pour tous les utilisateurs.

# goto_link
source: Go to ...
fr: Aller à ...

# goto_first
source: Go to top
fr: Aller au début

source: Go to previous
fr: Aller à l'élément précédent

source: Go to next
fr: Aller à l'élément suivant

# goto_last
source: Go to end
fr: Aller à la fin

# goto_source
source: Go back
fr: Retour

source: Go to number
fr: Aller au n°

source: Whatever
fr: Peu importe

source: Yes
fr: Oui

source: No
fr: Non

# field_name
source: Field(s)
fr: Champ(s)

# field_required
source: Please fill this field.
fr: L'information est manquante.

# field_invalid
source: Please fill or correct this.
fr: L'information est manquante ou incorrecte.

# file_required
source: Please select a file.
fr: Veuillez choisir un fichier.

# image_required
source: The uploaded file must be an image.
fr: Le fichier à uploader doit être une image.

source: ODT
fr: ODT (LibreOffice Writer)

source: frozen
fr: gelé

# freezeField
source: (Re-)freeze
fr: (Re-)geler

# unfreezeField
source: Unfreeze
fr: Dégeler

# uploadField
source: Upload a new file
fr: Écraser par...

# upload_invalid
source: Please upload a file of the same type.
fr: Veuillez uploader un fichier du même type.

# footer_text
source: Made with <a href="http://appyframework.org" target="_blank">Appy</a>
fr: Fabriqué avec <a href="http://appyframework.org" target="_blank">Appy</a>

# captcha_text
source: Please type "${text}" (without the double quotes) in the field besides, but without the character at position ${number}.
fr: Tapez "${text}" (sans les guillemets) ci-contre, en omettant le caractère numéro ${number}.

# bad_captcha
source: The code was not correct. Please try again.
fr: Le code n'est pas correct. Veuillez réessayer avec ce nouveau code.

source: Please connect.
fr: Veuillez vous connecter.

# app_connect
source: Log in
fr: Me connecter

# want_register
source: Not registered yet ?
fr: Pas encore de compte ?

# app_register
source: Register myself
fr: M'enregistrer

# app_logout
source: Logout
fr: Me déconnecter

# app_password
source: Password
fr: Mot de passe

# app_home
source: Home
fr: Revenir à ma page principale

# login_reserved
source: This login is reserved.
fr: Ce login est réservé.

# login_in_use
source: This login is already in use.
fr: L'identifiant d'utilisateur que vous avez sélectionné est déjà utilisé ou est invalide. Choisissez-en un autre.

# login_ko
source: Login failed.
fr: L'authentification a échoué.

# login_ok
source: Welcome! You are now logged in.
fr: Bienvenue! Vous êtes maintenant connecté∙e.

# login_ok_change_password
source: Welcome! You are now logged in.<br/><br/><b>Before going further, please choose a new password.</b>
fr: Bienvenue! Vous êtes maintenant connecté∙e.<br/><br/><b>Avant de continuer, choisissez un nouveau mot de passe.</b>

# logout_ok
source: You have been logged out.
fr: Vous avez été déconnecté.

# password_confirm
source: Confirm here the password
fr: Confirmez ici le mot de passe

# password_too_short
source: Passwords must contain at least ${nb} characters.
fr: Les mots de passe doivent contenir au moins ${nb} caractères.

# passwords_mismatch
source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.

# same_password
source: Please choose a password that is different from the current one.
fr: Choisissez un mot de passe qui est différent du mot de passe actuel.

# login_context
source: Context
fr: Contexte

# auth_context_error
source: Choose an authentication context in the list besides your name. If no list appears, your profile is not configured yet: contact an administrator.
fr: Choisissez un contexte d'authentification dans la liste à côté de votre nom. Si aucune liste n'apparaît, votre profil n'est pas encore configuré: contactez un administrateur.

# object_save
source: Save
fr: Enregistrer

# object_saved
source: Changes saved.
fr: Modifications enregistrées.

# validation_error
source: Please correct the indicated errors.
fr: Corrigez les erreurs indiquées.

# validation_sub_error
source: Please consult error details in the field(s) below.
fr: Passez la souris sur l'icône en forme de point d'exclamation (sans cliquer), le détail de l'erreur sera affiché.

# error_name
source: Error
fr: Erreur

# object_cancel
source: Cancel
fr: Annuler

# object_canceled
source: Changes canceled.
fr: Modifications annulées.

# enable_cookies
source: You must enable cookies before you can log in.
fr: Vous devez activer les cookies avant de vous connecter.

source: Forgot password?
fr: Mot de passe oublié ?

# ask_password_reinit
source: Ask new password
fr: Demander un nouveau mot de passe

# wrong_password_reinit
source: Something went wrong. First possibility: you have already clicked on the link (maybe have you double-clicked?) and your password has already been re-initialized. Please check that you haven't received your new password in another email. Second possibility: the link that you received in your mailer was splitted on several lines. In this case, please re-type the link in one single line and retry. Third possibility: you have waited too long and your request has expired, or a technical error occurred. In this case, please try again to ask a new password from the start.
fr: Une erreur s'est produite. Première possibilité: vous avez déjà cliqué sur le lien (peut-être avez-vous double-cliqué?) et votre mot de passe a déjà été réinitialisé. Veuillez vérifier que vous n'avez pas déjà reçu un second email avec votre nouveau mot de passe. Deuxième possibilité: le lien que vous avez reçu par email a été découpé sur plusieurs lignes. Dans ce cas, veuillez reformer le lien sur une seule ligne. Troisième possibilité: vous avez attendu trop longtemps ou une erreur technique est survenue. Dans ce cas, veuillez recommencer la procédure depuis le début.

# reinit_mail_sent
source: A mail has been sent to you. Please follow the instructions from this email.
fr: Un email vous a été envoyé. Veuillez suivre les instructions de cet email.

# reinit_password
source: Password re-initialisation
fr: Ré-initialisation de votre mot de passe

# reinit_password_body
source: Hello,<br/><br/>A password re-initialisation has been requested, tied to this email address, for the website ${siteUrl}. If you are not at the origin of this request, please ignore this email. Else, click on the link below to receive a new password.<br/><br/>${url}
fr: Bonjour,<br/><br/>Une ré-initialisation de mot de passe a été demandée, liée à votre adresse email, pour le site ${siteUrl}. Si vous n'êtes pas à l'origine de cette demande, veuillez ignorer ce message. Sinon, cliquez sur le lien ci-dessous pour ré-initialiser votre mot de passe.<br/><br/>${url}

# new_password
source: Your new password
fr: Votre nouveau mot de passe

# new_password_body
source: Hello,<br/><br/>The new password you have requested for website ${siteUrl} is ${password}<br/><br/>Best regards.
fr: Bonjour,<br/><br/>Votre nouveau mot de passe pour le site ${siteUrl} est ${password}<br/><br/>Cordialement.

# new_password_sent
source: Your new password has been sent to you by email.
fr: Votre nouveau mot de passe vous a été envoyé par email.

# new_password_text
source: The password for this user is ${password}
fr: Le mot de passe pour cet utilisateur est ${password}

# last_user_access
source: Last access
fr: Dernier accès

# object_author
source: Author
fr: Auteur

# action_comment
source: Comment
fr: Commentaire

# create_from_predecessor
source: Create from another object
fr: Créer depuis un autre élément

# day_Mon_short
source: Mon
fr: Lun

# day_Tue_short
source: Tue
fr: Mar

# day_Wed_short
source: Wed
fr: Mer

# day_Thu_short
source: Thu
fr: Jeu

# day_Fri_short
source: Fri
fr: Ven

# day_Sat_short
source: Sat
fr: Sam

# day_Sun_short
source: Sun
fr: Dim

# day_Off_short
source: Off
fr: Férié

# day_Mon
source: Monday
fr: Lundi

# day_Tue
source: Tuesday
fr: Mardi

# day_Wed
source: Wednesday
fr: Mercredi

# day_Thu
source: Thursday
fr: Jeudi

# day_Fri
source: Friday
fr: Vendredi

# day_Sat
source: Saturday
fr: Samedi

# day_Sun
source: Sunday
fr: Dimanche

source: Day off
fr: Férié

# month_Feb_short
source: Feb
fr: Fév

# month_Apr_short
source: Apr
fr: Avr

# month_May_short
source: May
fr: Mai

# month_Jul_short
source: Jul
fr: Jui

# month_Aug_short
source: Aug
fr: Aoû

# month_Dec_short
source: Dec
fr: Déc

# month_Jan
source: January
fr: Janvier

# month_Feb
source: February
fr: Février

# month_Mar
source: March
fr: Mars

# month_Apr
source: April
fr: Avril

# month_May
source: May
fr: Mai

# month_Jun
source: June
fr: Juin

# month_Jul
source: July
fr: Juillet

# month_Aug
source: Augustus
fr: Août

# month_Sep
source: September
fr: Septembre

# month_Oct
source: October
fr: Octobre

# month_Nov
source: November
fr: Novembre

# month_Dec
source: December
fr: Décembre

source: Today
fr: Aujourd'hui

# which_event
source: Which event type would you like to create?
fr: Quel type d'événement voulez-vous créer?

# event_span
source: Extend the event on the following number of days (leave blank to create an event on the current day only):
fr: Étendre l'événement sur le nombre de jours suivants<br/>(laissez vide pour créer un événement sur cet unique jour):

# del_next_events
source: Also delete successive events of the same type.
fr: Supprimer aussi les événements successifs de même type

source: Several events
fr: Plusieurs événements

source: Timeslot
fr: Plage horaire

# timeslot_misfit
source: Cannot create such an event in the ${slot} slot.
fr: Impossible de créer ce type d'événement dans la plage horaire ${slot}.

source: Validate events
fr: Valider les événements

# validate_events_confirm
source: All the checked events will be confirmed, while the unchecked ones will be discarded. The concerned user(s) will be warned. Are you sure?
fr: Tous les événements sélectionnés seront confirmés, tandis que ceux qui sont désélectionnés seront rejetés. Le ou les utilisateurs concernés seront prévenus. Êtes-vous sûr?

# validate_events_done
source: ${validated} event(s) was (were) validated and ${discarded} was (were) discarded.
fr: ${validated} événement(s) a (ont) été validé(s) et ${discarded} ne l'a (ont) pas été.

# event_validated
source: validated
fr: validé(e)

# event_discarded
source: discarded
fr: refusé(e)

# history_insert
source: Inserted by ${userName}
fr: Inséré par ${userName}

# history_delete
source: Deleted by ${userName}
fr: Supprimé par ${userName}

# changes_show
source: Show changes
fr: Montrer les changements

# changes_hide
source: Hide changes
fr: Masquer les changements

# anonymous
source: an anonymous user
fr: un utilisateur anonyme

# page_locked
source: ${date} - This page is locked by ${user}.
fr: ${date} - Cette page est verrouillée par ${user}.

# page_not_found
source: This page does not exist or you are not allowed to consult it.
fr: Cette page n'existe pas ou vous n'êtes pas autorisé à la consulter.

# warn_leave_form
source: In some situations, by leaving this page this way, you may lose encoded data or prevent other users from editing it afterwards. Please use buttons instead.
fr: Dans certaines situations, en quittant cette page de cette manière, vous pouvez perdre les données encodées ou empêcher d'autres utilisateurs de les éditer par la suite. Veuillez utilisez les boutons ad hoc.

# unauthorized
source: You are not allowed to consult this.
fr: Vous n'êtes pas autorisé à consulter ceci.

# wrong_browser
source: Microsoft Internet Explorer is not supported.<br/>Please use a modern web browser to consult this site.
fr: Microsoft Internet Explorer n'est pas supporté.<br/>Veuillez utilisez un navigateur moderne.

# email_send
source: Send by email
fr: Envoyer par email

# email_subject
source: Mail subject
fr: Sujet

# email_body
source: Mail body
fr: Corps du message

# podmail_body
source: Hello, this email that was sent to you via ${site}. Please consult the attached file(s).
fr: Bonjour,<br/><br/>Cet email vous est envoyé depuis ${site}.<br/><br/>Veuillez consulter le(s) fichier(s) joint(s).

# result_mode_list
source: List
fr: Liste

# result_mode_grid
source: Grid
fr: Grille

# result_mode_calendar
source: Calendar
fr: Calendrier

# repeated
source: Repeated event
fr: Récurrent

# repeated_last
source: Last of a series
fr: Le dernier de la série

# icon_bold
source: Bold (Ctrl+B)
fr: Gras (Ctrl+B)

# icon_italic
source: Italic (Ctrl+I)
fr: Italique (Ctrl+I)

# icon_highlight
source: Highlight (Ctrl+H)
fr: Fluoté (Ctrl+H)

# icon_blank
source: Non breaking blank (PC: Ctrl+space, Mac: Alt+Shift+space)
fr: Espace insécable (PC: Ctrl+espace, Mac: Alt+Shift+espace)

# icon_dash
source: Non breaking dash (PC: Ctrl+-, Mac: Alt+Shift+-)
fr: Tiret insécable (PC: Ctrl+-, Mac: Alt+Shift+-)

# icon_lengthen
source: Lengthen (PC: Ctrl+_, Mac: Ctrl+!)
fr: Allonger (PC: Ctrl+_, Mac: Ctrl+!)

# no_sentence
source: No sentence is available in this context.
fr: Aucune phrase n'est disponible dans ce contexte.

# not_found
source: This page does not exist. It could have been deleted or you may request a wrong URL.
fr: Cette page n'existe pas. Elle peut avoir été effacée ou l'URL que vous demandez est incorrecte.

# server_error
source: An error occurred, our apologies. Please contact the site administrator if the problem persists.
fr: Une erreur est survenue, toutes nos excuses. Si le problème persiste, veuillez contacter le responsable de cette application.

# conflict_error
source: The system is too busy for the moment: your request could not be satisfied, our apologies. Please try again in a few seconds and contact the site administrator if the problem persists.
fr: Le système est surchargé et n'a pu répondre à votre requête, toutes nos excuses. Veuillez réessayer dans quelques secondes. Si le problème persiste, veuillez contacter le responsable de cette application.

source: Please authenticate.
fr: Veuillez vous authentifier.

# cookie_warn
source: This site uses cookies for a better user experience.
fr: Ce site utilise des cookies pour vous offrir une expérience optimale. En poursuivant la navigation, vous acceptez leur utilisation.

# cookie_accept
source: I agree
fr: OK

# cookie_read
source: Read our privacy policy.
fr: En savoir plus.

source: Pay
fr: Payer

# payment_accepted
source: Your payment was successful.
fr: Votre paiement effectué avec succès.

# payment_refused
source: We are sorry, but your payment has been refused. The order has been canceled.
fr: Nous sommes désolés, mais votre paiement a été refusé. La commande a été annulée.

# payment_canceled
source: You have canceled the payment. The order has been canceled, too.
fr: Vous avez annulé le paiement. La commande a été annulée.

# payment_abandoned
source: We are sorry, but something went wrong with your payment. Please try again.
fr: Nous sommes désolés, mais une erreur est survenue durant le processus de paiement. Veuillez réessayer.

source: Standard view
fr: Vue standard

# Base_creator
source: By
fr: Créé par

# Base_created
source: On
fr: Le

# Base_modified
source: Last updated on
fr: Dernière modification le

# Base_state
source: State
fr: État

# Base_searchable
source: Keywords
fr: Mots-clé

# Base_page_history
source: History
fr: Historique

source: User
fr: Utilisateur

# User_plural
source: Users
fr: Utilisateurs

# User_page_password
source: Password
fr: Mot de passe

# User_password
source: Password
fr: Mot de passe

# User_page_main
source: Profile
fr: Profil

# User_title
source: Title
fr: Nom, prénom

# User_name
source: Name
fr: Nom

# User_firstName
source: First name
fr: Prénom

# User_roles
source: Roles
fr: Rôles

# User_resetPassword
source: Reset password
fr: Nouveau mot de passe

# User_resetPassword_confirm
source: This will re-generate a password for this user. The new password will not be automatically sent to him: it will be shown to you. Are you sure?
fr: Ceci va générer un nouveau mot de passe pour cet utilisateur. Le nouveau mot de passe vous sera affiché; à vous de le transmettre à l'utilisateur. Êtes-vous sûr?

# User_groups
source: Groups
fr: Groupes

source: Group
fr: Groupe

# Group_plural
source: Groups
fr: Groupe

# Group_title
source: Title
fr: Titre

# Group_roles
source: Roles
fr: Rôles

# Group_users
source: Users
fr: Utilisateurs

source: Translation
fr: Traduction

# Translation_plural
source: Translations
fr: Traductions

# Translation_phase_main
source: Main labels
fr: Labels principaux

# Translation_phase_custom
source: Additional labels
fr: Labels additionnels

# Translation_title
source: Title
fr: Titre

# Translation_sourceLanguage
source: Source language
fr: Langue source

# Translation_poAutomatic
source: PO file - Main labels
fr: .po principaux

# Translation_poCustom
source: PO file - Additional labels
fr: .po additionnels

# Page_title
source: Title
fr: Titre

# Page_warning
source: Warning: uploading images will not be possible unless you save the page and edit it again.
fr: Attention: le téléversement d'images ne sera possible que si vous enregistrez la page et la modifiez à nouveau.

# Page_carousel
source: Linked carousel
fr: Carrousel lié

# Page_carousel_descr
source: The carousel you choose here will be shown just before the content of this page.
fr: Le carrousel que vous choisissez ici sera affiché juste avant le contenu de cette page.

# Page_content
source: Content
fr: Contenu

# Page_content_descr
source: Encode or update here the content of this web page.
fr: Encodez ou modifiez ici le contenu de cette page web.

# Page_query
source: Linked query
fr: Recherche liée

# Page_query_descr
source: Results computed from the query you choose here will be shown just after the content of this page.
fr: Les résultats de la recherche que vous choisissez ici apparaîtront juste en-dessous du contenu de la page.

# Page_selectable
source: Selectable
fr: Sélectionnable

# Page_selectable_descr
source: Check this box if this page can be selected in the main dropdown.
fr: Cochez cette case si cette page peut être sélectionnée dans la liste de sélection globale.

# Page_podable
source: Exportable in PDF
fr: En PDF
