Repository: pypi-data/pypi-mirror-99
Catalog: packages/appy/appy-1.0.6.tar.gz/appy-1.0.6/py3/appy/*/po/*.po
Languages: fr

# Page_podable_descr
source: Check this box if you want to enable PDF export containing the content of this page and sub-pages.
fr: Cochez cette case si vous voulez activer l'export en PDF du contenu de cette page et de ses sous-pages.

# Page_next
source: Next page
fr: Page suivante

# Page_next_descr
source: Define here the page following this one. Chaining pages is useful if you want to produce a single, composite page from several pages.
fr: Définissez ici la page qui suivra celle-ci. Chaîner les pages de la sorte est utile si vous voulez constituer une page unique, composite, faite de plusieurs pages.

# Page_previous
source: Previous page
fr: Page précédente

# Page_pages
source: Sub-pages
fr: Sous-pages

# Page_expression_descr
source: By default, this page can be seen by anyone, anonymous users included. If you want to reduce its audience, please specify here a Python expression. The expression will receive, in its context, the currently logged user in variable « user » and the page itself in variable « self ». If the expression evaluates to False, the page won't be shown. In case of any doubt about this field, please leave it empty.
fr: Par défaut, cette page peut être vue par tous, utilisateurs anonymes inclus. Si vous voulez réduire son audience, spécifiez ici une expression Python. L'expression recevra, dans son contexte, l'utilisateur connecté dans la variable « user » et la page elle-même dans la variable « self ». Si l'expression évalue à False, la page ne sera pas affichée. En cas de doute sur l'usage de ce champ, laissez-le vide.

# Page_viewCss
source: CSS class
fr: Classe CSS

# Page_viewCss_descr
source: CSS class to use when rendering the content of this page. Modify this parameter only if you know what you are doing.
fr: Classe CSS à utiliser pour effectuer le rendu de cette page. Ne modifiez ce paramètre que si vous savez ce que vous faites.

# Page_page_bg
source: Background
fr: Fond

# Page_backgroundImage
source: Background image
fr: Image de fond

# Page_backgroundImage_descr
source: When this page is shown on your app's main public page, the background image you upload here will be used instead of the standard one.
fr: Si cette page s'affiche sur la page public de votre app, l'image de fond que vous téléversez ici sera appliquée. Partout ailleurs, c'est l'image de fond standard qui sera utilisée.

# Page_backgroundSize
source: Background size
fr: Rendu

# Page_backgroundSize_descr
source: When the background image hereabove is in use, specify here how it will be rendered. This is the equivalent of CSS attribute « background-size ». Value « cover » resizes the image to cover the entire page (keeping the width/height ratio). For most pages, it produces the best results. However, if the page is very long (ie, it contains search results), prefer value « auto », that simply displays the image in its original size.
fr: Quand l'image de fond ci-dessus est utilisée, spécifiez ici comment elle sera rendue. Cet attribut est l'équivalent de l'attribut CSS « background-size ». La valeur « cover » redimensionne l'image pour qu'elle couvre la page entière (conservant le ratio largeur/hauteur). Pour la plupart des pages, c'est cette valeur qui donne les meilleurs résultats. Cela étant dit, pour les pages très longues (par exemple, celles qui affichent des résultats de recherche), préférez la valeur « auto », qui affiche simplement l'image dans sa taille originale.

# Page_parent
source: Parent
fr: Page parente

source: Carousel
fr: Carrousel

# Carousel_plural
source: Carousels
fr: Carrousels

# Carousel_page_main
source: Carousel
fr: Carrousel

# Carousel_title
source: Name
fr: Nom

# Carousel_maxWidth
source: Maximum images' width (in pixels)
fr: Largeur maximale des images (en pixels)

# Carousel_maxWidth_descr
source: If an image uploaded in the carousel has a width being larger than this number of pixels, it will be resized, keeping its width/height ratio. When shown in the carousel, the image will take the full carousel's width, being redimensioned by the browser depending on the size of its window.
fr: Si une image téléversée dans le carrousel a une largeur dépassant ce nombre, elle sera redimensionnée; le rapport largeur/hauteur sera conservé. Quand l'image sera affichée dans le carrousel, elle prendra la largeur complète de celui-ci et sera redimensionnée par le navigateur, selon la taille de sa fenêtre courante.

# Carousel_maxHeight
source: Maximum carousel's height
fr: Hauteur maximale du carrousel

# Carousel_maxHeight_descr
source: Specify here the maximum height for the carousel, including the unit, as in « 620px ». If you don't want to define this limit, set it to « none »: in that case, the real carousel's height will depend on the images' heights and the size of the browser window.
fr: Spécifiez ici la hauteur maximale du carrousel, incluant l'unité, comme sur cet exemple: « 620px ». Si vous ne souhaitez pas définir cette limite, écrivez « none »: dans ce cas, la hauteur réelle du carrousel dépendra de la hauteur de ses images et des dimensions de la fenêtre du navigateur.

# Carousel_autoSwitch
source: Automatically switch between images?
fr: Passage automatique d'une image à l'autre

# Carousel_switchInterval
source: Duration between 2 switches (in seconds)
fr: Durée entre 2 changements (en secondes)

# Carousel_elemAttributes
source: Font attributes by element type
fr: Attributs des polices par type d'élément

# Carousel_elemAttributes_color
source: Color
fr: Couleur

# Carousel_elemAttributes_font
source: Font
fr: Police

# Carousel_elemAttributes_fontSize
source: Size
fr: Taille

# Carousel_elemAttributes_fontWeight
source: Weight
fr: Poids

# fw_bold
source: Bold
fr: Gras

# fw_lighter
source: Lighter
fr: Plus léger

# fw_bolder
source: Bolder
fr: Plus accentué

# Carousel_elemAttributes_fontStyle
source: Font style
fr: Style

# Carousel_linkAttributes
source: Link attributes by element type
fr: Attributs des liens par type d'élément

# Carousel_linkAttributes_params
source: URL parameters
fr: Paramètres d'URL

# Carousel_linkAttributes_target
source: Target
fr: Cible

# Carousel_buttonBgColorA
source: Background color for « A » buttons
fr: Couleur de fond des boutons « A »

# Carousel_buttonBgColorB
source: Background color for « B » buttons
fr: Couleur de fond des boutons « B »

# Carousel_selectedColor
source: Color of the selected element
fr: Couleur de l'élément sélectionné

# Carousel_unselectedColor
source: Color of unselected elements
fr: Couleur des éléments non sélectionnés

# Carousel_bottomImage
source: Bottom border image
fr: Image de bordure inférieure

# Carousel_bottomImage_descr
source: If you upload a thin image here, it will be rendered just below the carousel, taking the same width as the images themselves, in order to produce a nice bottom border.
fr: Si vous uploadez ici une image de quelques pixels de haut, elle s'affichera juste en-dessous des images du carrousel, afin de produire une élégante bordure inférieure.

# Carousel_page_preview
source: Preview
fr: Prévisu

# Carousel_preview
source: Preview
fr: Prévisualisation

# Carousel_pages
source: Pages incorporating this carousel
fr: Pages incorporant ce carrousel

# Document_title
source: Title
fr: Nom

# Document_file
source: File
fr: Fichier

# Document_thumb
source: Thumbnail
fr: Vignette

# Document_duplicate
source: Duplicate
fr: Dupliquer

# Document_duplicate_confirm
source: You are about to duplicate this document and add the copy the same list. Are you sure ?
fr: Vous êtes sur le point de dupliquer ce document et d'ajouter la copie à la fin de la même liste. Êtes-vous sûr ?

# Document_elements
source: Elements
fr: Éléments

# Document_elements_descr
source: Define here the elements that will be positioned on top of this document rendered as a background image. An element's position is expressed as a distance from the top left corner of the image, of the form « top left ». Use percentages preferably, as in « 40% 5% »: these percentages are expressed relatively to the image's height (top) and width (left).
fr: Définissez ici les éléments qui seront superposés au document qui sera rendu comme image de fond. La position d'un élément s'exprime comme distance par rapport au coin supérieur gauche de l'image et est de la forme « top left ». Utilisez de préférence des pourcentages, comme dans « 40% 5% »: ces pourcentages s'expriment relativement à la hauteur (top) et à la largeur (left) de l'image de fond.

# et_title
source: Title
fr: Titre

# et_underTitle
source: Sub-title
fr: Sous-titre

# et_buttonA
source: Button A
fr: Bouton A

# et_buttonB
source: Button B
fr: Bouton B

# Document_elements_text
source: Text
fr: Texte

# position_ko
source: Position must be of the form « top left », as in « 40% 5% ».
fr: La position doit être de la forme « top left », comme dans « 40% 5% ».

source: Query
fr: Recherche

# Query_plural
source: Queries
fr: Recherches

# Query_page_main
source: Query
fr: Recherche

# Query_title
source: Name
fr: Nom

# Query_className
source: Searched elements
fr: Éléments cherchés

# Query_states
source: Matching states
fr: États pris en compte

# Query_sortBy
source: Sort by
fr: Trié par

# Query_sortOrder
source: Sort order
fr: Ordre de tri

# Query_sortOrder_list_asc
source: Ascending
fr: Ascendant

# Query_sortOrder_list_desc
source: Descending
fr: Descendant

# Query_mode
source: Results mode
fr: Affichage des résultats

# Query_mode_list_list
source: List
fr: Liste

# Query_mode_list_grid
source: Grid
fr: Grille

# Query_mode_list_calendar
source: Calendar
fr: Calendrier

# Query_maxPerPage
source: Results per page
fr: Résultats par page

# Query_showPods
source: Show documents to generate
fr: Montrer les documents à générer

# Query_showTitle
source: Show title and description
fr: Montrer le titre et la description

# Query_showNav
source: Show navigation between page results
fr: Montrer la navigation entre pages de résultats

# Query_showNav_list_both
source: Both
fr: Partout

# Query_showNav_list_top
source: Top
fr: Au-dessus des résultats

# Query_showNav_list_bottom
source: Bottom
fr: Sous les résultats

# Query_showNav_list_none
source: None
fr: Nulle part

# Query_navAlign
source: Alignment of navigation blocks
fr: Alignement des pavés de navigation

# Query_navAlign_list_left
source: Left
fr: Gauche

# Query_navAlign_list_center
source: Center
fr: Centré

# Query_navAlign_list_right
source: Right
fr: Droit

# Query_showFilters
source: Show filters
fr: Montrer les filtres

# Query_viaPopup
source: Via popup
fr: Via une popup

# Query_viaPopup_descr
source: When consulting search results, viewing or editing every matched element is done either in the same window or via a popup. This is determined by your app's settings. If you want to override this behaviour, specify something here. Specify « False » if you want to ensure the matched element will be opened in the same window. If you want to ensure the matched element will be shown in a popup, either specify popup's width and height, in that order, as in « 400px 300px », or simply its width, as in « 400px ». In this latter case, the popup's height will be determined automatically, according to available space in the browser window.
fr: Quand vous consultez les résultats d'une recherche, afficher ou modifier les détails d'un élément individuel se fait, soit via la même fenêtre, soit via une popup. Ceci est déterminé par les paramètres de votre app. Si vous voulez changer le comportement par défaut, utilisez le champ ci-dessous. Encodez-y « False » si vous voulez vous assurer que chaque élément individuel s'affichera dans la même fenêtre. Si, par contre, vous voulez vous assurer de l'afficher dans une popup, spécifiez-en, soit la largeur et la hauteur, dans cet ordre, comme sur cet exemple: « 400px 300px », ou uniquement sa largeur, comme, par exemple, « 400px ». Dans ce dernier cas, la hauteur de la popup sera automatiquement déterminée en fonction de l'espace disponible dans la fenêtre du navigateur.

# wrong_via_popup
source: Allowed values are:<ul><li>« False »,</li><li>a popup's width and height, in that order, separated by a space and expressed in pixels, as in « 400px 300px »,</li><li>or a popup's width only, as in « 400px ».</li></ul>
fr: Les valeurs permises sont:<ul><li>« False »,</li><li>la largeur et la hauteur d'une popup, dans cet ordre, séparées par un espace et exprimés en pixels, comme dans « 400px 300px »,</li><li>ou la largeur de la popup uniquement, comme dans « 400px ».</li></ul>

# Query_pageLayoutOnView
source: Target page layout on « view »
fr: Layout de page « view » cible

# Query_pageLayoutOnView_descr
source: When consulting search results, the main page for viewing every matched element conforms to a « page layout ». This technical concept is explained in appy/ui/layout.py. If you feel comfortable with this concept and wish to use a specific « view » page layout instead of the standard one, encode it here.
fr: Quand vous consultez les résultats d'une recherche, la page principale accédée pour visualiser chaque élément individuel se conforme à un « layout de page ». Ce concept technique est documenté dans appy/ui/layout.py. Si vous vous sentez à l'aise avec ce concept et souhaitez utiliser un layout de page de type « view » spécifique au lieu de celui défini par défaut, encodez-le ici.

# Query_pages
source: Pages incorporating this query
fr: Pages incorporant cette recherche

# Tool_page_users
source: Users
fr: Utilisateurs

# Tool_users
source: Users
fr: Utilisateurs

# Tool_page_online
source: Online
fr: En ligne

# Tool_synchronizeExternalUsers
source: Synchronize external users
fr: Synchro LDAP

# Tool_synchronizeExternalUsers_confirm
source: This will read the the whole LDAP users database as visible by this app and create or update every user's local copy. Are you sure?
fr: Ceci va lire l'entièreté de la base d'utilisateurs LDAP telle que visible par ce site et créer ou mettre à jour la copie locale de chaque utilisateur. Êtes-vous sûr?

# Tool_page_groups
source: Groups
fr: Groupes

# Tool_groups
source: Groups
fr: Groupes

# Tool_page_translations
source: Translations
fr: Traductions

# Tool_translations
source: Translations
fr: Traductions

# Tool_defaultPage
source: Default page
fr: Page par défaut

# Tool_defaultPage_descr
source: The page defined here will be selected as home page.
fr: La page choisie ici sera utilisée comme page d'accueil du site.

# Tool_page_carousels
source: Carousels
fr: Carrousels

# Tool_carousels
source: Carousels
fr: Carrousels

# Tool_carousels_descr
source: A carousel is like a slideshow, allowing to define a series of images and switch from one to the other with a nice effect. After having defined a carousel and its inner images here, link it to the desired page: it will appear before its content.
fr: Un carrousel est comme un diaporama d'images, faisant défiler celles-ci automatiquement avec un effet de transition. Après avoir défini ici un carrousel, ses images et les textes à leur superposer, liez-le à la page souhaitée: il apparaîtra juste avant son contenu.

# Tool_page_queries
source: Queries
fr: Recherches

# Tool_queries
source: Queries
fr: Recherches

# Tool_queries_descr
source: If you want to include, in your web pages, search results, create Queries here and then, link them to the appropriate page(s) where these results must appear.
fr: Si vous souhaitez incorporer, dans vos pages web, des résultats de recherches, créez ici des Recherches, puis liez-les aux pages au sein desquelles vous voulez qu'ils apparaissent.

# Tool_calendar
source: Calendar
fr: Calendrier

# Anonymous_active
source: Active
fr: Actif∙ve

# Authenticated_active
source: Active
fr: Actif∙ve

# Owner_active
source: Active
fr: Actif∙ve

# Owner_inactive
source: Inactive
fr: Inactif/ve

# Owner_deactivate
source: Deactivate
fr: Désactiver

# Owner_deactivate_confirm
source: Are you sure ?
fr: Êtes-vous sûr ?

# Owner_reactivate
source: Reactivate
fr: Réactiver

# Owner_reactivate_confirm
source: Are you sure ?
fr: Êtes-vous sûr ?

# TooPermissive_created
source: Created
fr: Créé∙e
