Repository: pypi-data/pypi-mirror-99
Catalog: packages/kadi/kadi-0.9.0-py3-none-any.whl/kadi/plugins/zenodo/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Unknown error
de: Unbekannter Fehler

source: Zenodo is a general-purpose open-access repository developed and operated by CERN. It allows researchers to deposit data sets, research software, reports, and any other research related digital artifacts. Connecting your account to Zenodo makes it possible to directly upload records to Zenodo.
de: Zenodo ist ein vom CERN entwickeltes und betriebenes Mehrzweck-Open-Access-Repository. Es ermöglicht Forschern die Hinterlegung von Datensätzen, Forschungssoftware, Berichten und allen anderen forschungsbezogenen digitalen Artefakten. Durch die Verbindung Ihres Accounts mit Zenodo ist es möglich, Records direkt in Zenodo hochzuladen.

source: Note that records uploaded to Zenodo will not be published directly, i.e. each record can be reviewed and edited via Zenodo before publishing.
de: Beachten Sie, dass in Zenodo hochgeladene Records nicht direkt publiziert werden, d.h. jeder Record kann vor der Publizierung über Zenodo überprüft und bearbeitet werden.

source: The following metadata of a record will be used for the upload to Zenodo:
de: Die folgenden Metadaten eines Records werden für den Upload in Zenodo verwendet:

source: Title
de: Titel

source: License
de: Lizenz

source: Description
de: Beschreibung

source: Note that Zenodo only supports a limited amount of Markdown/HTML tags
de: Beachten Sie, dass Zenodo nur eine begrenzte Anzahl von Markdown/HTML-Tags unterstützt

source: Tags will be used as keywords in Zenodo
de: Tags werden in Zenodo als Keywords verwendet

source: Creator
de: Ersteller

source: The display name of the record's creator will be used as the first author in Zenodo
de: Der Anzeigename des Erstellers des Records wird in Zenodo als Erstautor verwendet

source: Any extra metadata will be uploaded as a separate JSON file called "_meta.json"
de: Alle Extra-Metadaten werden als separate JSON-Datei mit dem Namen "_meta.json" hochgeladen

source: All records will be uploaded as <em>Dataset</em>.
de: Alle Datensätze werden als <em>Dataset</em> hochgeladen.

source: Error uploading record.
de: Fehler beim Hochladen des Records.

source: The following error occured while uploading the record to Zenodo:
de: Der folgende Fehler trat beim Hochladen des Records in Zenodo auf:

source: Record uploaded successfully.
de: Record erfolgreich hochgeladen.

source: To review and publish your upload via Zenodo, head to the following URL:
de: Um Ihren Upload über Zenodo zu überprüfen und zu veröffentlichen, gehen Sie auf die folgende URL:
